{
  "announcements": [
    {
      "title": "Evangelism Report in Kenya - July 2024",
      "summary": "In this Evangelism Report we would like to highlight our mission to spread the gospel, inspired by Matthew 28:19 and Mark 16:15-18, which emphasizes teaching, baptizing, and performing miracles as signs of faith. We express our gratitude to Jesus, our supportive members, and the leadership of the Jesus Alone is God Headquarter Church. Jesus has enabled us to baptize ten individuals, with six more preparing, totaling thirty-one new believers. Motivated by the endurance of ministry described in 2 Corinthians 4:1-5, we remain dedicated to preaching the gospel truthfully. Despite challenges like insufficient funds and equipment, we traveled to Kisii County and Kajiado County, where we witnessed healing and deliverance. Our efforts, including an open-air crusade, resulted in twenty-five church members hearing the gospel and one person accepting Jesus. We conclude with a call to remain faithful in our mission, addressing any obstacles to effectiveness, and living a life that draws others to God.",
      "pdfLink": "/announcements/EVANGELISM_REPORT_IN_KENYA_JULY_2024.pdf",
      "image": "/announcements/EVANGELISM_REPORT_IN_KENYA_JULY_2024.png",
      "pages": "3",
      "type": "report"
    },
    {
      "title": "Mission Trip to Hungary - Gyor - July 2023",
      "summary": "Several years ago, the JA church of Den Haag, together with the church of Norway, travelled to Budapest (Hungary) to bring the one God gospel of Jesus Christ to this beautiful country with such a rich European history. During that trip in 2017, several souls were baptized, and many heard the message about one God and baptism in Jesus Name. For the next couple of years, there were some challenges, and the work was on a lower level for a while. We did not think we would travel again to Hungary and see the church flourish. But then the Holland church started praying again for Hungary. At some point a young lady called Alexandra, whom we had met on an earlier mission trip, contacted me through email and started asking questions about baptism. It turned out she had been touched by the message of Bishop Paul Thomas and his personal testimony about meeting the Lord. All these years she had been holding on to the one God doctrine despite being alone. Her enduring faith unfortunately led to her and her family being isolated, and they suffered some level of persecution. However, through the years she held on to her belief in Jesus by the grace of God. “Then said Jesus unto the twelve, Will ye also go away? 68 Then Simon Peter answered him, Lord, to whom shall we go? Thou hast the words of eternal life. 69 And we believe and are sure that thou art that Christ, the Son of the living God”(John 6:67-69) After communicating per email for some months, it was clear to me that Alexandra was serious about baptism in Jesus Name. “But Christ as a son over his own house; whose house are we, if we hold fast the confidence and the rejoicing of the hope firm unto the end.”(Heb 3:6) We decided to organize a trip to Hungary in July 2023, with the intention of baptizing this one soul, and making room for the preaching of the gospel. The dates were set to July 17th to 22nd.",
      "pdfLink": "/announcements/MISSION_TRIP_TO_HUNGARY_GYOR_2023.pdf",
      "image": "/announcements/MISSION_TRIP_TO_HUNGARY_GYOR_2023.png",
      "pages": "3",
      "type": "report"
    },
    {
      "title": "Victory report from Ivory Coast - June/July 2023",
      "summary": "“And when they were come, and had gathered the church together, they rehearsed all that God had done with them, and how he had opened the door of faith unto the Gentiles.” (Act 14:27) The good Lord Jesus enabled us to travel to the Ivory Coast from the 28th of June to the 7th of July, 2023. Bishop Efrem of the UK has long been encouraging me to travel to the Ivory Coast and we were excited to see what the Lord would do. As soon as Bishop Efrem exited the airport in Abidjan the capital of Ivory Coast, the Lord Jesus confirmed the trip was ordained for his glory. As you can see in Figure 1, a few young men who were total strangers, approached him and the leader of Ivory Coast, Brother Jean Baptiste, and asked for prayers upon their knees. Having lived in France for some years, Brother Efrem’s French was a much-needed asset as few people speak English in the Ivory Coast. It always amazes us how the Lord prepares his servants years in advance for his purposes. “But rise, and stand upon thy feet: for I have appeared unto thee for this purpose, to make thee a minister and a witness both of these things which thou hast seen, and of those things in the which I will appear unto thee” (Acts 26:16).",
      "pdfLink": "/announcements/REPORT_FROM_IVORY_COAST_2023.pdf",
      "image": "/announcements/REPORT_FROM_IVORY_COAST_2023.png",
      "pages": "3",
      "type": "report"
    }
  ]
}
