{
  "announcements": [
    {
      "title": "Mission Trip to Hungary - Gyor - July 2023",
      "summary": "Several years ago, the JA church of Den Haag, together with the church of Norway, travelled to Budapest (Hungary) to bring the one God gospel of Jesus Christ to this beautiful country with such a rich European history. During that trip in 2017, several souls were baptized, and many heard the message about one God and baptism in Jesus Name. For the next couple of years, there were some challenges, and the work was on a lower level for a while. We did not think we would travel again to Hungary and see the church flourish. But then the Holland church started praying again for Hungary. At some point a young lady called Alexandra, whom we had met on an earlier mission trip, contacted me through email and started asking questions about baptism. It turned out she had been touched by the message of Bishop Paul Thomas and his personal testimony about meeting the Lord. All these years she had been holding on to the one God doctrine despite being alone. Her enduring faith unfortunately led to her and her family being isolated, and they suffered some level of persecution. However, through the years she held on to her belief in Jesus by the grace of God. “Then said Jesus unto the twelve, Will ye also go away? 68 Then Simon Peter answered him, Lord, to whom shall we go? Thou hast the words of eternal life. 69 And we believe and are sure that thou art that Christ, the Son of the living God”(John 6:67-69) After communicating per email for some months, it was clear to me that Alexandra was serious about baptism in Jesus Name. “But Christ as a son over his own house; whose house are we, if we hold fast the confidence and the rejoicing of the hope firm unto the end.”(Heb 3:6) We decided to organize a trip to Hungary in July 2023, with the intention of baptizing this one soul, and making room for the preaching of the gospel. The dates were set to July 17th to 22nd.",
      "pdfLink": "/announcements/MISSION_TRIP_TO_HUNGARY_GYOR_2023.pdf",
      "image": "/announcements/MISSION_TRIP_TO_HUNGARY_GYOR_2023.png",
      "pages": "3",
      "type": "report"
    },
    {
      "title": "Victory report from Ivory Coast - June/July 2023",
      "summary": "“And when they were come, and had gathered the church together, they rehearsed all that God had done with them, and how he had opened the door of faith unto the Gentiles.” (Act 14:27) The good Lord Jesus enabled us to travel to the Ivory Coast from the 28th of June to the 7th of July, 2023. Bishop Efrem of the UK has long been encouraging me to travel to the Ivory Coast and we were excited to see what the Lord would do. As soon as Bishop Efrem exited the airport in Abidjan the capital of Ivory Coast, the Lord Jesus confirmed the trip was ordained for his glory. As you can see in Figure 1, a few young men who were total strangers, approached him and the leader of Ivory Coast, Brother Jean Baptiste, and asked for prayers upon their knees. Having lived in France for some years, Brother Efrem’s French was a much-needed asset as few people speak English in the Ivory Coast. It always amazes us how the Lord prepares his servants years in advance for his purposes. “But rise, and stand upon thy feet: for I have appeared unto thee for this purpose, to make thee a minister and a witness both of these things which thou hast seen, and of those things in the which I will appear unto thee” (Acts 26:16).",
      "pdfLink": "/announcements/REPORT_FROM_IVORY_COAST_2023.pdf",
      "image": "/announcements/REPORT_FROM_IVORY_COAST_2023.png",
      "pages": "3",
      "type": "report"
    },
    {
      "title": "Report from Nepal - April 2023",
      "summary": "“For so hath the Lord commanded us, saying, I have set thee to be a light of the Gentiles, that thou shouldest be for salvation unto the ends of the earth.” (Act 13:47) Pastor Rajesh Bishowkarma is a young Pastor (28 years old) ministering in Lalitpur Lele 22 kilometers south of the Capital, Kathmandu. For some years now, Pastor Rajesh has been reading some of the material on our website, apostolicinternational.com. The good Lord Jesus opened his understanding in regard to the doctrine of baptism in Jesus’ name. He decided to obey Acts 2:38 and baptize souls in Nepal in the name of Jesus alone. Praise the Lord! As such, we wish to first and foremost give the Lord Jesus the glory for our website which he has seen fit to use for his glory in such an unprecedented fashion! Pastor Rajesh is passionate about the true revelation contained in the Bible.",
      "pdfLink": "/announcements/REPORT_FROM_NEPAL_2023.pdf",
      "image": "/announcements/REPORT_FROM_NEPAL_2023.png",
      "pages": "3",
      "type": "report"
    },
    {
      "title": "Report from Cairo, Egypt - March 2023",
      "summary": "“In that day shall there be an altar to the LORD in the midst of the land of Egypt, and a pillar at the border thereof to the LORD. And it shall be for a sign and for a witness unto the LORD of hosts in the land of Egypt: for they shall cry unto the LORD because of the oppressors, and he shall send them a saviour, and a great one, and he shall deliver them.” (Isaiah 19:19-20).Greetings in the saving name of our Lord and Savior, Jesus Christ! The good Lord opened the door to travel and minister in Cairo, Egypt, on the 1st of March this year (2023). God used Sister Alem from Canada to highlight the dilemma faced by the saints in Cairo, Egypt. Sister Sosina and Sister Muna were praying for a long time for the Lord to send someone to baptize Pastor George in Cairo, Egypt. These sisters have sacrificed much for the sake of the Lord over the years and have been instrumental in the planting and growth of the church. I wish to encourage the sisters with the scripture below. “For God is not unrighteous to forget your work and labour of love, which ye have shewed toward his name, in that ye have ministered to the saints, and do minister.” (Hebrews 6:10)",
      "pdfLink": "/announcements/REPORT_FROM_CAIRO_EGYPT.pdf",
      "image": "/announcements/REPORT_FROM_CAIRO_EGYPT.jpeg",
      "pages": "2",
      "type": "report"
    }
  ]
}
