{
  "announcements": [
    {
      "title": "Report from Nepal - April 2023",
      "summary": "“For so hath the Lord commanded us, saying, I have set thee to be a light of the Gentiles, that thou shouldest be for salvation unto the ends of the earth.” (Act 13:47) Pastor Rajesh Bishowkarma is a young Pastor (28 years old) ministering in Lalitpur Lele 22 kilometers south of the Capital, Kathmandu. For some years now, Pastor Rajesh has been reading some of the material on our website, apostolicinternational.com. The good Lord Jesus opened his understanding in regard to the doctrine of baptism in Jesus’ name. He decided to obey Acts 2:38 and baptize souls in Nepal in the name of Jesus alone. Praise the Lord! As such, we wish to first and foremost give the Lord Jesus the glory for our website which he has seen fit to use for his glory in such an unprecedented fashion! Pastor Rajesh is passionate about the true revelation contained in the Bible.",
      "pdfLink": "/announcements/REPORT_FROM_NEPAL_2023.pdf",
      "image": "/announcements/REPORT_FROM_NEPAL_2023.png",
      "pages": "3",
      "type": "report"
    },
    {
      "title": "Report from Cairo, Egypt - March 2023",
      "summary": "“In that day shall there be an altar to the LORD in the midst of the land of Egypt, and a pillar at the border thereof to the LORD. And it shall be for a sign and for a witness unto the LORD of hosts in the land of Egypt: for they shall cry unto the LORD because of the oppressors, and he shall send them a saviour, and a great one, and he shall deliver them.” (Isaiah 19:19-20).Greetings in the saving name of our Lord and Savior, Jesus Christ! The good Lord opened the door to travel and minister in Cairo, Egypt, on the 1st of March this year (2023). God used Sister Alem from Canada to highlight the dilemma faced by the saints in Cairo, Egypt. Sister Sosina and Sister Muna were praying for a long time for the Lord to send someone to baptize Pastor George in Cairo, Egypt. These sisters have sacrificed much for the sake of the Lord over the years and have been instrumental in the planting and growth of the church. I wish to encourage the sisters with the scripture below. “For God is not unrighteous to forget your work and labour of love, which ye have shewed toward his name, in that ye have ministered to the saints, and do minister.” (Hebrews 6:10)",
      "pdfLink": "/announcements/REPORT_FROM_CAIRO_EGYPT.pdf",
      "image": "/announcements/REPORT_FROM_CAIRO_EGYPT.jpeg",
      "pages": "2",
      "type": "report"
    }
  ]
}
