{
  "sermons": [
    {
      "title": "Holding The Word And Being Upheld By The Word",
      "summary": "What should a Christian do if the entire church forsakes the work of God and you find yourself alone? This was the unenviable situation that Eleazar the son of Dodo found himself in – he was deserted by all and left to confront the Philistines by himself. That is the time to firmly grip the sword that is in your hand and trust in God.",
      "pdfLink": "/sermons/HOLDING_THE_WORD_AND_BEING_UPHELD_BY_THE_WORD.pdf",
      "image": "/sermons/HOLDING_THE_WORD_AND_BEING_UPHELD_BY_THE_WORD.png",
      "pages": "3"
    },
    {
      "title": "The Seal Of Jesus –the Holy Spirit",
      "summary": "In ancient times, kings set their seals only on that which was valuable – the king’s treasure. When King Jesus fills you with his Holy Spirit, it is proof that you are his treasure. We are redeemed not with corruptible things like silver and gold, but with the blood of God himself (Acts 20:28). Therefore, given the priceless cost of our souls, God seals his purchased possession with his own Holy Spirit. To be filled with the Holy Spirit is proof that God has chosen you and that you are royal property",
      "pdfLink": "/sermons/THE_SEAL_OF_JESUS_THE_HOLY_SPIRIT.pdf",
      "image": "/sermons/THE_SEAL_OF_JESUS_THE_HOLY_SPIRIT.png",
      "pages": "3"
    },
    {
      "title": "Jesus, The King Of Kings",
      "summary": "In Genesis 24:2-9, we read that Eleazer put his hand under the thigh of Abraham and swear to never bring a wife from among the Canaanites for Isaac. The thigh represents one’s seed and, by extension, one’s strength and future. Today, we are the Eleazers of Jesus – we must put our hands under his thigh and promise to bring children that are born again of the King of Kings, and Lord of Lords. We must bring royal seed that are worthy of the title that is on the thigh of the Lord Jesus Christ. May our blood test read, “Child of the king of kings and Lord of Lords",
      "pdfLink": "/sermons/JESUS_the_king_of_kings.pdf",
      "image": "/sermons/JESUS_the_king_of_kings.png",
      "pages": "3"
    },
    {
      "title": "Born Of God",
      "summary": "The Lord Jesus Christ gave birth to us and is our Father. Many children can have one father, but one child cannot have many fathers. Right here we see the necessity of believing in one God alone, and not a Trinity. God supernaturally revealed to Isaiah the fatherhood of Jesus Christ 700 years prior to the word being made flesh in Israel: Isaiah 9:6 For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.",
      "pdfLink": "/sermons/BORN_OF_GOD.pdf",
      "image": "/sermons/BORN_OF_GOD.png",
      "pages": "3"
    },
    {
      "title": "Praying for the eyes of the young",
      "summary": "From the beginning of time, there has been a battle for the attention of youth. God wants to open their eyes to spiritual matters, but the enemy is equally determined to overwhelm their eyes with earthly, material things. When the army of Syria came to capture Elisha in the city of Dothan, the young servant of Elisha was overwhelmed with what his eyes saw. \"Therefore sent he thither horses, and chariots, and a great host: and they came by night, and compassed the city about\" (2 Kings 6:14). Thank God for the man of God! As long as there is an Elisha to pray for the eyes of the young to be spiritually opened, there is hope.",
      "pdfLink": "/sermons/PRAYING_FOR_THE_EYES_OF_THE_YOUNG.pdf",
      "image": "/sermons/PRAYING_FOR_THE_EYES_OF_THE_YOUNG.png",
      "pages": "4"
    },
    {
      "title": "The Young Man and His Linen Garment",
      "summary": "One reason many believe the young man in this vignette(Mark 14:51-42) is Mark himself is the fact that only he included this story in his Gospel. This was his own, unique experience with the Lord, as we all have our unique experiences with the Lord Jesus. He wanted the world to know about his experience with the Lord. “And there followed him a certain young man” demonstrates this young man’s deep love for Jesus.",
      "pdfLink": "/sermons/The_Young_Man_and_His_Linen_Garment.pdf",
      "image": "/sermons/The_Young_Man_and_His_Linen_Garment.png",
      "pages": "4"
    }
  ]
}
