{
  "sermons": [
    {
      "title": "The Fruit Of Baptism",
      "summary": "This statement of Jesus was for the Greeks who wanted to see him. \"And there were certain Greeks among them that came up to worship at the feast. The same came therefore to Philip, which was of Bethsaida of Galilee, and desired him, saying, Sir, we would see Jesus\" (John 12:20, 21). Europeans generally have travelled the world – some out of curiosity and others to conquer and own. Europeans love to be tourists, see places and bring back photos of distant lands and people. But the first Europeans who came to see Jesus were given a strange, ominous message – fall into the ground die.",
      "pdfLink": "/sermons/THE_FRUIT_OF_BAPTISM.pdf",
      "image": "/sermons/THE_FRUIT_OF_BAPTISM.png",
      "pages": "3"
    },
    {
      "title": "Genesis 1:26 And The Creation",
      "summary": "\"Let us\" and \"our image\" are believed by many Christians to reveal the Trinity collaboratively active in the creation of man. Is there a plurality in Genesis 1:26? If this is the case, we should expect the following Scriptures to be consistent and make explicit that there are indeed three beings involved in the creation of man. What does the next verse say?",
      "pdfLink": "/sermons/GENESIS _1_26_AND_THE_CREATION.pdf",
      "image": "/sermons/GENESIS _1_26_AND_THE_CREATION.png",
      "pages": "12"
    },
    {
      "title": "Ministers of The Golden Lampstand",
      "summary": "The churches are branches that emerge from the body of our Lord Jesus Christ. There are six branches – the number of man – but, thankfully, Jesus perfects the church as the seventh branch in the middle (the shaft). Jesus declared, ‘I am the vine, ye are the branches: He that abideth in me, and I in him, the same bringeth forth much fruit: for without me ye can do nothing’ (John 15:5). It is this spiritual image, the menorah, which is the national symbol of Israel, and one of logos of the Apostolic church, which should serve as a powerful object lesson for all leaders and ministers in the body of Jesus Christ, the holy church. Let us begin with the first aspect of the candlestick – pure gold.",
      "pdfLink": "/sermons/MINISTERS_OF_THE_GOLDEN_LAMPSTAND.pdf",
      "image": "/sermons/MINISTERS_OF_THE_GOLDEN_LAMPSTAND.png",
      "pages": "3"
    },
    {
      "title": "The Death Of Death",
      "summary": "As we contemplate the death of our Lord Jesus Christ at this time of the year, I wish to focus on the sign of Jonah, which Jesus said pointed to his own death. So, in what way does Jonah’s story point to the Lord’s death? Let us begin with Jonah asleep in the ship. The sea raged and threatened to kill the mariners and passengers aboard if Jonah was not cast overboard. ‘Then said they unto him, What shall we do unto thee, that the sea may be calm unto us?",
      "pdfLink": "/sermons/THE_DEATH_OF_DEATH.pdf",
      "image": "/sermons/THE_DEATH_OF_DEATH.png",
      "pages": "2"
    },
    {
      "title": "The Fine Linen Of The Bride",
      "summary": "Every wedding since the beginning of the world pointed to the ultimate marriage ceremony of the Lamb. The apostle John reveals to us that the bride of Christ wears a garment made of fine line, clean and white, which represents the righteousness of the saints. I feel the best way to understand the meaning of marriage is to consider the mystery of the linen granted to the bride of Christ for that wonderful day which is coming. The best gift the Lord Jesus Christ could give to his wife, the church, is a garment made of linen to show his love for her. We need to unlock the mystery of the linen garment in order to better appreciate the meaning of marriage, including this marriage between Bro. Abel and Sis. Abineth.",
      "pdfLink": "/sermons/THE_FINE_LINEN_OF_THE_BRIDE.pdf",
      "image": "/sermons/THE_FINE_LINEN_OF_THE_BRIDE.png",
      "pages": "3"
    },
    {
      "title": "The Meaning Of Our Baptism In Jesus Name",
      "summary": "It was water that cut off Noah from the sinful world - permanently. The will of our God Jesus Christ is to cut his people off permanently from this world of sin, and he has ordained the waters of baptism in his name to accomplish this purpose. This first chapter is a call to Christians who have been baptized in Jesus name to remember the great significance of their baptism. As long as we are in this world, we will need to go back to the beginning and understand the foundations of our faith in order to continue on the path to heaven more determinedly. While baptized Christians are the intended audience, our prayer is for those who have not been baptized in Jesus name to join us in this journey to understand one of the great pillars of salvation and make an enlightened decision to be baptized in the saving name of our Lord Jesus Christ.",
      "pdfLink": "/sermons/THE_MEANING_OF_OUR_BAPTISM_IN_JESUS_NAME.pdf",
      "image": "/sermons/THE_MEANING_OF_OUR_BAPTISM_IN_JESUS_NAME.png",
      "pages": "5"
    },
    {
      "title": "The Miracle Of Marriage",
      "summary": "Marriage was first conceived in the mind of God. It was his idea! Everything else God created, he created out of nothing with his word: the stars and moon, the land and animals, to name a few. In regard to all living creatures, God made males and females separately, except for humans. This is the first unique miracle that God performed.",
      "pdfLink": "/sermons/THE_MIRACLE_OF_MARRIAGE.pdf",
      "image": "/sermons/THE_MIRACLE_OF_MARRIAGE.png",
      "pages": "3"
    },
    {
      "title": "The Origin Of The Body Of Our Lord Jesus Christ",
      "summary": "In the first part of the study, I will seek to show from the scriptures that our Lord Jesus Christ was in possession of a body that was not of human/dust origin, but heavenly, of the Holy Spirit. This was and still is unprecedented in the history of the world. Having established this, the second part will focus on the spiritual significance of this fact for our salvation. It stands to reason that since only God alone can save, the flesh and blood through which he redeemed us must be of incorruptible material.",
      "pdfLink": "/sermons/THE_ORIGIN_OF_THE_BODY_OF_OUR_LORD_JESUS_CHRIST.pdf",
      "image": "/sermons/THE_ORIGIN_OF_THE_BODY_OF_OUR_LORD_JESUS_CHRIST.png",
      "pages": "3"
    },
    {
      "title": "The Great Revival Of The Last Days",
      "summary": "The church must believe that people will rush to salvation in Jesus in the last days because God said it. Just as salmon find their way back from the vast ocean to their place of birth in a fresh stream, sinners will find they cannot resist the Spirit and love of Jesus Christ. Brothers and sisters, take courage from the prophecy of Joel! Today we strive with the lost, but one of these days, they will fly like doves back to where they belong.",
      "pdfLink": "/sermons/THE_GREAT_REVIVAL_OF_THE_LAST_DAYS.pdf",
      "image": "/sermons/THE_GREAT_REVIVAL_OF_THE_LAST_DAYS.png",
      "pages": "3"
    },
    {
      "title": "Holding The Word And Being Upheld By The Word",
      "summary": "What should a Christian do if the entire church forsakes the work of God and you find yourself alone? This was the unenviable situation that Eleazar the son of Dodo found himself in – he was deserted by all and left to confront the Philistines by himself. That is the time to firmly grip the sword that is in your hand and trust in God.",
      "pdfLink": "/sermons/HOLDING_THE_WORD_AND_BEING_UPHELD_BY_THE_WORD.pdf",
      "image": "/sermons/HOLDING_THE_WORD_AND_BEING_UPHELD_BY_THE_WORD.png",
      "pages": "3"
    },
    {
      "title": "The Seal Of Jesus –the Holy Spirit",
      "summary": "In ancient times, kings set their seals only on that which was valuable – the king’s treasure. When King Jesus fills you with his Holy Spirit, it is proof that you are his treasure. We are redeemed not with corruptible things like silver and gold, but with the blood of God himself (Acts 20:28). Therefore, given the priceless cost of our souls, God seals his purchased possession with his own Holy Spirit. To be filled with the Holy Spirit is proof that God has chosen you and that you are royal property",
      "pdfLink": "/sermons/THE_SEAL_OF_JESUS_THE_HOLY_SPIRIT.pdf",
      "image": "/sermons/THE_SEAL_OF_JESUS_THE_HOLY_SPIRIT.png",
      "pages": "3"
    },
    {
      "title": "Jesus, The King Of Kings",
      "summary": "In Genesis 24:2-9, we read that Eleazer put his hand under the thigh of Abraham and swear to never bring a wife from among the Canaanites for Isaac. The thigh represents one’s seed and, by extension, one’s strength and future. Today, we are the Eleazers of Jesus – we must put our hands under his thigh and promise to bring children that are born again of the King of Kings, and Lord of Lords. We must bring royal seed that are worthy of the title that is on the thigh of the Lord Jesus Christ. May our blood test read, “Child of the king of kings and Lord of Lords",
      "pdfLink": "/sermons/JESUS_the_king_of_kings.pdf",
      "image": "/sermons/JESUS_the_king_of_kings.png",
      "pages": "3"
    },
    {
      "title": "Born Of God",
      "summary": "The Lord Jesus Christ gave birth to us and is our Father. Many children can have one father, but one child cannot have many fathers. Right here we see the necessity of believing in one God alone, and not a Trinity. God supernaturally revealed to Isaiah the fatherhood of Jesus Christ 700 years prior to the word being made flesh in Israel: Isaiah 9:6 For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.",
      "pdfLink": "/sermons/BORN_OF_GOD.pdf",
      "image": "/sermons/BORN_OF_GOD.png",
      "pages": "3"
    },
    {
      "title": "Praying for the eyes of the young",
      "summary": "From the beginning of time, there has been a battle for the attention of youth. God wants to open their eyes to spiritual matters, but the enemy is equally determined to overwhelm their eyes with earthly, material things. When the army of Syria came to capture Elisha in the city of Dothan, the young servant of Elisha was overwhelmed with what his eyes saw. \"Therefore sent he thither horses, and chariots, and a great host: and they came by night, and compassed the city about\" (2 Kings 6:14). Thank God for the man of God! As long as there is an Elisha to pray for the eyes of the young to be spiritually opened, there is hope.",
      "pdfLink": "/sermons/PRAYING_FOR_THE_EYES_OF_THE_YOUNG.pdf",
      "image": "/sermons/PRAYING_FOR_THE_EYES_OF_THE_YOUNG.png",
      "pages": "4"
    },
    {
      "title": "The Young Man and His Linen Garment",
      "summary": "One reason many believe the young man in this vignette(Mark 14:51-42) is Mark himself is the fact that only he included this story in his Gospel. This was his own, unique experience with the Lord, as we all have our unique experiences with the Lord Jesus. He wanted the world to know about his experience with the Lord. “And there followed him a certain young man” demonstrates this young man’s deep love for Jesus.",
      "pdfLink": "/sermons/The_Young_Man_and_His_Linen_Garment.pdf",
      "image": "/sermons/The_Young_Man_and_His_Linen_Garment.png",
      "pages": "4"
    }
  ]
}
