{
  "sermons": [
    {
      "title": "Returning to the Physical Church After Covid-19",
      "summary": "[Hebrews 10:25 Not forsaking the assembling of ourselves together, as the manner of some is; but exhorting one another: and so much the more, as ye see the day approaching]. The children of Israel never got the opportunity to assemble themselves together in the name of the God of Abraham, Isaac and Jacob in Egypt for 400 years. Imagine being in a lockdown for 400 years and the name of the virus is Pharaoh! Thank God we have digital communication applications such as Zoom which gave us a semblance of church – at least we heard the word of God, prayed and worshipped. Sadly, there was no preaching, exhortation, singing and worship to God for 400 years in Egypt. Pharaoh made sure they never got time to assemble in the name of Jehovah. On the contrary, Pharaoh managed the lives of the Hebrews slaves in such a way that they their energy and waking hours were consumed in building idols and monuments for Pharaoh, such as the city of Ramses (Exodus 1:11). Apostolics must understand the enemy will do everything in his power to stop us from assembling together in the name of Jesus.",
      "pdfLink": "/sermons/RETURNING_TO_THE_PHYSICAL_CHURCH_AFTER_COVID-19.pdf",
      "image": "/sermons/RETURNING_TO_THE_PHYSICAL_CHURCH_AFTER_COVID-19.png",
      "pages": "4"
    },
    {
      "title": "The Covenant of Tithing",
      "subTitle": "The seal of God’s perfect authority over our lives",
      "summary": "[Malachi 3:10 Bring ye all the tithes into the storehouse, that there may be meat in mine house, and prove me now herewith, saith the LORD of hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall not be room enough to receive it.]  The only time God invites his people to test, examine or prove him (bāḥan) is in the scripture above which relates to tithing. Tithing is a covenant between God and the Christian who is born again, according to the command in Acts 2:38. The covenant of tithing was only for the children of Abraham, not the unsaved. “And if ye be Christ's, then are ye Abraham's seed, and heirs according to the promise” (Galatians 3:29). Tithing is a test: God tests the Christian’s ability to trust him with his or her material wealth. The foundation of tithing is the belief that God is the creator of everything, hence the owner of all things.",
      "pdfLink": "/sermons/THE_COVENANT_OF_TITHING.pdf",
      "image": "/sermons/THE_COVENANT_OF_TITHING.png",
      "pages": "5"
    },
    {
      "title": "The Appearing of the Lord Jesus Christ",
      "summary": "When God appeared to Adam and Eve in the Garden of Eden when they sinned, his appearance was a source of terror to them – they hid themselves. “And he said, I heard thy voice in the garden, and I was afraid, because I was naked; and I hid myself” (Genesis 3:10). The Lord Jesus Christ is going to appear soon; do you hear his voice? I hear the voice of Jesus everywhere these days – in the wars and rumors of wars (Matt 24:6); in the pestilences (Matt 24:7 e.g. Covid-19); in the buying and selling (Luke 17:28); in knowledge being increased (Dan 12:4); in the selfishness of people (2Tim 3:2); in the ungodliness and lack of fear of God (2Tim 3:4,5) and in the world’s prejudice against the nation of Israel (Zech 12:3), to name a few. I trust all of you here today love the Lord and have determined to prepare yourselves for his coming. Jesus’ return will not be a source of terror for us, but the fulfillment of a lifetime of loving him and preparing for this very event. Hallelujah!",
      "pdfLink": "/sermons/THE_APPEARING_OF_THE_LORD_JESUS_CHRIST.pdf",
      "image": "/sermons/THE_APPEARING_OF_THE_LORD_JESUS_CHRIST.png",
      "pages": "4"
    },
    {
      "title": "See the Individual, Not a Tribe!",
      "summary": "Tribalism is an aggressive, adversarial stance towards those who belong to a tribe or ethnic group other than one’s own. Thoughts, attitudes and actions are evaluated through the overriding interpretive lens of tribalism. Tribalism can never lead to peace because it thrives and is sustained by mistrust of the intentions of other tribes, whether real or imagined. Satan understands the capacity of tribalism to engender evil throughout the generations so he stokes the flames of tribalism ever so often. For tribalists, the sins of other tribes against them is “sacred”. This is recorded in the collective memory and repeated dutifully to the next generation. Tribalism is a sin in the sight of God because it rebels against the command to love your neighbor as yourself; it refuses to see others as individuals made in the image of God – rather, it prefers to see entire communities as suspicious groups worthy of contempt.",
      "pdfLink": "/sermons/SEE_THE_INDIVIDUAL_NOT_A_TRIBE.pdf",
      "image": "/sermons/SEE_THE_INDIVIDUAL_NOT_A_TRIBE.png",
      "pages": "5"
    },
    {
      "title": "PPTX for Beware the Curiosity of the King of Babylon",
      "summary": "Here is the power point presentation that was used for the sermon - Beware the Curiosity of the King of Babylon.",
      "pdfLink": "/sermons/BEWARE_THE_CURIOSITY_OF_THE_KING_OF_BABYLON_pptx.pdf",
      "image": "/sermons/BEWARE_THE_CURIOSITY_OF_THE_KING_OF_BABYLON.png",
      "pages": "13"
    },
    {
      "title": "Beware the Curiosity of the King of Babylon",
      "subTitle": "The Internet and the Christian",
      "summary": "The King of Babylon sent ambassadors to Jerusalem with the secret mission of assessing the strength and secrets of the Kingdom of Judah. We must understand the King of Babylon as a metaphor for a world in the service of Satan. It is significant that Babylon is prominent in the first and the last book of the Bible. The first time was when the children of Noah decided to congregate and build a tower that reached into heaven. God scattered them, confused the languages, and the place was called Babel, which means confusion",
      "pdfLink": "/sermons/BEWARE_THE_CURIOSITY_OF_THE_KING_OF_BABYLON.pdf",
      "image": "/sermons/BEWARE_THE_CURIOSITY_OF_THE_KING_OF_BABYLON.png",
      "pages": "4"
    },
    {
      "title": "Music, the King of Babylon and Worship",
      "summary": "The King of Babylon, Nebuchadnezzar, clearly understood music to be a vital accompaniment to worship. The Cambridge Dictionary defines music as, ‘A pattern of sounds made by musical instruments, voices, or computers, or a combination of these, intended to give pleasure to people listening to it.’ I believe that God made all things for his pleasure. The same Dictionary defines pleasure as, ‘Enjoyment, happiness, or satisfaction, or something that gives this.’ The sounds of nature – the wind, rivers, birds, animals and man – were intended to produce sounds for God’s pleasure. This is why Satan is so desirous of controlling and monitoring the gift of music.",
      "pdfLink": "/sermons/MUSIC_THE_KING_OF_BABYLON_AND_WORSHIP.pdf",
      "image": "/sermons/MUSIC_THE_KING_OF_BABYLON_AND_WORSHIP.png",
      "pages": "13"
    },
    {
      "title": "Parenting Girls For Christ",
      "summary": "Parenting Girls For Christ. Here is the power point presentation that was used for the Bible study that aimed to give biblical guide on how to bring up girls for Chirst.",
      "pdfLink": "/sermons/PARENTING_GIRLS_FOR_CHRIST.pdf",
      "image": "/sermons/PARENTING_GIRLS_FOR_CHRIST.png",
      "pages": "11"
    },
    {
      "title": "Jesus Loves the Single Parent Also",
      "summary": "Jesus Loves the Single Parent Also. Here is the power point presentation that was used for the Bible study that aimed to give biblical advice for single parents. Examples like Hagar, Hanna and Mary were studied.",
      "pdfLink": "/sermons/JESUS_LOVES_THE_SINGLE_PARENT_ALSO.pdf",
      "image": "/sermons/JESUS_LOVES_THE_SINGLE_PARENT_ALSO.png",
      "pages": "10"
    },
    {
      "title": "Making It To The Seventh Day",
      "summary": "[Genesis 2:2 And on the seventh day God ended his work which he had made; and he rested on the seventh day from all his work which he had made. 3And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made.] There is something special about the seventh day. God made man on the sixth day, but this was not the day he rested and blessed – that honor was reserved for the seventh day alone. In this sermon, with the help of the Lord, I will attempt to show you that the creation week portrays the struggle of our lives.",
      "pdfLink": "/sermons/MAKING_IT_TO_THE_SEVENTH_DAY.pdf",
      "image": "/sermons/MAKING_IT_TO_THE_SEVENTH_DAY.png",
      "pages": "4"
    },
    {
      "title": "Salvation From Beyond The Grave",
      "summary": "[Hosea 6:1-2 Come, and let us return unto the LORD: for he hath torn, and he will heal us; he hath smitten, and he will bind us up. 2 After two days will he revive us: in the third day he will raise us up, and we shall live in his sight.] Today we commemorate the resurrection of the Lord Jesus Christ this Easter Sunday. People could not understand how the crucified Lord, who seemed so helpless and defeated, could save them. However, this is precisely what happened: salvation came from beyond the grave. Indeed, this has been a recurring pattern in the Bible from the beginning. What seemed utterly feeble and hopeless, turned out to be the power of God in disguise.",
      "pdfLink": "/sermons/SALVATION_FROM_BEYOND_THE_GRAVE.pdf",
      "image": "/sermons/SALVATION_FROM_BEYOND_THE_GRAVE.png",
      "pages": "4"
    },
    {
      "title": "Jesus: The Scapegoat For Our Sins",
      "summary": "[Leviticus 16:8 And Aaron shall cast lots upon the two goats; one lot for the LORD, and the other lot for the scapegoat.] There were two goats of enormous significance for Israel during the Day of Atonement, Yom Kippur. The commandments concerning these goats pointed to the events surrounding the trial, judgement and death of our Lord Jesus during Passover. Hence, it is fitting that we study this prayerfully to commemorate the Lord’s sacrifice for us all. Now, the two goats had two purposes: the one was to be sacrificed for the Lord and the other was the scapegoat.",
      "pdfLink": "/sermons/JESUS_THE_SCAPEGOAT_FOR_OUR_SINS.pdf",
      "image": "/sermons/JESUS_THE_SCAPEGOAT_FOR_OUR_SINS.png",
      "pages": "4"
    },
    {
      "title": "Joshua – The Man Who Stopped Time To Finish God’s Work",
      "summary": "Joshua, the son of Nun, is a unique character in the Bible. From his youth he distinguished himself as a boy who loved God deeply and followed Moses, the servant of God, wholeheartedly. I pray today that the life of young Joshua will inspire my listeners, the young in particular, to dedicate themselves to a life of service and bold faith for the glory of the Lord Jesus Christ! Now, where did Joshua learn to appreciate and value the importance of time? We will need to go back to his youth in Egypt and join the timeless story of the Exodus, beginning with the most fearful night in the history of Israel.",
      "pdfLink": "/sermons/JOSHUA_THE_MAN_WHO_STOPPED_TIME_TO_FINISH_GOD_S_WORK.pdf",
      "image": "/sermons/JOSHUA_THE_MAN_WHO_STOPPED_TIME_TO_FINISH_GOD_S_WORK.png",
      "pages": "4"
    },
    {
      "title": "Women’s Long Hair - The Glory Of The Church",
      "summary": "1 Corinthians 11:15 “But if a woman have long hair, it is a glory to her: for her hair is given her for a covering”. In biblical language and imagery, a woman represents the church of the Lord Jesus Christ. Note carefully that the apostle Paul qualifies his statement with “if a woman have long hair…” Paul is aware that not all women will receive this invitation to holiness, especially in our modern world where self-will and rebellion are falsely labelled freedom and self-expression. Paul states, quite remarkably, that a woman who voluntarily chooses to grow her hair long will find that it is a “glory to her: for her hair is given her for a covering”. We must unpack this tantalizing statement full of promise. Let us first begin with the “glory to her”.  ",
      "pdfLink": "/sermons/WOMENS_LONG_HAIR_-_THE_GLORY_OF_THE_CHURCH.pdf",
      "image": "/sermons/WOMENS_LONG_HAIR_-_THE_GLORY_OF_THE_CHURCH.png",
      "pages": "4"
    },
    {
      "title": "In Judah (praise) Is God Known",
      "summary": "Psalm 76:1 [[To the chief Musician on Neginoth, A Psalm or Song of Asaph.]] In Judah is God known: his name is great in Israel. Praising God makes the unknown person known. Jacob loved Rachel, not Leah. When Leah bore children, she named them after her affliction and bitterness. She was the unknown and unwanted woman and wife(Gen 29:31-34). Notice that all her children served to remind and console her. It was about her, not the children. With each birth, she was still left in bitterness and anguish. However, interestingly, we seem to detect a final sense of peace and contentment in her life when she finally stopped focusing on her own pain, and began to look up to heaven and praise the almighty God. “And she conceived again, and bare a son: and she said, Now will I praise the LORD: therefore she called his name Judah; and left bearing” (Gen 29:35). There is something about praising God which will release us from our pain, anguish and frustration in this life.",
      "pdfLink": "/sermons/IN_JUDAH_IS_GOD_KNOWN.pdf",
      "image": "/sermons/IN_JUDAH_IS_GOD_KNOWN.png",
      "pages": "4"
    },
    {
      "title": "The Church at the Well",
      "summary": "God, who made the heavens and the earth, asked a woman “Give me to drink!” Can you imagine God who made the earth with over 70% of water asks a Samaritan woman for water from a well? What God is actually asking us is, “is the water you have satisfying your thirst?” By the time the conversation was over, the woman asked Jesus, “Sir, give me this water” (John 4:15). Thank God for thirst! God always finds his church by the water/well because he knows she will be thirsty and must come to the water to survive. May Jesus find his bride by the well – always thirsty! Thirst brought this woman to the well, and the identity of the Lord Jesus Christ was revealed to her. Only thirst will reveal the identity of Jesus to us. The journey to heaven begins with and is sustained by spiritual thirst. Are you still thirsty for Jesus Brothers and Sisters?",
      "pdfLink": "/sermons/THE_CHURCH_AT_THE_WELL.pdf",
      "image": "/sermons/THE_CHURCH_AT_THE_WELL.png",
      "pages": "4"
    },
    {
      "title": "The Ear Nailed To The Doorpost",
      "summary": "God commanded masters to grant freedom to their slaves or bondservants after six years. However, if a slave loved his or her master and refused freedom, God prescribed a significant ceremony which evoked memories of a powerful event going back to that fateful night when the Hebrews first tasted freedom after four hundred years of slavery in Egypt. “And they shall take of the blood, and strike it on the two side posts and on the upper door post of the houses, wherein they shall eat it” (Exodus 12:7).",
      "pdfLink": "/sermons/THE_EAR_NAILED_TO_THE_DOORPOST.pdf",
      "image": "/sermons/THE_EAR_NAILED_TO_THE_DOORPOST.png",
      "pages": "3"
    },
    {
      "title": "Truth Alone Unites And Keeps The Church Together",
      "summary": "Last week we considered the importance of holiness, and how God forgave the idolatry of Aaron, and made him a holy high priest. This week we will consider the role that truth plays in the unity of the church. The church can only have true unity in the true revelation of the Lord Jesus Christ – if this truth is changed or abandoned, the church will be dissolved. So the church must grow in the revelation of Jesus Christ and cleave tenaciously to it in order to enjoy a God-ordained unity. A good place to begin is the cause of the division of Israel into two nations.",
      "pdfLink": "/sermons/TRUTH_ALONE_UNITES_AND_KEEPS_THE_CHURCH_TOGETHER.pdf",
      "image": "/sermons/TRUTH_ALONE_UNITES_AND_KEEPS_THE_CHURCH_TOGETHER.png",
      "pages": "4"
    },
    {
      "title": "The Raven And The Dove",
      "summary": "How can we attract the Holy Spirit? Firstly, our salvation must be built carefully and correctly according to the word of God. During the forty days and nights of the Flood of Noah, the only structure left floating on the surface of the entire water-covered earth, was the ark built according to the dimensions of the word of God.",
      "pdfLink": "/sermons/THE_RAVEN_AND_THE_DOVE.pdf",
      "image": "/sermons/THE_RAVEN_AND_THE_DOVE.png",
      "pages": "4"
    },
    {
      "title": "Be Ye Holy; For I Am Holy",
      "summary": "Holiness is to be or stay in the Lord Jesus Christ constantly. While it begins with separation, the final destination is God himself. The main problem the nation of Israel faced was not to leave Egypt, that was something God alone could accomplish, but for Israel to stay in the Land of Canaan. The act of spiritual rebirth occurs relatively quickly. “Who hath heard such a thing? who hath seen such things? Shall the earth be made to bring forth in one day? or shall a nation be born at once? for as soon as Zion travailed, she brought forth her children” (Isaiah 66:8). However, the challenge is to grow and live in God – dwelling and lingering permanently in God’s presence is the only way to become holy, and this takes a lifetime. How long did it take for Moses’ face to shine brilliantly? Forty days and nights alone with God on Mount Sinai!",
      "pdfLink": "/sermons/BE_YE_HOLY.pdf",
      "image": "/sermons/BE_YE_HOLY.png",
      "pages": "3"
    },
    {
      "title": "Dividing The Jordan (2021) With A Double Portion Of The Spirit",
      "summary": "The River Jordan will be divided tonight. The River Jordan represents this night of 31st December 2021 – the division between 2020 and 2021; on the one side is the waters of 2020 and on the other, the waters of 2021. We are right now walking in the midst of the River Jordan. The fire of God in Elijah has divided the River Jordan in 2020 in one direction. It was not Elisha, but Elijah, who divided the River Jordan by the power of the fire of God in him. But, let us say that 2021 is the way back. You and I will become Elisha. We will receive a double portion of the Spirit of Jesus and divide the River Jordan ourselves with this new anointing for 2021.",
      "pdfLink": "/sermons/DIVIDING_THE_JORDAN.pdf",
      "image": "/sermons/DIVIDING_THE_JORDAN.png",
      "pages": "3"
    },
    {
      "title": "Yehovah Tsidqenuw",
      "summary": "Imagine not only borrowing, but forever owning, the righteousness of God almighty himself! This is precisely what God offers us in baptism in Jesus name – a permanent donning of his body, his righteousness. It is common to the human condition to seek to model and mimic someone else’s behavior; those we consider to be worthy of emulation. Sadly, we try to imitate the speech, acts and even dress of so-called “trendsetters” or the contemporary “influencers”. This is perhaps why some wish to rebel against the universalization of culture today and desperately seek to be “original” or “authentic”. In so doing, humans can only reclaim their sinful and depraved identity in our first parents, Adam and Eve",
      "pdfLink": "/sermons/YEHOVAH_TSIDQENUW.pdf",
      "image": "/sermons/YEHOVAH_TSIDQENUW.png",
      "pages": "3"
    },
    {
      "title": "Power Of The Name Of Jesus In Baptism",
      "summary": "Six times God mentions his great name in the Book of Malachi which precedes the Gospel of Matthew. God was preparing Israel and the world for the revelation of his great name. He clearly prophesied that his name would be great among the gentiles and the heathen. From the time of Adam, to the time of Caiaphas, the blood of nameless animals was shed for sins. I say nameless animals because without a name there is no power to deliver from sin. Each animal that was slain pointed to the coming Lord who would be slain for the sins of the world. But what is his name? What name was revealed to the whole world for salvation?",
      "pdfLink": "/sermons/POWER_OF_THE_NAME_OF_JESUS_IN_BAPTISM.pdf",
      "image": "/sermons/POWER_OF_THE_NAME_OF_JESUS_IN_BAPTISM.png",
      "pages": "4"
    },
    {
      "title": "The Fruit Of Baptism",
      "summary": "This statement of Jesus was for the Greeks who wanted to see him. \"And there were certain Greeks among them that came up to worship at the feast. The same came therefore to Philip, which was of Bethsaida of Galilee, and desired him, saying, Sir, we would see Jesus\" (John 12:20, 21). Europeans generally have travelled the world – some out of curiosity and others to conquer and own. Europeans love to be tourists, see places and bring back photos of distant lands and people. But the first Europeans who came to see Jesus were given a strange, ominous message – fall into the ground die.",
      "pdfLink": "/sermons/THE_FRUIT_OF_BAPTISM.pdf",
      "image": "/sermons/THE_FRUIT_OF_BAPTISM.png",
      "pages": "3"
    },
    {
      "title": "Genesis 1:26 And The Creation",
      "summary": "\"Let us\" and \"our image\" are believed by many Christians to reveal the Trinity collaboratively active in the creation of man. Is there a plurality in Genesis 1:26? If this is the case, we should expect the following Scriptures to be consistent and make explicit that there are indeed three beings involved in the creation of man. What does the next verse say?",
      "pdfLink": "/sermons/GENESIS _1_26_AND_THE_CREATION.pdf",
      "image": "/sermons/GENESIS _1_26_AND_THE_CREATION.png",
      "pages": "12"
    },
    {
      "title": "Ministers Of The Golden Lampstand",
      "summary": "The churches are branches that emerge from the body of our Lord Jesus Christ. There are six branches – the number of man – but, thankfully, Jesus perfects the church as the seventh branch in the middle (the shaft). Jesus declared, ‘I am the vine, ye are the branches: He that abideth in me, and I in him, the same bringeth forth much fruit: for without me ye can do nothing’ (John 15:5). It is this spiritual image, the menorah, which is the national symbol of Israel, and one of logos of the Apostolic church, which should serve as a powerful object lesson for all leaders and ministers in the body of Jesus Christ, the holy church. Let us begin with the first aspect of the candlestick – pure gold.",
      "pdfLink": "/sermons/MINISTERS_OF_THE_GOLDEN_LAMPSTAND.pdf",
      "image": "/sermons/MINISTERS_OF_THE_GOLDEN_LAMPSTAND.png",
      "pages": "3"
    },
    {
      "title": "The Death Of Death",
      "summary": "As we contemplate the death of our Lord Jesus Christ at this time of the year, I wish to focus on the sign of Jonah, which Jesus said pointed to his own death. So, in what way does Jonah’s story point to the Lord’s death? Let us begin with Jonah asleep in the ship. The sea raged and threatened to kill the mariners and passengers aboard if Jonah was not cast overboard. ‘Then said they unto him, What shall we do unto thee, that the sea may be calm unto us?",
      "pdfLink": "/sermons/THE_DEATH_OF_DEATH.pdf",
      "image": "/sermons/THE_DEATH_OF_DEATH.png",
      "pages": "2"
    },
    {
      "title": "The Fine Linen Of The Bride",
      "summary": "Every wedding since the beginning of the world pointed to the ultimate marriage ceremony of the Lamb. The apostle John reveals to us that the bride of Christ wears a garment made of fine line, clean and white, which represents the righteousness of the saints. I feel the best way to understand the meaning of marriage is to consider the mystery of the linen granted to the bride of Christ for that wonderful day which is coming. The best gift the Lord Jesus Christ could give to his wife, the church, is a garment made of linen to show his love for her. We need to unlock the mystery of the linen garment in order to better appreciate the meaning of marriage, including this marriage between Bro. Abel and Sis. Abineth.",
      "pdfLink": "/sermons/THE_FINE_LINEN_OF_THE_BRIDE.pdf",
      "image": "/sermons/THE_FINE_LINEN_OF_THE_BRIDE.png",
      "pages": "3"
    },
    {
      "title": "The Meaning Of Our Baptism In Jesus Name",
      "summary": "It was water that cut off Noah from the sinful world - permanently. The will of our God Jesus Christ is to cut his people off permanently from this world of sin, and he has ordained the waters of baptism in his name to accomplish this purpose. This first chapter is a call to Christians who have been baptized in Jesus name to remember the great significance of their baptism. As long as we are in this world, we will need to go back to the beginning and understand the foundations of our faith in order to continue on the path to heaven more determinedly. While baptized Christians are the intended audience, our prayer is for those who have not been baptized in Jesus name to join us in this journey to understand one of the great pillars of salvation and make an enlightened decision to be baptized in the saving name of our Lord Jesus Christ.",
      "pdfLink": "/sermons/THE_MEANING_OF_OUR_BAPTISM_IN_JESUS_NAME.pdf",
      "image": "/sermons/THE_MEANING_OF_OUR_BAPTISM_IN_JESUS_NAME.png",
      "pages": "5"
    },
    {
      "title": "The Miracle Of Marriage",
      "summary": "Marriage was first conceived in the mind of God. It was his idea! Everything else God created, he created out of nothing with his word: the stars and moon, the land and animals, to name a few. In regard to all living creatures, God made males and females separately, except for humans. This is the first unique miracle that God performed.",
      "pdfLink": "/sermons/THE_MIRACLE_OF_MARRIAGE.pdf",
      "image": "/sermons/THE_MIRACLE_OF_MARRIAGE.png",
      "pages": "3"
    },
    {
      "title": "The Origin Of The Body Of Our Lord Jesus Christ",
      "summary": "In the first part of the study, I will seek to show from the scriptures that our Lord Jesus Christ was in possession of a body that was not of human/dust origin, but heavenly, of the Holy Spirit. This was and still is unprecedented in the history of the world. Having established this, the second part will focus on the spiritual significance of this fact for our salvation. It stands to reason that since only God alone can save, the flesh and blood through which he redeemed us must be of incorruptible material.",
      "pdfLink": "/sermons/THE_ORIGIN_OF_THE_BODY_OF_OUR_LORD_JESUS_CHRIST.pdf",
      "image": "/sermons/THE_ORIGIN_OF_THE_BODY_OF_OUR_LORD_JESUS_CHRIST.png",
      "pages": "3"
    },
    {
      "title": "The Great Revival Of The Last Days",
      "summary": "The church must believe that people will rush to salvation in Jesus in the last days because God said it. Just as salmon find their way back from the vast ocean to their place of birth in a fresh stream, sinners will find they cannot resist the Spirit and love of Jesus Christ. Brothers and sisters, take courage from the prophecy of Joel! Today we strive with the lost, but one of these days, they will fly like doves back to where they belong.",
      "pdfLink": "/sermons/THE_GREAT_REVIVAL_OF_THE_LAST_DAYS.pdf",
      "image": "/sermons/THE_GREAT_REVIVAL_OF_THE_LAST_DAYS.png",
      "pages": "3"
    },
    {
      "title": "Holding The Word And Being Upheld By The Word",
      "summary": "What should a Christian do if the entire church forsakes the work of God and you find yourself alone? This was the unenviable situation that Eleazar the son of Dodo found himself in – he was deserted by all and left to confront the Philistines by himself. That is the time to firmly grip the sword that is in your hand and trust in God.",
      "pdfLink": "/sermons/HOLDING_THE_WORD_AND_BEING_UPHELD_BY_THE_WORD.pdf",
      "image": "/sermons/HOLDING_THE_WORD_AND_BEING_UPHELD_BY_THE_WORD.png",
      "pages": "3"
    },
    {
      "title": "The Seal Of Jesus –the Holy Spirit",
      "summary": "In ancient times, kings set their seals only on that which was valuable – the king’s treasure. When King Jesus fills you with his Holy Spirit, it is proof that you are his treasure. We are redeemed not with corruptible things like silver and gold, but with the blood of God himself (Acts 20:28). Therefore, given the priceless cost of our souls, God seals his purchased possession with his own Holy Spirit. To be filled with the Holy Spirit is proof that God has chosen you and that you are royal property",
      "pdfLink": "/sermons/THE_SEAL_OF_JESUS_THE_HOLY_SPIRIT.pdf",
      "image": "/sermons/THE_SEAL_OF_JESUS_THE_HOLY_SPIRIT.png",
      "pages": "3"
    },
    {
      "title": "Jesus, The King Of Kings",
      "summary": "In Genesis 24:2-9, we read that Eleazer put his hand under the thigh of Abraham and swear to never bring a wife from among the Canaanites for Isaac. The thigh represents one’s seed and, by extension, one’s strength and future. Today, we are the Eleazers of Jesus – we must put our hands under his thigh and promise to bring children that are born again of the King of Kings, and Lord of Lords. We must bring royal seed that are worthy of the title that is on the thigh of the Lord Jesus Christ. May our blood test read, “Child of the king of kings and Lord of Lords",
      "pdfLink": "/sermons/JESUS_the_king_of_kings.pdf",
      "image": "/sermons/JESUS_the_king_of_kings.png",
      "pages": "3"
    },
    {
      "title": "Born Of God",
      "summary": "The Lord Jesus Christ gave birth to us and is our Father. Many children can have one father, but one child cannot have many fathers. Right here we see the necessity of believing in one God alone, and not a Trinity. God supernaturally revealed to Isaiah the fatherhood of Jesus Christ 700 years prior to the word being made flesh in Israel: Isaiah 9:6 For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.",
      "pdfLink": "/sermons/BORN_OF_GOD.pdf",
      "image": "/sermons/BORN_OF_GOD.png",
      "pages": "3"
    },
    {
      "title": "Praying for the eyes of the young",
      "summary": "From the beginning of time, there has been a battle for the attention of youth. God wants to open their eyes to spiritual matters, but the enemy is equally determined to overwhelm their eyes with earthly, material things. When the army of Syria came to capture Elisha in the city of Dothan, the young servant of Elisha was overwhelmed with what his eyes saw. \"Therefore sent he thither horses, and chariots, and a great host: and they came by night, and compassed the city about\" (2 Kings 6:14). Thank God for the man of God! As long as there is an Elisha to pray for the eyes of the young to be spiritually opened, there is hope.",
      "pdfLink": "/sermons/PRAYING_FOR_THE_EYES_OF_THE_YOUNG.pdf",
      "image": "/sermons/PRAYING_FOR_THE_EYES_OF_THE_YOUNG.png",
      "pages": "4"
    },
    {
      "title": "The Young Man and His Linen Garment",
      "summary": "One reason many believe the young man in this vignette(Mark 14:51-42) is Mark himself is the fact that only he included this story in his Gospel. This was his own, unique experience with the Lord, as we all have our unique experiences with the Lord Jesus. He wanted the world to know about his experience with the Lord. “And there followed him a certain young man” demonstrates this young man’s deep love for Jesus.",
      "pdfLink": "/sermons/The_Young_Man_and_His_Linen_Garment.pdf",
      "image": "/sermons/The_Young_Man_and_His_Linen_Garment.png",
      "pages": "4"
    }
  ]
}
