{
  "sermons": [
    {
      "title": "Jesus: the Voice of Truth",
      "summary": "The passage emphasizes Jesus' mission to bear witness to the truth, as He stated during His interrogation by Pilate, who was more concerned with Jesus' kingship. Jesus' focus on truth contrasts with Pilate's political concerns. The truth, defined as that which is factual and real, is embodied by God, who is alone and the creator of all. Humanity's sin and its consequences are also truths that are evident in our lives, as stated in Romans 5:12.\n\nDespite the grim reality of sin, the Bible provides hope by declaring that God would manifest in flesh to take away our sins, as prophesied in Micah 5:2 and confirmed by the angel Gabriel in Matthew 1:21. Jesus, embodying the fullness of God (Colossians 2:9), took on a body to destroy sin, reconciling us to God through His death (Colossians 1:21-22). Belief in this truth, as presented in the Bible, is essential for salvation.\n\nThe passage warns against spiritual blindness, likening it to Cotard's syndrome, where individuals deny their own existence. To accept the truth, one must repent and be baptized in Jesus' name for the remission of sins, receiving the Holy Ghost as stated in Acts 2:38. This truth promises a new sinless body, a renewed spirit, and a heavenly home.\n\nJesus' mission was to testify to this truth, which surpasses all earthly concerns, including kingship. Embracing this truth grants freedom, as stated in John 8:32. The message encourages honoring and loving the truth, which Jesus prioritized over political matters, and assures that embracing this truth brings spiritual freedom and renewal.",
      "pdfLink": "/sermons/JESUS_THE_VOICE_OF_TRUTH.pdf",
      "image": "/sermons/JESUS_THE_VOICE_OF_TRUTH.png",
      "imgRef": "https://unsplash.com/photos/3-wooden-cross-on-top-of-the-mountain-foLbQozs5-4",
      "pages": "3"
    },
    {
      "title": "Shining with the Glory of God",
      "summary": "The passage highlights the transformative power of God's presence as exemplified by Moses, whose face shone after communing with God, contrasting with modern notions of beauty tied to cosmetics. Moses' radiant face symbolizes spiritual beauty achieved through deep, undistracted fellowship with God. His glowing skin is attributed to his direct conversations with God, illustrating that true spiritual glow comes from a relationship with the divine, unlike King Nebuchadnezzar, whose fall into madness reflected his distance from God.\n\nThe narrative stresses that God's word is potent and transformative, as seen in Moses' renewal. The distractions of contemporary life, particularly digital addictions, hinder Christians from experiencing this transformation. The call is to reclaim time for Jesus, promising that focused time in God's presence leads to spiritual radiance and fulfillment.\n\nThis concept extends to the \"beauty of holiness,\" where God's beauty shines through those who worship and spend time with Him. Modern beauty industries pale in comparison to the glory that comes from a godly life. The passage criticizes the overemphasis on physical beauty and encourages seeking the beauty of Jesus' glory.\n\nMoses’ intercession for Israel exemplifies his humility and dedication. His shining face was a result of his deep intercessory prayer for the people, showing that spending time in God’s presence for others brings spiritual radiance. Moses’ humility is further highlighted by his use of a veil to divert attention from himself to God.\n\nFinally, the text underscores that while the Law of Moses had glory, it was limited by human sin. The true and unimpeded glory comes through Jesus Christ, whose sacrifice removes the veil of sin, allowing believers to reflect God's glory fully. The call is to embrace the new covenant through Jesus, experiencing transformation from glory to glory.",
      "pdfLink": "/sermons/SHINING_WITH_THE_GLORY_OF_GOD.pdf",
      "image": "/sermons/SHINING_WITH_THE_GLORY_OF_GOD.png",
      "imgRef": "https://unsplash.com/photos/orange-fruit-tree-under-blue-sky-during-daytime-FnnCtrmLkKc",
      "pages": "3"
    },
    {
      "title": "The God who Gives",
      "summary": "The principle of giving and receiving is deeply ingrained in the fabric of creation itself, as illustrated by the abundance and generosity of nature. Just as the sun, water, soil, and even deserts give forth their blessings, God expects us to give back to Him in abundance.\n\nOur foremost offering to God is our lives themselves. In the same way that God gave us life, we are called to present ourselves as living sacrifices, wholly devoted to His service. This includes dedicating our time, talents, and resources to His kingdom.\n\nAbraham's willingness to offer his son Isaac and Hannah's vow to dedicate her son Samuel are powerful examples of giving back to God the very lives He has blessed us with. Similarly, Anna's lifelong devotion to serving God in the temple demonstrates the profound impact of giving one's time abundantly to the Lord.\n\nWhen it comes to material wealth, we are reminded of Jesus' own sacrifice – though rich, He became poor for our sake, that through His poverty we might become rich in Him. Generosity is not only about monetary wealth but also about the attitude of the heart. God delights in a cheerful giver, one who gives freely and joyfully, without reservation.\n\nThe story of the miserly man who learns the joy of giving underscores the transformative power of generosity. Just as God gave His Son out of love for the world, we are called to emulate His sacrificial love by giving generously to others.\n\nUltimately, our giving reflects our faith and trust in God's provision. As we sow bountifully, we can trust that God will make all grace abound toward us, ensuring that we have more than enough to abound in every good work. Let us, therefore, give freely and generously, knowing that in doing so, we participate in God's eternal principle of giving and receiving.",
      "pdfLink": "/sermons/THE_GOD_WHO_GIVES.pdf",
      "image": "/sermons/THE_GOD_WHO_GIVES.png",
      "imgRef": "https://unsplash.com/photos/orange-fruit-tree-under-blue-sky-during-daytime-FnnCtrmLkKc",
      "pages": "3"
    },
    {
      "title": "Going to Jerusalem",
      "summary": "The journey of Philip to meet the Ethiopian eunuch underscores the divine orchestration of God's plan to reach hearts and souls with the Gospel message. Despite the thriving revival in Samaria, Philip's immediate obedience to the Spirit's leading took him to the desert road where he encountered the seeking heart of the Ethiopian eunuch.\n\nThe Ethiopian's journey to Jerusalem for worship reflects a deep spiritual hunger and devotion, reminiscent of the psalmist's longing for the presence of God. In a world where many chase after temporal treasures, his pursuit of spiritual fulfillment in Jerusalem serves as a poignant reminder of the eternal significance of seeking God's kingdom above all else.\n\nThe encounter between Philip and the Ethiopian eunuch highlights God's inclusivity and impartiality in extending salvation to all nations. The eunuch's sincere engagement with Scripture in the desert setting demonstrates his genuine hunger for spiritual truth, which God honors by sending Philip to guide him.\n\nJust as God revealed himself to Moses on Mount Sinai and to Elijah in the desert, the desert becomes a sacred space where God encounters his people in profound ways. In the barrenness of the desert, distractions are stripped away, allowing for a deeper communion with God and a clearer reception of his word.\n\nThe urgency of salvation is emphasized in the desert setting, where the harsh conditions serve as a reminder of the brevity of life and the need to prioritize eternal matters. Philip wastes no time in proclaiming the Gospel message, highlighting the singular importance of salvation through repentance, baptism in Jesus' name, and the reception of the Holy Spirit.\n\nIn a world filled with distractions and diversions, the call to \"be still and know that I am God\" resonates deeply in the desert environment. As believers navigate the spiritual desert of the world, may they heed the call to prioritize the proclamation of the Gospel message and lead others to encounter the living God.",
      "pdfLink": "/sermons/GOING_TO_JERUSALEM.pdf",
      "image": "/sermons/GOING_TO_JERUSALEM.png",
      "imgRef": "https://unsplash.com/photos/birds-eye-photography-of-road-on-dessert-ecIZe6MdUH8",
      "pages": "3"
    },
    {
      "title": "The Rapture of the Church",
      "summary": "The analogy of sowing seeds, both in agriculture and in spreading the Gospel, underscores the importance of consistent effort and diligence. Just as farmers sow seeds in faith, uncertain of the outcome but trusting in the process, Christians are called to sow the seeds of the Gospel without hesitation or delay.\nIn a world where many are unaware of the source of their sustenance, the faithful work of farmers ensures a steady food supply. Similarly, the spiritual labor of Christians, though often unnoticed or underappreciated, plays a vital role in spreading the message of salvation to all nations.\nThe urgency of sowing the Gospel is emphasized by the unpredictable nature of the future and the ever-present threat of spiritual opposition. Like the Apostle Paul, believers are called to seize every opportunity to share the Good News, regardless of the circumstances or perceived obstacles.\nJust as farmers patiently wait for their seeds to yield a harvest, Christians sow the seeds of the Gospel with the expectation of a bountiful spiritual harvest in due time. Though the enemy may sow seeds of discord and falsehood, believers are called to remain steadfast in their mission, trusting in the Lord to ultimately bring about justice and redemption.\nAs we eagerly await the return of the Lord, let us continue to sow seeds of faith and hope, knowing that our labor in the Lord is never in vain. Just as the farmer diligently tends to his fields, so too must Christians faithfully sow the seeds of the Gospel, trusting in the Lord to bring about a harvest of souls for his kingdom.\n",
      "pdfLink": "/sermons/THE_POWER_OF_SOWING.pdf",
      "image": "/sermons/THE_POWER_OF_SOWING.png",
      "imgRef": "https://unsplash.com/photos/man-holding-basket-ppE5mjUS8t0",
      "pages": "3"
    },
    {
      "title": "The Rapture of the Church",
      "summary": "The biblical metaphor of the thief in the night serves as a poignant reminder of the unpredictability of the Lord's return. Just as a thief does not announce their arrival, the day of the Lord will come unexpectedly. Vigilance is therefore paramount; those who diligently watch for the signs of the last days will be prepared for his coming. Among these signs are wars, natural disasters, pestilences, and the rise of false doctrine and false prophets, a warning reiterated by Jesus himself.\nThe signs of the end times are not always dramatic; everyday occurrences such as abundance in food, drink, and material possessions, along with the proliferation of knowledge and information, are also indicators. Despite the accessibility of knowledge, there remains a pervasive lack of understanding of the truth of salvation.\nCrucially, the Gospel has been preached in every nation, marking a significant milestone in the countdown to the Lord's return. As believers, we are called to actively participate in spreading the Gospel, knowing that each soul reached brings us closer to the fulfillment of prophecy.\nThe return of the Lord Jesus will be like a thief coming to steal the most precious treasure on earth: the church. Once the church is removed, chaos will ensue, signaling the beginning of the end for the world as we know it. However, for believers, the rapture signifies the beginning of eternal life, peace, and blessings.\nIn light of these truths, let us remain vigilant and focused on the imminent return of the Lord, eagerly anticipating the day when we will partake in the first resurrection and reign with him for a thousand years.\n",
      "pdfLink": "/sermons/THE_RAPTURE_OF_THE_CHURCH.pdf",
      "image": "/sermons/THE_BLESSED_HOPE_UNVEILING_THE_RAPTURE_IN_SCRIPTURE.jpg",
      "imgRef": "https://t3.ftcdn.net/jpg/00/14/64/64/360_F_14646443_L4bwJR0VptCXHA0wM0s40r6bQJ3uuBd5.jpg",
      "pages": "3"
    },
    {
      "title": "He is not here, He is Risen!",
      "summary": "The narrative begins with the biblical account of the Exodus, where the children of Israel departed from Egypt after applying the blood of the lamb to their doorposts. This act symbolizes a resurrection of a nation that had been in bondage for 430 years. The power of the lamb in this event foreshadows the resurrection of Jesus Christ. Just as the blood protected the Israelites from the destroyer in Egypt, Jesus' death and resurrection conquered death itself.\nThe physical death of Jesus, symbolized by his blood, defeated death and paved the way for resurrection. Paul's exclamation in Corinthians underscores this victory over death through Jesus Christ. Jesus' resurrection, a physical reality, was witnessed by over 500 disciples, ensuring the certainty of his victory over death.\nPaul admonishes against doubting the physical resurrection of Jesus, as it is the foundation of Christian faith. He even names those who deny this truth, emphasizing its significance. The resurrection is the only hope for eternal life, made possible by God's sacrifice of his own Son.\nJesus' power to raise the dead is demonstrated in his miracle of raising Lazarus, foreshadowing his own resurrection. Unlike Lazarus, Jesus' flesh did not see corruption, affirming the reality of his physical resurrection. The apostles, including Peter, bore witness to this truth, and their testimony is the foundation of Christian faith.\n",
      "pdfLink": "/sermons/HE_IS_NOT_HERE_HE_IS_RISEN.pdf",
      "image": "/sermons/HE_IS_NOT_HERE_HE_IS_RISEN.png",
      "imgRef": "https://unsplash.com/photos/a-small-wooden-church-with-a-cross-on-top-of-it-rt1HMR1pQUY",
      "pages": "3"
    },
    {
      "title": "The Voice of the Blood of Jesus",
      "summary": "Blood appears to have a voice, echoing from ancient times when Abel's blood cried out from the ground. Cain clearly underestimated the power of blood to appeal for justice when he killed his righteous brother. Blood is vital in keeping the body functioning properly and maintaining good health. Scripture emphasizes its role in atonement. Blood is never spilled in vain; it speaks a powerful language – the language of deliverance and salvation. In the prophecy of Jacob, the Messiah is intimately associated with blood. The Exodus narrative underscores its significance in safeguarding households. While human bloodlines are tainted by sin, Jesus offers a new and non-Adamic bloodline, through his flesh and blood that originated from the word of God. The blood of Jesus speaks powerfully. It says that Jesus is God(Acts 20:28). The blood of Jesus speaks better things than that of Abel, because it took away the sins of the whole world. Through the blood of Jesus, sins are absolved, and debts to death paid. Heaven reverberates with praise for the blood's power to cleanse and redeem. Just as blood circulates within us, Jesus' blood continually offers purification to sinners and saints. Its call remains: \"...the blood of Jesus Christ his Son cleanseth us from all sin” (I John 1:7).",
      "pdfLink": "/sermons/THE_VOICE_OF_THE_BLOOD_OF_JESUS.pdf",
      "image": "/sermons/THE_VOICE_OF_THE_BLOOD_OF_JESUS.png",
      "imgRef": "https://unsplash.com/photos/woman-in-white-hijab-holding-persons-hand-9UW_8aVN8mA",
      "pages": "3"
    },
    {
      "title": "Is the Flesh of Jesus God?",
      "summary": "Sometimes, in order to better elucidate a question that may be difficult for some One God\nChristians to answer, it is helpful to formulate the question and meditate on it in light of the\nscriptures. One way to answer this question is by reminding ourselves that we put on the same\nbody of the Lord in baptism. “For as many of you as have been baptized into Christ have put\non Christ” (Galatians 3:27). We can reinforce this scripture with another one to drive home\nthe point that we do indeed put on the literal body of the Lord with which we can enter\nheaven. “Who shall change our vile body, that it may be fashioned like unto his glorious body,\naccording to the working whereby he is able even to subdue all things unto himself” (Phil\n3:21). Now, once it is clear that we will have the same body as the Lord Jesus had on this\nearth, and still has in heaven, it becomes easier to answer the question: is the flesh of Jesus\nGod? Obviously, the answer is that the flesh of Jesus cannot be reduced to all that is God for\nthat would mean we ourselves have put on “God-flesh”. This is why it is so important to\nemploy precise biblical language, or we will be in danger of courting false doctrine. Let us\nexplore this theme further.",
      "pdfLink": "/sermons/IS_THE_FLESH_OF_JESUS_GOD.pdf",
      "image": "/sermons/IS_THE_FLESH_OF_JESUS_GOD.png",
      "imgRef": "https://unsplash.com/photos/white-notebook-on-white-textile-3ZvHsFiZyME",
      "pages": "2"
    },
    {
      "title": "What is the Relation of the Spirit of God to His Flesh and Blood?",
      "summary": "This sermon explores the relationship between the Spirit of God and His flesh and blood. It begins by establishing that God, being spirit, cannot be made into anything. As stated in John 1:14, his word was made flesh. This distinction is crucial because God's essence is eternal and immutable, as affirmed in Malachi 3:6.\nThe explanation delves into the scripture in 1 Timothy 6:16 which speaks of Jesus having immortality. How can Jesus have immortality when he died on the Cross? The answer is that when we say “Jesus”, we are speaking about the Spirit in the flesh. Hence Jesus has immortality in his Spirit, but not in the flesh. This interpretation is supported by passages such as Romans 8:11, which speaks of the Spirit of God raising Jesus from the dead. It emphasizes the importance of distinguishing between the mortal flesh and the immortal Spirit of Jesus.\nThe discourse warns against ancient heresies such as Marcionism and Docetism, which denied the reality of Jesus' physical body and his suffering and death. It underscores the biblical teaching that Jesus was genuinely man, with a corporeal body subject to suffering and death. The rejection of these heretical views is grounded in the biblical accounts of Jesus' physical resurrection and His post-resurrection appearances to His disciples (Luke 24:39).\nFurthermore, the sermon emphasizes the importance of understanding the relationship between the flesh and blood of Jesus and the Spirit of God. It refutes the notion of \"spirit flesh\" and asserts that Jesus truly died on the cross. It highlights the necessity of the Holy Spirit for spiritual life, even after baptism. The text emphasizes the vital role of the Spirit in giving life, contrasting it with the limitations of the flesh. Ultimately, it warns against reducing the Spirit of God to the flesh and blood of God alone, and the flesh and blood of God to the Spirit of God alone – as that would be a heresy.\n",
      "pdfLink": "/sermons/WHAT_IS_THE_RELATION_OF_THE_SPIRIT_OF_GOD_TO_HIS_FLESH_AND_BLOOD.pdf",
      "image": "/sermons/WHAT_IS_THE_RELATION_OF_THE_SPIRIT_OF_GOD_TO_HIS_FLESH_AND_BLOOD.png",
      "imgRef": "https://unsplash.com/photos/white-notebook-on-white-textile-3ZvHsFiZyME",
      "pages": "4"
    },
    {
      "title": "The Gospel not After Man",
      "summary": "The sermon on Galatians 1:11 emphasizes the divine origin of the Gospel message. It starts by defining the Gospel as the story of God manifesting in the flesh, dying for humanity's sins, rising from the dead, and living within believers through the Holy Spirit. This Gospel, it asserts, was revealed by Jesus himself and was not conceived by humans.\n\nThe narrative highlights the mystery of the Gospel, which was hidden from prophets and apostles until Jesus personally revealed it. Despite their role in conveying God's messages, they did not fully comprehend the significance of the Gospel until later. Satan's efforts to obscure the Gospel from humanity are also noted, underscoring the importance of divine intervention in sharing the message.\n\nThe sermon emphasizes Paul's personal experience of receiving the Gospel directly from Jesus, rather than through human intermediaries. This underscores the uniqueness and authenticity of the Gospel, which is not passed down as an inheritance from others but is a direct gift from God.\n\nIn the context of contemporary challenges and societal trends described in 2 Timothy 3:1–5, the sermon emphasizes the enduring power of the Gospel for those who have received it directly from God. It asserts that Jesus speaks to individuals in their own unique ways, making the Gospel accessible and relevant to people from all backgrounds and cultures.",
      "pdfLink": "/sermons/THE_GOSPEL_NOT_AFTER_MAN.pdf",
      "image": "/sermons/THE_GOSPEL_NOT_AFTER_MAN.jpeg",
      "imgRef": "https://unsplash.com/photos/white-and-blue-cards-on-blue-textile-rEuqYuF470U",
      "pages": "3"
    },
    {
      "title": "The Gospel in the Court of Law",
      "summary": "The sermon delves into the significance of the Law of God and its relationship to the Gospel of Jesus Christ. It begins by elucidating how the Law, given on Mount Sinai, represents the righteousness and holiness of God. Unlike human laws, the Law of God is unchanging and shows no mercy. The severity of the Law is illustrated through examples such as the punishment of death for breaking its commands.\n\nHowever, the sermon highlights that the Law, despite its strictness, points to the Gospel of Jesus Christ. While the Law condemned and killed people for their sins, it ultimately paved the way for the arrival of Jesus, who fulfilled its demands. The birth of Jesus in Bethlehem stands in stark contrast to the thunderous events at Mount Sinai, signifying the transition from fear and judgment to love, peace, and mercy.\n\nThe narrative progresses to discuss how the Law played a crucial role in the arrest and condemnation of Jesus and the apostle Paul. Despite their innocence, both were subjected to trials and judgment by the Law. However, their condemnation ultimately served to fulfill the demands of the Law, leading to the redemption of humanity.\n\nThe sermon also touches upon the role of the Romans as a reluctant third party in the trials of Jesus and Paul. While the Romans were hesitant to pass judgment, their involvement ultimately facilitated the fulfillment of the Law's demands.\n\nIn conclusion, the sermon emphasizes the ongoing conflict between the Gospel and the world, with the Gospel often facing trial and opposition. However, through the ministry of reconciliation, believers are called to proclaim the message of Jesus Christ, which offers forgiveness and peace with God. The narrative underscores the transformative power of the Gospel, which brings reconciliation between humanity and God, ultimately triumphing over the demands of the Law.\n\n\n\n\n",
      "pdfLink": "/sermons/THE_GOSPEL_IN_THE_COURT_OF_LAW.pdf",
      "image": "/sermons/THE_GOSPEL_IN_THE_COURT_OF_LAW.jpeg",
      "imgRef": "https://unsplash.com/photos/brown-wooden-tool-on-white-surface-veNb0DDegzE",
      "pages": "3"
    },
    {
      "title": "God Also Hath Highly Exalted Him",
      "summary": "The sermon centers on the exaltation of Jesus Christ, emphasizing the unparalleled significance of his name. Drawing from Philippians 2:9-10, the preacher highlights that God has highly exalted Jesus and bestowed upon him a name above every other name. This exaltation is rooted in the fact that Jesus is the manifestation of God Himself.\n\nDespite God's numerous mighty works, including the creation of the universe and the deliverance of Israel from Egypt, it is Jesus who receives the highest honor. The reason for this, as the sermon explains, is that Jesus is the vessel through whom God performed His most exalted work ever.\n\nThe narrative delves into the paradoxical nature of Jesus' exaltation, contrasting human rejection and humiliation with divine elevation. Despite the degradation Jesus faced during his earthly ministry, God exalted him above every name. The sermon emphasizes that the more Jesus is brought down by humans, the higher God will exalt him.\n\nUsing the example of Saul's conversion on the road to Damascus, the preacher illustrates the transformative power of encountering the exalted Jesus. Saul, who initially persecuted followers of Jesus, was profoundly changed when he encountered the exalted Jesus, leading to his confession of Jesus as God.\n\nIn conclusion, the sermon urges listeners to acknowledge and exalt Jesus as the manifestation of God Himself. It emphasizes the necessity of repentance, baptism in Jesus' name, and receiving the Holy Spirit to please God and conquer the challenges of the world. The central message is that Jesus, exalted by God above all names, is deserving of honor and reverence as the one true God.",
      "pdfLink": "/sermons/GOD_ALSO_HATH_HIGHLY_EXALTED_HIM.pdf",
      "image": "/sermons/GOD_ALSO_HATH_HIGHLY_EXALTED_HIM.jpeg",
      "imgRef": "https://unsplash.com/photos/aerial-photography-of-white-frames-on-top-of-water-eUfnha6ev9g",
      "pages": "3"
    },
    {
      "title": "The Kingdom of Heaven Like a Mustard Seed",
      "summary": "The parable of the mustard seed, as described in Matthew 13:31-32, illustrates the concept of the Kingdom of Heaven. Despite its small size, the mustard seed grows into a large tree, providing shelter for birds. This parable symbolizes the exponential growth and impact of the Kingdom of Heaven.\n\nThe sermon draws a comparison between the mustard seed and an aspirin tablet, highlighting the disparity in their perceived effectiveness. While an aspirin tablet may relieve a headache temporarily, the mustard seed represents the transformative power of Jesus Christ. Just as the mustard seed grows into a large tree, the influence of Jesus can expand exponentially in the lives of believers.\n\nThe narrative emphasizes the importance of faith, using examples such as the parents of Moses and the story of David. Despite their humble beginnings, these individuals exhibited faith as small as a mustard seed, leading to remarkable outcomes. Similarly, believers are encouraged to have faith in the power of Jesus Christ to transform lives.\n\nThe sermon also addresses the issue of congregational size, reassuring believers that greatness is not determined by numbers but by the presence of Jesus Christ. The example of the apostle Paul, often described as small in stature, underscores the idea that true greatness comes from the mustard seed, representing Jesus.\n\nIn conclusion, the sermon encourages believers to focus on planting the mustard seed of Jesus Christ in the hearts of others, trusting in its transformative power. By allowing Jesus to grow within them, believers can experience the fullness of salvation and allow His influence to permeate every aspect of their lives.\n\n\n\n\n",
      "pdfLink": "/sermons/THE_KINGDOM_OF_HEAVEN_LIKE_A_MUSTARD_SEED.pdf",
      "image": "/sermons/THE_KINGDOM_OF_HEAVEN_LIKE_A_MUSTARD_SEED.jpeg",
      "imgRef": "WhatsApp_sis_Sarah_london",
      "pages": "3"
    },
    {
      "title": "The Purpose of Fasting",
      "summary": "The sermon delves into the significance of fasting, drawing primarily from Deuteronomy 8:3, which highlights that God humbled Israel through hunger, introducing the concept of fasting as a means of subordinating the desires of the flesh to appreciate God. The origin of pride is linked to a corrupt spirit, fueled by the flesh and its reliance on food.\n\nThe narrative refers to the Israelites, who, after 430 years of slavery in Egypt, expected a lavish feast on their journey to the promised land. However, God, testing their ability to prioritize spiritual needs over physical desires, provided manna. The kingdom of God, the sermon emphasizes, is not about meat and drink but righteousness, peace, and joy in the Holy Ghost.\n\nThe war between the flesh, craving earthly comforts, and the spirit, yearning for God, is explored. Fasting is portrayed as a practice that trains the flesh to submit to the spirit. The sermon links the Lord's forty-day fast to this war, emphasizing that Jesus, not having a flesh from the earth, was not subject to earthly cravings.\n\nThe act of fasting is presented as a declaration that the earth will not be the master but Jesus, the God of the Spirit. Quoting John 8:23-24, the distinction between being from beneath (earthly) and from above (spiritual) is highlighted. The death of Judas is cited as a cautionary example of prioritizing the stomach (earthly) over spiritual matters.\n\nThe scripture in Deuteronomy 8:3 is dissected further, emphasizing that man lives not by bread alone but by every word that proceeds out of the mouth of the Lord. Fasting is portrayed as a demonstration of awareness of our origin, created by the word of God. The act of fasting, the sermon contends, signifies spiritual maturity and investment in a better spiritual tomorrow.\n\nThe sermon concludes by referencing Mark 2:19-20, where Jesus speaks about fasting in the context of the bridegroom being taken away. This is interpreted as a recognition that, in the absence of the direct presence of the divine (the bridegroom), fasting becomes a crucial spiritual discipline.",
      "pdfLink": "/sermons/THE_PURPOSE_OF_FASTING.pdf",
      "image": "/sermons/THE_PURPOSE_OF_FASTING.jpeg",
      "imgRef": "https://images.squarespace-cdn.com/content/v1/601093fd30ef2d697a10ecba/1633040367277-U658QCE8CYD2J79Q66JP/fasting-prayer-jesus.jpg",
      "pages": "2"
    },
    {
      "title": "Jesus: The Desire of All Nations",
      "summary": "The sermon centers on Haggai 2:7, which declares that God will shake all nations, and the desire of all nations, referring to Jesus, will come. The preacher emphasizes the transient nature of worldly stability, likening it to shaky ground that crumbles in the face of divine shaking. The call is for people to place their trust in Jesus, described as the desire of all nations.\n\nThe analogy of walking on dry ground amidst the sea, similar to the Israelites' experience after God shook Egypt, is used to convey the safety and stability found in Jesus. Believers, founded on Jesus as the cornerstone, are encouraged to navigate life's challenges with the surety that comes from their faith.\n\nThe sermon underscores the inevitability of God shaking all nations, highlighting the futility of trusting in human structures or leaders. Drawing lessons from the political situation in Bolivia, the preacher warns against putting faith in political figures, emphasizing that Jesus will shake all nations.\n\nThe passage discusses the curse of trusting in humans and contrasts it with the blessing of trusting in the Lord. The metaphor of the heath, specifically the Arar plant, serves as a warning against deceptive appearances and the danger of trusting in worldly entities.\n\nFinally, the preacher interprets the filling of \"this house with glory\" as a reference to the Temple of believers' bodies. The New Covenant, as articulated in Jeremiah 31:33-34, is cited to emphasize the dwelling of God within believers. The ultimate vision is of the earth being filled with the knowledge of the Lord as the waters cover the sea, portraying a future where God lives in every individual.\n\nThe sermon concludes with an exhortation for believers to prepare for the coming of the desire of all nations, urging them to welcome Jesus into their lives as the ultimate fulfillment of God's promise.\n\n\n\n\n",
      "pdfLink": "/sermons/JESUS_THE_DESIRE_OF_ALL_NATIONS.pdf",
      "image": "/sermons/JESUS_THE_DESIRE_OF_ALL_NATIONS.jpg",
      "imgRef": "https://unsplash.com/photos/grayscale-photography-of-a-man-standing-in-front-of-a-jesus-graffiti-QDP10NbwcyE",
      "pages": "3"
    },
    {
      "title": "Call for Simon",
      "summary": "The sermon focuses on Acts 11:13-14, using the example of Cornelius, who saw an angel but needed to hear words from Peter for salvation. Angels are powerful beings, but angels lack the experience of salvation and the transformative power of Jesus' words. They are not commissioned to preach the Gospel; only humans, having experienced salvation, can effectively convey the words of Jesus.\n\nThe preacher highlights the transformative power of the words of Jesus, drawing a parallel with the tongues of fire on the Day of Pentecost. This event, described in Acts 2:2-3, signifies the entry of Jesus' words into believers as tongues of fire, enabling them to become messengers of salvation. The preacher asserts that angels lack this experience, and evil angels, being associated with lies, are forbidden to convey any message.\n\nThe phrase \"Call for Simon\" is central to the sermon, representing a call to those who know about sin and transformation through the Lord Jesus Christ. Simon, or Peter, had received the words of Jesus during Pentecost. The preacher sees this as a representation of all Christians today, emphasizing that despite strengths, weaknesses, and contradictions, believers carry the deposit of Jesus' words for salvation.\n\nThe sermon stresses the importance of responding to the call to share the words of salvation, comparing believers to spiritual first responders. The responsibility, likened to that of Jonah, requires believers to be vigilant, watchful, and always ready to respond to the call. The urgency of salvation is compared to a matter of life and death, and believers are encouraged to see themselves as spiritual first responders, always ready to share the transformative words of Jesus for the salvation of others.",
      "pdfLink": "/sermons/CALL_FOR_SIMON.pdf",
      "image": "/sermons/CALL_FOR_SIMON.jpg",
      "imgRef": "https://unsplash.com/photos/a-picture-frame-with-scrabble-letters-and-autumn-leaves-gvCpry57mcg",
      "pages": "4"
    },
    {
      "title": "Ezra Prepared his Heart",
      "summary": "In this sermon on Ezra 7:10, the focus is on Ezra's preparation to seek, do, and teach the law of the Lord. The context is the end of the Babylonian captivity as prophesied by Jeremiah. Ezra, a captive in Babylon, understood the significance of the times through his knowledge of God's word.\n\nThe preacher emphasizes the importance of understanding the prophetic clock of God, referring to Deuteronomy 28:13, which speaks of being the head and not the tail if one heeds the commandments of the Lord. Regardless of one's circumstances, knowing God's timing is crucial.\n\nEzra's preparation involved seeking the word of God diligently. The sermon cites Isaiah 26:9, highlighting the idea that the gifts of God can only be understood through a knowledge of His word. The preacher draws a parallel with the condition for Israel to inherit the land of Canaan, emphasizing that forsaking the covenant led to their exile. Ezra, learning from this, prepared his heart to seek the Lord to prevent a recurrence.\n\nMoreover, Ezra didn't stop at seeking; he also implemented what he learned from the word of God. The sermon emphasizes the importance of not only knowing but also obeying the word of God. The example is given of those who knew the word but lacked love for God, as mentioned in John 5:42.\n\nThe sermon concludes with Ezra's determination to teach the word of God to Israel. Teaching is presented as a calling of sacrifice, love, and labor. The preacher underscores the joy of seeing others grow in knowledge and grace. The role of a teacher is described as being patient, adaptable, and prayerful, yet ready to challenge the rebellious for the sake of the truth, drawing inspiration from Ezra's actions in Ezra 10:1.\n\nOverall, the sermon encourages the congregation to follow Ezra's example of preparation—seeking, doing, and teaching the word of God. It stresses the relevance of understanding God's timing and the need for both personal obedience and a commitment to teaching others.",
      "pdfLink": "/sermons/EZRA_PREPARED_HIS_HEART.pdf",
      "image": "/sermons/EZRA_PREPARED_HIS_HEART.png",
      "pages": "2"
    },
    {
      "title": "What Doth the Lord Require of Thee?",
      "summary": "This sermon on Micah 6:8 explores the profound requirements that the Lord has set for humanity: to do justly, love mercy, and walk humbly with God. The preacher emphasizes that God has clearly shown what is good; it's not a mystery hidden from humanity. This revelation is not exclusive to any particular group but is accessible to all, as evident from the examples of various biblical figures like Adam, Abel, Seth, Noah, and Job who knew and demonstrated what was good.\n\nThe sermon highlights the role of conscience as a God-given arbiter of good and bad, emphasizing the need for individuals to train their consciences to be spiritually fit. Going against one's conscience is deemed destructive.\n\nThe concept of doing justly is explained as aligning one's decisions with the will of God. Knowledge of the law, both earthly and divine, is crucial for such just actions. The distinction between ethics (theory of justice) and morality (action based on ethics) is drawn, emphasizing that acting justly requires knowledge of God's word.\n\nLoving mercy is presented as more than just forgiveness; it involves having the power to seek justice but choosing to forgive. The example of Joseph forgiving his brothers, who had committed serious sins against him, is cited as an illustration of true mercy.\n\nWalking humbly with God is defined as understanding one's true self outside of the salvation and grace of Jesus Christ. Humility involves recognizing one's origin in sin and acknowledging God's embodiment of humility in Jesus Christ.\n\nThe sermon concludes by presenting Jesus Christ as the perfect embodiment of Micah 6:8, as He is goodness personified, just in His actions, and the ultimate manifestation of God's mercy. Belief in Jesus and acceptance of His goodness, mercy, justice, and humility lead to baptism and a life aligned with the will of Jesus, fulfilling Micah 6:8. The congregation is encouraged to look to Jesus in an evil world and find in Him the revelation of what is truly good.",
      "pdfLink": "/sermons/WHAT_DOTH_THE_LORD_REQUIRE_OF_THEE.pdf",
      "image": "/sermons/WHAT_DOTH_THE_LORD_REQUIRE_OF_THEE.jpg",
      "imgRef": "https://i.redd.it/fmv2lq0y9fw01.jpg",
      "pages": "3"
    },
    {
      "title": "Then Cometh the Devil",
      "summary": "This sermon on Luke 8:12 emphasizes the regularity of the Devil's attempts to snatch away the word of God whenever it is preached. Drawing an analogy with birds following a farmer who is sowing seeds, the preacher underscores the constant presence of the Devil, who never misses a chance to interfere with the reception of God's word. The spiritual implication is that Christians need to take these seemingly harmless distractions seriously, as they represent unclean spirits sent to distract and steal the seed of the word of God.\nThe sermon delves into the various methods farmers use to protect their seeds from birds, comparing these to spiritual strategies for safeguarding the word of God. The importance of the word is emphasized, with a parallel drawn between the need for food for physical survival and the necessity of the word for spiritual life.\nA key revelation presented is the \"nuclear bomb\" of revelations—the One God doctrine. Likening this doctrinal truth to a nuclear weapon that terrifies the Devil, the preacher suggests that the spiritual realm is profoundly affected when Christians grasp and embody the truth of the oneness of God.\nThe historical example of Moses confronting Pharaoh with the declaration of the one God is cited, highlighting the transformative power of this truth. The Devil's fear of Christians acquiring this doctrinal \"weapon\" is emphasized, suggesting that the Devil's strategic attendance at church services is to prevent believers from grasping this truth that could be destructive to his kingdom.\nThe sermon concludes by urging believers to be aware that the Devil targets the heart, where the word is deposited, emphasizing the need for a deep understanding of doctrinal truths. It encourages believers to prioritize what is needful, echoing the words of Jesus to Martha in Luke 10:41–42. Overall, the message serves as a call to spiritual vigilance, doctrinal depth, and a strategic understanding of the constant efforts of the Devil.\n",
      "pdfLink": "/sermons/THEN_COMETH_THE_DEVIL.pdf",
      "image": "/sermons/THEN_COMETH_THE_DEVIL.jpg",
      "imgRef": "https://unsplash.com/photos/woman-in-brown-dress-standing-on-flower-field-during-daytime-hAHsVf7W9HE",
      "pages": "3"
    },
    {
      "title": "Young Man, I Say Unto Thee Arise",
      "summary": "The sermon on Matthew 12:42 draws parallels between the Queen of Sheba's journey to seek the wisdom of Solomon and the response of the present generation to the wisdom of Jesus Christ. It emphasizes the condemning judgment the Queen of Sheba will have on the current generation for not responding adequately to the wisdom and invitation of Jesus.\n\nThe Queen of Sheba is portrayed as a seeker of divine wisdom who, despite being rich in material possessions, recognized her spiritual poverty and sought the wisdom of God. Her journey to Jerusalem, risking everything and taking a generous offering to Solomon, is presented as an act of great faith and humility. The contrast is made with the current generation that, despite hearing about Jesus' miraculous birth, healing power, sacrificial death, and imminent return, remains indifferent and hesitant to seek Him.\n\nThe audience is urged not to be condemned by the Queen of Sheba on the day of judgment. The importance of actively seeking Jesus, responding to His invitation, and humbling oneself in the process is highlighted. The sermon encourages believers to undertake a spiritual journey to Jesus, reminiscent of the Queen of Sheba's physical journey, and to ask questions that only Jesus can answer. Patience, faith, and hope in the journey to Jesus are emphasized as virtues that yield great benefits.\n\nIn conclusion, the congregation is invited to step down from their metaphorical thrones, risk everything, and go to the Lord Jesus Christ. The sermon urges a proactive and faith-filled response to the wisdom and invitation of Jesus, framing the Queen of Sheba as a model for all who seek God. The final call is to join in a collective journey to Jerusalem, ensuring that the Queen of Sheba does not condemn individuals for not responding to the greater wisdom presented in Jesus Christ.\n",
      "pdfLink": "/sermons/YOUNG_MAN_I_SAY_UNTO_THEE_ARISE.pdf",
      "image": "/sermons/YOUNG_MAN_I_SAY_UNTO_THEE_ARISE.jpeg",
      "imgRef": "https://media.freebibleimages.org/stories/FB_GNPI_040_Widow_Nain/source-jpeg/01_FB_GNPI_040_Widow_Nain_1024.jpg?1613321547",
      "pages": "3"
    },
    {
      "title": "The Judgement of the Queen of Sheba",
      "summary": "The sermon on Matthew 12:42 draws parallels between the Queen of Sheba's journey to seek the wisdom of Solomon and the response of the present generation to the wisdom of Jesus Christ. It emphasizes the condemning judgment the Queen of Sheba will have on the current generation for not responding adequately to the wisdom and invitation of Jesus.\n\nThe Queen of Sheba is portrayed as a seeker of divine wisdom who, despite being rich in material possessions, recognized her spiritual poverty and sought the wisdom of God. Her journey to Jerusalem, risking everything and taking a generous offering to Solomon, is presented as an act of great faith and humility. The contrast is made with the current generation that, despite hearing about Jesus' miraculous birth, healing power, sacrificial death, and imminent return, remains indifferent and hesitant to seek Him.\n\nThe audience is urged not to be condemned by the Queen of Sheba on the day of judgment. The importance of actively seeking Jesus, responding to His invitation, and humbling oneself in the process is highlighted. The sermon encourages believers to undertake a spiritual journey to Jesus, reminiscent of the Queen of Sheba's physical journey, and to ask questions that only Jesus can answer. Patience, faith, and hope in the journey to Jesus are emphasized as virtues that yield great benefits.\n\nIn conclusion, the congregation is invited to step down from their metaphorical thrones, risk everything, and go to the Lord Jesus Christ. The sermon urges a proactive and faith-filled response to the wisdom and invitation of Jesus, framing the Queen of Sheba as a model for all who seek God. The final call is to join in a collective journey to Jerusalem, ensuring that the Queen of Sheba does not condemn individuals for not responding to the greater wisdom presented in Jesus Christ.\n",
      "pdfLink": "/sermons/THE_JUDGEMENT_OF_THE_QUEEN_OF_SHEBA.pdf",
      "image": "/sermons/THE_JUDGEMENT_OF_THE_QUEEN_OF_SHEBA.jpg",
      "imgRef": "https://www.un.org/ungifts/sites/www.un.org.ungifts/files/unny013g.jpg",
      "pages": "3"
    },
    {
      "title": "The Purpose of Unity",
      "summary": "The sermon explores the theme of unity, emphasizing its importance and potential consequences based on biblical narratives. It begins by praising the beauty of unity, linking it to security, peace, progress, and prosperity. Psalm 133 is cited to illustrate the goodness and pleasantness of brethren dwelling together in unity, likening it to the anointing of the Holy Spirit.\nThe sermon then delves into the story of the Tower of Babel from Genesis 11, highlighting the unity the people had in language and speech. However, it warns that unity without consulting God can lead to disaster, drawing parallels with the cautionary tale of Lot and Jehoshaphat's discernment when facing united prophesies.\nThe Tower of Babel is presented as an example of unity that ignored God, leading to the loss of language, city, and unity itself. The sermon underscores that unity must align with God's will, quoting Genesis 1:28 about filling the earth and multiplying. It contrasts the disobedient unity of Babel with the united prayer of 120 disciples in Acts 2, leading to the outpouring of the Holy Spirit on Pentecost.\nThe purpose of unity is then discussed, focusing on Acts 2:1-2 and Joel 2:28 as the fulfillment of the greatest prophecy in the Bible—the outpouring of the Holy Spirit. The sermon argues that unity among believers striving for the faith of the gospel is a worthy purpose, referencing Philippians 1:27. The unity of the Apostles and early Christians in Jerusalem is presented as a positive example of unity bringing blessings and growth.\nIn conclusion, the sermon encourages believers to seek unity for the purpose of the outpouring of the Holy Spirit as in the day of Pentecost and striving together for the gospel, invoking divine favor and growth in the church. The hope is expressed for the Lord to grant a similar unity to believers in the present day.\n",
      "pdfLink": "/sermons/THE_PURPOSE_OF_UNITY.pdf",
      "image": "/sermons/THE_PURPOSE_OF_UNITY.jpeg",
      "imgRef": "https://www.un.org/ungifts/sites/www.un.org.ungifts/files/unny013g.jpg",
      "pages": "3"
    },
    {
      "title": "Jesus – the Prince of Peace",
      "summary": "The sermon explores the theme of peace during the Christmas season, focusing on Isaiah 9:6, which describes Jesus as the \"Prince of Peace.\" It acknowledges the apparent disconnect between the traditional association of Christmas with peace and the ongoing wars and conflicts in the world. Despite this, the sermon assures believers that the hope for peace through Jesus Christ will not be in vain.\n\nThe message delves into the idea that the rejection of Jesus leads to conflicts, drawing from Luke 19 where Jesus laments over Jerusalem's impending destruction due to their failure to recognize the time of His visitation. The peace offered by Jesus is emphasized as distinct from worldly peace, and the verse from John 14:27 is cited to highlight this heavenly peace bestowed by Jesus.\n\nThe sermon extends beyond human conflicts to natural disasters, referencing the idea that the earth rebelled against humanity after human rebellion against God. However, it brings hope by suggesting that the message of Christmas promises a future where Jesus, as God, has control over storms, famines, and every natural disaster.\n\nAdditionally, the sermon addresses physical illnesses, portraying them as a consequence of Adam's rebellion. Yet, it offers hope by pointing to Jesus' sacrifice on the cross as a means of healing, drawing from Isaiah 53:5. Believers are encouraged to seek healing by acknowledging Jesus' sufferings for their well-being.\n\nFinally, the sermon looks forward to the fulfillment of Isaiah 2:4, envisioning a day when Jesus, as King, will bring lasting peace to the nations. The anticipated reign of Jesus is presented as a time when war and violence will cease, and the sermon concludes with a call to eagerly await Jesus' return.\n\nIn summary, the sermon weaves together the theme of peace, encompassing conflicts, natural disasters, physical illnesses, and the anticipated return of Jesus as the ultimate Prince of Peace. Believers are encouraged to find peace in Jesus and anticipate a future without war or violence.",
      "pdfLink": "/sermons/JESUS_THE_PRINCE_OF_PEACE.pdf",
      "image": "/sermons/JESUS_THE_PRINCE_OF_PEACE.jpg",
      "imgRef": "https://www.un.org/ungifts/sites/www.un.org.ungifts/files/unny013g.jpg",
      "pages": "3"
    },
    {
      "title": "From Deacon to Preacher to Martyr: The Story of Stephen",
      "summary": "The sermon delves into the life of Stephen, the first Christian martyr, drawing insights from Acts 6 and 7. Stephen's name, meaning \"crown,\" becomes significant as he receives the crown of life for his martyrdom. The congregation is reminded of Revelation 2:10, where Jesus promises a crown of life to those who remain faithful unto death.\n\nInitially chosen as one of the seven deacons to serve tables, Stephen's story emphasizes humility in accepting any role assigned by the Lord. The sermon highlights the qualifications for deacons, stressing honesty and being filled with the Holy Spirit. Stephen's qualities extend beyond serving tables, and he soon becomes a powerful preacher, demonstrating the importance of relying on the wisdom of the Holy Spirit rather than titles or natural gifts.\n\nThe message emphasizes the unique blessing of martyrdom, citing Revelation 6:9, where the souls of those slain for the word of God are honored. Stephen's life is presented as a testament to the power of being full of the Holy Spirit, enabling him to perform miracles and preach effectively.\n\nThe sermon concludes with Stephen's martyrdom, showcasing his vision of Jesus standing at the right hand of God. This unique posture signifies Jesus' approval and applause for Stephen's testimony. The congregation is encouraged to look steadfastly to heaven, following Stephen's example, and to keep testifying for Jesus, even unto death. Stephen's death is portrayed as glorious, with his last words echoing those of Jesus on the cross, asking God not to charge his persecutors with sin.\n\nThe overarching lessons include the importance of humility, relying on the Holy Spirit's wisdom, and the honor bestowed upon those who testify for Jesus. Stephen's life serves as an inspiration for believers to remain steadfast, even in the face of persecution, trusting in the ultimate victory of Christ.",
      "pdfLink": "/sermons/FROM_DEACON_TO_PREACHER_TO_MARTYR_THE_STORY_OF_STEPHEN.pdf",
      "image": "/sermons/FROM_DEACON_TO_PREACHER_TO_MARTYR_THE_STORY_OF_STEPHEN.jpeg",
      "imgRef": "https://i.pinimg.com/originals/ec/b7/56/ecb756f78cf6725bb9814492bbba9534.jpg",
      "pages": "3"
    },
    {
      "title": "The Power of the Word of God",
      "summary": "The sermon focuses on the transformative power of the word of God, drawing parallels from Isaiah 55:10-11. The analogy presented is that, just as rain and snow from above nourish the earth, the word of God, emanating from a higher source—God's throne and mouth—nourishes the soul. The principle emphasized is the soul's dependence on the word of God for vitality, similar to how the earth relies on blessings from above.\nThe speaker underscores the necessity of the word of God, emphasizing that without it, the soul becomes parched and dry. The example of King Saul, who rebelled against the word of God, is used to illustrate how a lack of God's word can lead to a spiritual famine.\nThe sermon highlights the promises in the Bible, asserting that God's word never returns empty but accomplishes its intended purpose. Congregants are encouraged to express gratitude for the abundance of God's word and its continuous shower of blessings.\nThe sermon then transitions to the story of King Jehoshaphat, who, by sending teachers to spread the word of God, experienced protection and peace, as enemies were deterred from making war. The lesson drawn is that studying and humbling oneself before the word of God can lead to divine intervention and protection.\nThe narrative shifts to contrasting responses to the word of God, using the examples of Kings Jehoiakim and Josiah. Jehoiakim's disdain for the prophet Jeremiah's message led to a prophecy of his demise, which was fulfilled when Nebuchadnezzar attacked and killed him. On the other hand, Josiah responded to the word of God with humility and repentance, demonstrating that individual responses to God's word matter, even if collective change is challenging.\nThe sermon concludes by referencing the repentance of the people of Nineveh in response to the word of God, showing that collective change is possible. The overall message is a call to appreciate and respect the power of the word of God, acknowledging its ability to transform lives and bring about positive change when received with humility and obedience.",
      "pdfLink": "/sermons/THE_POWER_OF_THE_WORD_OF_GOD.pdf",
      "image": "/sermons/THE_POWER_OF_THE_WORD_OF_GOD.jpg",
      "imgRef": "https://unsplash.com/photos/white-book-page-beside-green-potted-plant-VhcxuEGNXo4",
      "pages": "4"
    },
    {
      "title": "The Lord is My Shepherd",
      "summary": "In this sermon based on Psalm 23, the speaker begins by emphasizing the profound declaration that \"the Lord is my shepherd.\" This statement implies a conscious choice after trying various other \"shepherds\" in life—leaders, philosophies, or ideologies—and realizing that only Jesus suffices. The congregation is invited to collectively affirm, \"The Lord is my shepherd.\" The assurance follows that in having the Lord as one's shepherd, there will be no lack.\n\nThe analogy of David as a shepherd for his sheep is presented, emphasizing David's role in soothing his sheep with heavenly music and risking his life for their safety. Drawing from John 10, the sermon highlights Jesus as the good shepherd who not only lays down his life for the sheep but also has the power to raise himself up.\n\nMoving forward, the sermon explores Psalm 23:2-3, where David expresses his willingness to be led by God, emphasizing the importance of submission to the Lord's leadership. The metaphor of shepherd and sheep signifies submission, contrasting the Egyptians' rejection of shepherds, which is linked to their lack of submission.\n\nThe narrative then shifts to the shepherds in Luke 2, who are the first to hear about the birth of Jesus. The sermon underscores the significance of shepherds in biblical events, tying it to believers being shepherded by the Lord and also shepherding others.\n\nFinally, the sermon touches on the timing of Jesus' birth, coinciding with the season when new lambs were born for Temple sacrifice. This aligns with Jesus being the Lamb of God, symbolizing sacrifice for sins. The sermon concludes by emphasizing the uniqueness of Jesus as both the Father and the Son, echoing John 10:18.\n\nIn summary, the sermon encourages a declaration of faith in Jesus as the great shepherd, emphasizes the importance of submission to His leadership, draws parallels between biblical shepherds and believers, and underscores the symbolic timing of Jesus' birth in connection with sacrificial lambs. The congregation is invited to collectively affirm Jesus as their shepherd.",
      "pdfLink": "/sermons/THE_LORD_IS_MY_SHEPHERD.pdf",
      "image": "/sermons/THE_LORD_IS_MY_SHEPHERD.jpg",
      "imgRef": "https://unsplash.com/photos/man-standing-in-front-of-group-of-lamb-vD3L-rN_qNw",
      "pages": "3"
    },
    {
      "title": "Give Me Also Springs of Water: The Request of Achsah",
      "summary": "Based on Joshua 15:16 and related verses, this sermon explores the story of Achsah, the daughter of Caleb, and draws spiritual lessons from her experience.\nCaleb, Achsah's father, declares that whoever conquers Kirjathsepher will be given Achsah as a wife. This demonstrates the special nature of Achsah, and her eventual husband, Othniel (Caleb's younger brother), rises to the challenge, marrying her after conquering Kirjathsepher. The unconventional marriage aligns with the customs of the time and is not explicitly forbidden by the Mosaic law.\nAchsah, symbolizing the church of Jesus Christ, later prompts her husband to ask her father for a field. This reflects the church's role in encouraging believers to seek blessings and guidance from their heavenly Father. Achsah's boldness in asking for a piece of land is likened to believers seeking a new body through baptism in Jesus' name. The metaphor extends to the necessity of constant spiritual nourishment, akin to water for a piece of land, emphasizing the importance of being filled with the Holy Spirit.\nThe sermon then delves into the story of Caleb in Joshua 14, highlighting his enduring passion for the blessings of God. Caleb, at 85 years old, boldly asks Joshua for the mountain promised to him by Moses years earlier. His request is granted, showcasing his unwavering faith and zeal for God's promises.\nAchsah's subsequent request to Caleb for a blessing is linked to believers seeking the blessing of God in their lives. The importance of gratitude is emphasized, urging believers to thank God for past blessings. Achsah's specific request for springs of water represents believers asking for a continuous flow of the Holy Spirit from above and below, drawing parallels with the well-watered land of Canaan described in Deuteronomy.\nIn summary, the sermon encourages believers to boldly approach God, seek His blessings, express gratitude for past favors, and ask for a continuous flow of the Holy Spirit. The narrative of Achsah and Caleb serves as a metaphor for the relationship between believers and their heavenly Father, emphasizing faith, boldness, and the continuous pursuit of spiritual nourishment.\n",
      "pdfLink": "/sermons/GIVE_ME_ALSO_SPRINGS_OF_WATER_THE_REQUEST_OF_ACHSAH.pdf",
      "image": "/sermons/GIVE_ME_ALSO_SPRINGS_OF_WATER_THE_REQUEST_OF_ACHSAH.jpg",
      "imgRef": "https://unsplash.com/photos/waterfalls-in-the-middle-of-green-trees-during-daytime-sZzC9zilHmQ",
      "pages": "3"
    },
    {
      "title": "The Crowns of Victory a Christian's Eternal Reward",
      "summary": "This sermon explores the profound significance of crowns in the Scriptures, beginning with an examination of five Hebrew words for crown in the Old Testament: Qodhqodh, Zer, Nezer, Atarah, and Kether. Each word reveals layers of meaning, symbolizing honor, authority, dedication, victory, and regal majesty. The exploration emphasizes that crowns in the Old Testament represent not only positions of authority but also symbols of consecration, victory, and regal honor.\n\nTransitioning to the New Testament, the sermon delves into the promises of the five crowns awaiting faithful Christians. The Greek term \"Stephanos,\" akin to the wreaths awarded in ancient competitions, is described as representing victory and triumph. The five crowns—Soul Winners Crown, Crown of Self-Denial, Crown of Righteousness, Crown of Life, and Crown of the Under Shepherd—each hold a unique promise, reflecting aspects of service, discipline, righteousness, endurance, and shepherding.\n\nThe Soul Winners Crown, mentioned in 1 Thessalonians 2:19, is portrayed as a source of hope, joy, and rejoicing, symbolizing the victory of bringing souls into the presence of the Lord at His coming. The Crown of Self-Denial, found in 1 Corinthians 9:25, is associated with mastery and victory, emphasizing the incorruptible reward for practicing self-discipline for the sake of Christ.\n\nThe Crown of Righteousness, as per 2 Timothy 4:8, symbolizes the wreath of victory worn by those excelling in righteousness, promising eternal honor from the righteous Judge to those eagerly awaiting His return. The Crown of Life, described in James 1:12, represents triumph over trials and challenges, a testament to the endurance and faithfulness of believers in the face of life's hardships.\n\nFinally, the Crown of the Under Shepherd, mentioned in 1 Peter 5:4, symbolizes the crown of glory that awaits faithful shepherds in God's flock. As believers serve under the chief Shepherd, Jesus Christ, they are promised a crown that does not fade away, signifying eternal honor and glory.\n\nThe sermon concludes with a call to strive for these imperishable crowns with hearts full of love, service, endurance, and faithfulness, understanding that they are the eternal rewards from the chief Shepherd, Jesus Christ.",
      "pdfLink": "/sermons/THE_CROWNS_OF_VICTORY_A_CHRISTIANS_ETERNAL_REWARD.pdf",
      "image": "/sermons/THE_CROWNS_OF_VICTORY_A_CHRISTIANS_ETERNAL_REWARD.png",
      "imgRef": "https://unsplash.com/photos/a-gold-crown-with-black-and-white-stones--6nDec_KT7U",
      "pages": "4"
    },
    {
      "title": "Thy Faith has Made Thee Whole",
      "summary": "The sermon underscores the paramount importance of faith in the Christian journey. Starting with a biblical definition from Hebrews 11:1, faith is described not just as hope in God's promises but as a deep confidence that those promises will come to fruition. The sermon emphasizes that faith is a living and walking reality among believers, citing examples of biblical figures like Noah, Abraham, Moses, Elijah, and the apostles as exemplars of faith.\nThe narrative delves into the story of the woman with the blood issue, highlighting the potential consequences of misdirected faith, as she suffered for twelve years relying on physicians. The sermon cautions against placing hope where it may not yield positive results, emphasizing that faith in the name and power of Jesus Christ brings wholeness.\nThe story of blind Bartimaeus is presented as an illustration of remarkable faith, which not only recognizes the opportune time for healing but also has the power to bring the feet of Jesus to a complete stop. The credit for healing is given to the faith of individuals like Bartimaeus and the woman with the blood issue, emphasizing the integral role of faith in activating God's power.\nThe sermon extends to examples of faith exercised on behalf of others, such as the Roman centurion's plea for the healing of his servant and the Syrophoenician woman's faith on behalf of her daughter. These instances underscore the significance of compassion and concern for the less fortunate, demonstrating that great faith exercised on behalf of the poor and lowly brings praise from the Lord.\nThe conclusion of the sermon encourages believers to not only nurture faith for personal well-being but also to extend it to others, making a positive impact on the lives of those less fortunate. The title, \"Thy faith has made thee whole,\" is echoed in the call to practice \"Thy faith has made others whole,\" emphasizing the transformative and communal nature of faith.\n",
      "pdfLink": "/sermons/THY_FAITH_HAS_MADE_THEE_WHOLE.pdf",
      "image": "/sermons/THY_FAITH_HAS_MADE_THEE_WHOLE.jpeg",
      "imgRef": "https://dailyverses.net/images/en/kjv/mark-10-52-2.jpg",
      "pages": "3"
    },
    {
      "title": "You are the Temple of God",
      "summary": "The sermon delves into the analogy of the wilderness in the days of Moses, drawing parallels to the Christian journey. The thirst experienced by the children of Israel for water in the wilderness becomes a metaphor for the Christian's thirst for the Holy Spirit. The key point is that just as water was the first and most acute need in the wilderness, seeking the Spirit of the Lord Jesus should be the primary concern for a Christian.\n\nThe biblical narrative from Numbers 20 is used to highlight the importance of persistently seeking the Holy Spirit. The children of Israel, faced with a lack of water, demanded it from Moses. The analogy suggests that Christians should pester the Lord with prayers and requests for the infilling of the Holy Spirit, acknowledging God's good intentions in providing this spiritual water.\n\nThe sermon also emphasizes the significance of the body as the temple of God, using the Corinthian Christians as an example. The Corinthians are criticized for living carelessly and not discerning the Lord's body, leading to some of them facing consequences. This leads to a discussion about the doctrine of the body as the temple of God, where God desires to dwell in His people.\n\nThe idea of the tabernacle in the wilderness is explored, emphasizing that God's original plan was for the tabernacle to be mobile. Christians are encouraged to be flexible and mobile, constantly progressing towards the heavenly destination. The analogy extends to the tabernacle being visible and constantly on the move, symbolizing Spirit-filled Christians being visible for both believers and the lost world.\n\nThe sermon concludes with the anticipation of entering the heavenly Canaan, drawing parallels to the journey of the children of Israel. The promise of pouring out the Spirit in the last days, as mentioned in Joel 2:28-29, is highlighted, suggesting that the time of the catching away of the Bride is imminent.",
      "pdfLink": "/sermons/YOU_ARE_THE_TEMPLE_OF_GOD.pdf",
      "image": "/sermons/YOU_ARE_THE_TEMPLE_OF_GOD.jpg",
      "imgRef": "https://faithtabct.org/wp-content/uploads/2017/02/spiritual-health-headerW-640x301.jpg",
      "pages": "4"
    },
    {
      "title": "Isaac – Perfect Trust in the Will of God",
      "summary": "The sermon reflects on the life of Isaac, focusing on his exemplary trust in the will of God. Isaac's birth, name, and existence were all preordained by God, echoing the predestination of believers in Christ. Isaac remained calm even in the face of mockery and strife, mirroring his trust in God's plan. His peaceful acceptance of his father Abraham's decision regarding his marriage demonstrated his unwavering trust in God's will. Despite challenges, Isaac's reliance on God never wavered. He peacefully resolved disputes and trusted in God's provision, as seen in the well-digging incidents.\n\nThe sermon culminates in the poignant story of Isaac's sacrifice on Mount Moriah, mirroring Christ's submission to God's will in Gethsemane. Isaac's complete surrender and acceptance of being bound for sacrifice stand as a powerful example of submission to God's plan. This profound obedience resonates with Jesus' prayer in Gethsemane, showcasing Isaac as a worthy precursor to the ultimate act of submission displayed by Jesus. The sermon highlights Isaac's life as a testament to perfect trust in God's will, inspiring listeners to emulate his faith and reliance on the divine plan.",
      "pdfLink": "/sermons/ISAAC__PERFECT_TRUST_IN_THE_WILL_OF_GOD.pdf",
      "image": "/sermons/ISAAC__PERFECT_TRUST_IN_THE_WILL_OF_GOD.jpg",
      "pages": "4"
    },
    {
      "title": "The Blessed Hope: Unveiling the Rapture in Scripture",
      "summary": "Welcome, dear friends, to our Bible study on the fascinating and often debated topic of\nthe Rapture, an event filled with mystery and promise. In this study, we will explore\nthe biblical foundation of the Rapture, drawing upon various scriptures, including the\ncatching away of the bride, the global nature of the event, its distinction from the\nSecond Advent, and the details of the Rapture itself.",
      "pdfLink": "/sermons/THE_BLESSED_HOPE_UNVEILING_THE_RAPTURE_IN_SCRIPTURE.pdf",
      "image": "/sermons/THE_BLESSED_HOPE_UNVEILING_THE_RAPTURE_IN_SCRIPTURE.jpg",
      "imageRef": "https://t3.ftcdn.net/jpg/00/14/64/64/360_F_14646443_L4bwJR0VptCXHA0wM0s40r6bQJ3uuBd5.jpg",
      "pages": "2"
    },
    {
      "title": "No Room in the Manger",
      "summary": "The sermon explores the profound message behind Luke 2:7, where Jesus is born in a humble manger due to the lack of room in the inn. This humble beginning holds deep symbolism, conveying essential aspects of Jesus' mission and identity.\n\nFirstly, it signifies Jesus' identification with the lowest of the low in the world, showcasing his understanding of human pain and isolation. The fact that there was no room for him in the inn echoes Isaiah 53:3, emphasizing his empathy for those who feel unwelcome and alone.\n\nSecondly, the manger represents God's deliberate choice to embrace poverty. By becoming poor, Jesus demolished the barriers that often accompany wealth, making it possible for anyone, regardless of their financial status, to approach Him. This act of becoming poor for humanity’s sake aligns with 2 Corinthians 8:9, highlighting God's solidarity with the impoverished.\n\nAdditionally, the manger illustrates Jesus as the bread of life, feeding spiritual hunger. Just as the manger was a feeding trough for animals, Jesus provides the life-giving sustenance for human souls. Without recognizing their need for this spiritual nourishment, people face spiritual hunger and death, emphasizing the urgency of approaching Jesus.\n\nIn essence, the manger challenges societal norms. It invites everyone to approach Jesus not in opulence, but in shared humility and need. By choosing a manger over a grand setting, Jesus opens his arms to all, emphasizing that no one is beyond the reach of his love and salvation. The message encourages listeners to approach Jesus with humility, recognizing their need for his life-giving provision and understanding that he empathetically understands their pain and isolation.",
      "pdfLink": "/sermons/NO_ROOM_IN_THE_MANGER.pdf",
      "image": "/sermons/NO_ROOM_IN_THE_MANGER.jpg",
      "imageRef": "https://unsplash.com/photos/the-nativity-figurines-ZiCz-oW1LXA",
      "pages": "3"
    },
    {
      "title": "The Glory of the Father is the Same as the Glory of the Son",
      "summary": "In this sermon on John 17:5, delves deeply into the prayer of Jesus where He asks the Father to glorify Him with the same glory that he had with him before the world’s creation. The sermon challenges mainstream interpretations, asserting that Jesus and the Father are not two distinct individuals but one God in two roles — the Father and the Son.\n\nThe preacher emphasizes that Jesus is not addressing the Father as a separate entity. These are not two distinct individuals communicating with one another from within two consciousnesses, but One God who plays two roles in one body – the role of the Father and the role of the Son. The core argument revolves around the Father’s ultimate glory being demonstrated through power over death and eternal life. By raising Himself from the dead after three days, Jesus showcased the Father’s unparalleled glory, proving that he is the Father and hence possesses the glory of the Father.\n\nThe sermon connects this profound truth to the metaphorical connection between the Jerusalem Temple and Jesus’ body. When Jesus referred to the Temple as “my Father's house,” He was essentially speaking of His own body. This connection highlights the zeal of the Father for His Temple, His flesh and blood. This sermon emphasizes the need to honor Jesus as both the Son and the Father, urging listeners to approach this truth with reverence, trembling, and love.\n\nUltimately, the sermon provides a fresh perspective on John 17:5, urging believers to recognize and accept Jesus as the Father Himself. This understanding challenges common interpretations and highlights the divine unity of the Father and the Son, emphasizing the importance of honoring Jesus in this profound revelation.\n",
      "pdfLink": "/sermons/THE_GLORY_OF_THE_FATHER_IS_THE_SAME_AS_THE_GLORY_OF_THE_SON.pdf",
      "image": "/sermons/THE_GLORY_OF_THE_FATHER_IS_THE_SAME_AS_THE_GLORY_OF_THE_SON.png",
      "pages": "4"
    },
    {
      "title": "A Way of Escape",
      "summary": "The sermon focuses on 1 Corinthians 10:13 and delves into the distinction between trials and evil in the context of God's faithfulness to provide a way of escape for His people.\n\nThe Greek word for temptation, peirasmos, encompasses various meanings, including trials, temptation to sin, and afflictions. The sermon emphasizes that trials are common to humanity, and every person, as a part of the human experience, will face trials. The distinction between trials and evil is crucial; trials are challenges that God allows for various reasons, whereas evil is destructive and has no good associated with it.\n\nThe sermon offers biblical examples to illustrate the concept of divine escapes. The story of Joseph in Egypt portrays how God provided an escape through favor, enabling Joseph to bear the trials of slavery. The sermon emphasizes the need for individuals to actively look for opportunities or avenues (symbolized by \"Potiphars\") during trials, rather than dwelling on the problems.\n\nThe story of Job illustrates that sometimes God's escape may come in the form of discussions and challenges from friends. Despite the disagreements, these interactions keep individuals engaged and occupied, making the trials more bearable. The narrative of Apostle Paul's journey to Rome demonstrates how God used a storm and subsequent shipwreck as an escape, leading Paul to Malta, where he could preach the Gospel and save souls.\n\nThe sermon encourages listeners to recognize that trials are not without purpose. God, in His faithfulness, provides escapes even in the midst of trials. The key lies in actively seeking and recognizing these divine exits, which might come in unexpected forms, enabling believers to bear their trials and fulfill their missions, just as Paul did in Malta. The message reinforces the faithfulness of God in providing ways of escape tailored to each individual's circumstances.",
      "pdfLink": "/sermons/A_WAY_OF_ESCAPE.pdf",
      "image": "/sermons/A_WAY_OF_ESCAPE.jpg",
      "imgRef": "https://unsplash.com/photos/a1-7u30CJpw",
      "pages": "4"
    },
    {
      "title": "The Mount of Olives: Where Christ Ascended and Will Return",
      "summary": "The sermon delves into the significance of the Mount of Olives in biblical context, drawing lessons for spiritual understanding. The Mount of Olives is portrayed as a symbol of anointing, representing the spiritual sustenance of God's people.\n\nThe sermon explores various instances in the Bible where the Mount of Olives is associated with crucial events. It begins with Jesus teaching in the temple during the day and residing at Mount of Olives at night, highlighting its special importance. Reference is made to Zechariah's prophecy, connecting the mount with anointing and the Lord's return.\n\nIn Matthew 24, the chapter about the signs of Christ's return, Jesus sits on the Mount of Olives, signifying the need for believers to be under His anointing to discern the signs accurately. The anointing from the mount protects against worldly deceptions, as seen in the case of King Herod's grand Temple project.\n\nFurthermore, the Mount of Olives is linked to the fulfillment of prophecies. Jesus instructs his disciples from there, fulfilling Zechariah's prophecy about the Messiah's arrival, demonstrating its significance in the revelation of the Messiah's coming.\n\nWhen Jesus ascends to heaven, the Mount of Olives becomes the departure point, underlining the importance of carrying the anointing (represented by oil) until His return. This anointing, symbolized as oil, signifies the Holy Spirit's presence and is crucial for believers, as highlighted in the parable of the ten virgins. The Mount of Olives becomes the bridge between heaven and earth, emphasizing that believers will leave the world with the anointing of the Holy Spirit and return with Jesus, demonstrating the eternal significance of spiritual anointing.\n\nThe sermon concludes by emphasizing the power of the Holy Spirit, depicted as anointing oil, which quickens mortal bodies and ensures spiritual preparedness for Christ's return, emphasizing the intimate connection between the Mount of Olives, anointing, and the return of Jesus.",
      "pdfLink": "/sermons/THE_MOUNT_OF_OLIVES.pdf",
      "image": "/sermons/THE_MOUNT_OF_OLIVES.jpeg",
      "imgRef": "https://assetsnffrgf-a.akamaihd.net/assets/m/2022322/univ/art/2022322_univ_cnt_1_xl.jpg",
      "pages": "3"
    },
    {
      "title": "Jonah - a Reminder of Our Responsibility to the Unsaved World",
      "summary": "The sermon delves into the story of the prophet Jonah and its relevance to the duties of modern Christians. Jonah, a prophet, was tasked with hearing God's word and conveying it to others. Likewise, Christians bear the responsibility of sharing the message of salvation.\n\nJonah's attempt to escape God's command by fleeing to Tarshish is likened to modern Christians trying to avoid their duty to reach the unsaved. Jonah's belief that he could elude God's presence is criticized, emphasizing that there is no place beyond God's reach.\n\nThe narrative of Jonah's journey on the ship reveals how his behavior led the Gentiles aboard to question his faith. This prompts reflection on how the unsaved world perceives Christians based on their actions and whether they are truly being a light to the world.\n\nWhen a storm threatens the ship, Jonah's behavior forces the Gentiles to wake him up and pray, highlighting the unsaved world's expectation that Christians should call upon their God. This underscores the need for Christians to be vigilant and active in their faith, especially when surrounded by an unsaved world.\n\nFinally, the sermon discusses God's mercy in providing a great fish to save Jonah, even in his rebellion. This is used as a metaphor to illustrate how God offers opportunities for Christians to fulfill their responsibilities in reaching the unsaved. The sermon concludes with an impassioned call for Christians not to delay in preaching the Gospel, as every day of procrastination may endanger the souls of the unsaved.\n\nIn essence, the sermon uses Jonah's story to challenge Christians to take their responsibility of reaching the unsaved seriously, urging them not to evade this duty, but to actively share the message of salvation.",
      "pdfLink": "/sermons/JONAH__A_REMINDER_OF_OUR_RESPONSIBILITY_TO_THE_UNSAVED_WORLD.pdf",
      "image": "/sermons/JONAH__A_REMINDER_OF_OUR_RESPONSIBILITY_TO_THE_UNSAVED_WORLD.jpg",
      "imgRef": "https://unsplash.com/photos/_R1cc2IHk70",
      "pages": "3"
    },
    {
      "title": "Healing in the Synagogue",
      "summary": "The sermon centers on the story of a man with a withered hand who attends the synagogue. Despite his physical disability, this man remains faithful in attending the house of God, demonstrating unwavering dedication. His commitment serves as both an inspiration and a rebuke to others who enjoy good health but may neglect their attendance and worship.\n\nThe sermon emphasizes that when individuals are unashamed in their faith and worship, God takes notice and rewards their devotion. Just as David showed kindness to Mephibosheth for Jonathan's sake, God values those who are faithful, even if the world perceives them as insignificant.\n\nThe focal point of the narrative is the encounter between this man and Jesus. Jesus, impressed by the man's faithfulness, singles him out for healing, despite opposition from the Pharisees who emphasize the Sabbath laws. The man's choice to obey Jesus and stretch forth his withered hand results in its miraculous restoration, highlighting the transformative power of obedience.\n\nThe sermon draws a parallel between physical healing and spiritual rebirth, emphasizing that obeying the commands of Jesus, such as Acts 2:38, can restore spiritual deadness and bring new life. It encourages believers to be unashamed and obedient in their faith, even in the face of opposition, as the enemy always opposes salvation.\n\nIn summary, the sermon underscores the importance of faithfulness, obedience, and unwavering dedication in worship, using the story of the man with the withered hand as an example. It highlights the transformative power of obedience and the need for believers to stretch forth their hands to receive life-changing blessings from God.",
      "pdfLink": "/sermons/HEALING_IN_THE_SYNAGOGUE.pdf",
      "image": "/sermons/HEALING_IN_THE_SYNAGOGUE.jpg",
      "imgRef": "https://unsplash.com/photos/_R1cc2IHk70",
      "pages": "2"
    },
    {
      "title": "Stand Still and see the Salvation of the Lord!",
      "summary": "The sermon focuses on the biblical story of the Israelites' exodus from Egypt, emphasizing the idea of separation from the world and salvation. It begins by highlighting how challenging it can be for those who have been deeply entrenched in worldly ways to separate themselves for the Lord. The number 430 is mentioned, signifying a time of permanent and irrevocable separation, drawing parallels with the Israelites' 430 years in slavery in Egypt and the division of the earth in the days of Peleg.\n\nThe sermon underscores the importance of faith in God's promise of separation and salvation, even when faced with fear and uncertainty. The Red Sea symbolizes a dramatic and frightening moment when individuals are squeezed between their past sinful lives and the path to salvation. However, the message assures that God stands as a barrier between the past and the glorious future, shielding believers from their tormenting past.\n\nThe sermon concludes with an encouragement to stand still and witness the salvation of the Lord. It emphasizes that separation from the world can be painful and turbulent but is essential for understanding the beauty of holiness. Divine intervention is highlighted as the means to break free from the bondage of sin and move towards the Promised Land, with the hope that the path back to a sinful past will be permanently closed. Ultimately, the message encourages believers to rise again, even after falling into sin, and trust in the salvation of the Lord.",
      "pdfLink": "/sermons/STAND_STILL_AND_SEE_THE_SALVATION_OF_THE_LORD.pdf",
      "image": "/sermons/STAND_STILL_AND_SEE_THE_SALVATION_OF_THE_LORD.jpg",
      "imgRef": "https://unsplash.com/photos/_R1cc2IHk70",
      "pages": "3"
    },
    {
      "title": "Why go to Church?",
      "summary": "This sermon emphasizes the importance of attending church with the right internal motivations and understanding. The sermon begins by highlighting the idea that going to church is not about external factors like tradition or habit. Instead, it's about recognizing that as believers, you are part of God's household. The church is described as a spiritual family, and attending services should come from a deep internal conviction that you belong to this family. The act of going to church is presented as a battle against the flesh. It's not always easy or convenient, but it's a spiritual commitment. This underscores the idea that true faith requires effort and sacrifice. The sermon emphasizes that the church doesn't need to focus on success, entertainment, modernity, inclusivity, or self-justification. Instead, it should be a place where people worship God wholeheartedly and hold on to their faith in Christ. The importance of worshiping God in church is stressed, referring to Psalm 100. It's in this context that believers receive life and spiritual nourishment.  The sermon references John 6 to highlight that attending church and partaking in communion is a source of eternal life. It's a reminder that Christ is central to the church, and it's through Him that believers find life and sustenance. The sermon concludes by summarizing that the church needs Jesus Christ, faithful believers who hold onto their faith, and believers need to be with Christ. It also includes a call to \"fight the good fight\" and lean on Christ's strength and love.\n\nIn essence, the sermon emphasizes that going to church should be driven by a deep understanding of one's place in God's family and a commitment to worship and spiritual growth, rather than external factors or trends.",
      "pdfLink": "/sermons/WHY_GO_TO_CHURCH.pdf",
      "image": "/sermons/WHY_GO_TO_CHURCH.png",
      "imgRef": "https://unsplash.com/photos/_R1cc2IHk70",
      "pages": "13"
    },
    {
      "title": "Give the Empty Room to Jesus: A Lesson in Hospitality and Faith",
      "summary": "This message draws inspiration from the biblical accounts of two remarkable individuals: the Shunammite woman and the unnamed host who prepared a guest chamber for the Lord. These stories illustrate the importance of faith, hospitality, and devotion to God.\n\nThe Shunammite woman, described as \"great,\" despite her childlessness, made a choice that set her apart. Instead of dwelling on her misfortune, she chose to focus on what truly mattered: her love for God. She was determined to prepare an empty room in her house for the prophet Elisha, a man of God who frequently passed by. Her act of faith demonstrates the principle of seeking first the kingdom of God.\n\nThe metaphor of an \"empty room\" is extended to our own lives. It represents unmet needs, struggles, and challenges that we face. The message encourages us to give these empty rooms to Jesus. In other words, we are called to trust God with our problems and unfulfilled desires.\n\nThe story of the unnamed man who prepared a guest chamber for Jesus during the Passover is another powerful example of hospitality and faith. This man's actions symbolize our willingness to make room for Jesus in our lives. He recognized the significance of Jesus and offered his space for the Passover meal.\n\nThe message emphasizes that when we give our \"empty rooms\" to Jesus, we invite Him to fill those spaces with blessings, just as the Shunammite woman's empty room was eventually filled with the laughter of a child. It encourages us to trust God even when faced with challenges, knowing that He will meet our needs in His perfect timing.\n\nThe unnamed host's guest chamber for Jesus becomes a symbol of God's divine presence. It was in this room that Jesus shared the life-giving symbolism of His body and blood, and it was where the Holy Spirit was poured out. The lesson here is that when we prepare room for God in our lives, He blesses us in ways beyond our imagination.\n\nUltimately, the message encourages us to embrace the act of hospitality, faith, and trust in God. Just as Hannah dedicated her child Samuel to God and the Shunammite woman prepared a room for Elisha, we are invited to give our empty rooms to Jesus, trusting that He will fill them with His presence and blessings.",
      "pdfLink": "/sermons/GIVE_THE_EMPTY_ROOM_TO_JESUS_A_LESSON_IN_HOSPITALITY_AND_FAITH.pdf",
      "image": "/sermons/GIVE_THE_EMPTY_ROOM_TO_JESUS_A_LESSON_IN_HOSPITALITY_AND_FAITH.jpg",
      "imgRef": "https://unsplash.com/photos/AvqpdLRjABs",
      "pages": "3"
    },
    {
      "title": "The Church in Babylon: Refusing to Bow",
      "summary": "The story of Mordecai in the biblical book of Esther is used as a metaphor to illustrate the Church's position in a worldly and hostile environment, symbolized by Babylon. Like Mordecai in Persia, the Church must stand firm and not bow down to the pressures of this world.\n\nHaman, an Agagite and an enemy of the Jews, demanded reverence from all. Everyone bowed to him except Mordecai. This refusal stemmed from Mordecai's understanding of God's decree to fight against Amalek, a symbol of sin. The message is clear: the Church must not compromise with sin, as it brings destruction. Paul's dedication to daily dying to sin is cited as an example.\n\nBabylon represents the contemporary world with its idols and sinful allure. Paul's warnings about the last days' idols are referenced, emphasizing the need to turn away from godless influences. The Church, though present in Babylon, must not adopt its values. Mordecai's watchfulness near the palace serves as a metaphor for the Church's role as spiritual guardians and reminders of God's covenant.\n\nEsther's situation, being Jewish in a foreign land, mirrors the Church's predicament. Just as Esther became queen to a pagan king, the Church, though orphaned in Babylon, is favored by Christ. The promise that God would be a \"little sanctuary\" for His people, even in foreign lands, is invoked.\n\nThe return of the Jewish generation to Jerusalem after 70 years of Babylonian captivity parallels the Church's eventual departure from this world. Despite success in Babylon, many Jews chose to return, understanding God's promises. The Church too awaits the day when the promises of Christ come to fruition, just as those who left Babylon were recorded. The metaphor concludes with a reminder of Jesus' prophecy that some will be taken while others are left, signifying the Church's ultimate separation from the world.",
      "pdfLink": "/sermons/THE_CHURCH_IN_BABYLON_REFUSING_TO_BOW.pdf",
      "image": "/sermons/THE_CHURCH_IN_BABYLON_REFUSING_TO_BOW.jpg",
      "imgRef": "https://unsplash.com/photos/Tie8C6Vdhrs",
      "pages": "3"
    },
    {
      "title": "I Will Be to Them a Little Sanctuary",
      "summary": "In Ezekiel 11:16, God assures His people that even in foreign and hostile lands, He will be their sanctuary. The sermon draws parallels to the Tabernacle of Moses, explaining how it represents God's presence and refuge. Despite challenging surroundings, believers are encouraged to seek this \"little sanctuary.\" The story of Daniel's unwavering prayer in Babylon exemplifies this concept.\n\nThe Tabernacle's elements hold spiritual lessons: the golden censer symbolizes prayer's centrality; the Ark of the Covenant reminds of God's promise and global salvation; the golden pot signifies heavenly nourishment; Aaron's rod signifies divine leadership; and the tables of the covenant emphasize God's enduring word. The little sanctuary, like the Tabernacle's Holy Place, must be free from worldly distractions.\n\nPrayer's importance is highlighted, echoing Christ's words that His house is a house of prayer. Just as Israel received God's miraculous provisions, believers can find spiritual nourishment in the little sanctuary. The leadership, exemplified by Aaron's rod, is divinely appointed, and believers are urged to discern genuine spiritual gifts. The word of God, represented by the tables of the covenant, should be central, guiding believers' lives.\n\nThe sermon encourages regular visits to the little sanctuary, shutting out worldly noise. Through prayer, assurance of God's presence, promises, and divine leadership is obtained. The Ark of the Covenant signifies global salvation through Christ. The golden pot assures divine provision, while the tables of the covenant emphasize God's unchanging word. The sanctuary offers a place of spiritual refuge and strength amidst life's challenges.\n",
      "pdfLink": "/sermons/I_WILL_BE_TO_THEM_A_LITTLE_SANCTUARY.pdf",
      "image": "/sermons/I_WILL_BE_TO_THEM_A_LITTLE_SANCTUARY.png",
      "pages": "3"
    },
    {
      "title": "The Tithe of the Lord",
      "summary": "The sermon delves into the principle of tithing, using Malachi 3:10-11 as its foundation. Tithe is defined as 10% of one's earnings or produce and Christians, after accepting Jesus and being saved, are commanded to tithe. Tithing is presented as a recognition of God's ownership and provision for our needs.\n\nThe sermon draws from biblical examples, showing how Abraham and Jacob both offered tithes to God. Abraham's tithe was a response to God's blessing, while Jacob's vow was conditional upon God's provision and protection. It is noted that tithing is the only ordinance where believers are invited to test God, as seen in Malachi 3:10.\n\nThe principle of giving to both God and the state is highlighted using Jesus' words in Mark 12:17. The preacher acknowledges the responsibilities toward the state but emphasizes that Christians must not neglect their duties to God, as demonstrated by tithing.\n\nThe sermon explains that tithing showcases God's authority and His ability to bless and multiply. The preacher links the significance of the number 10 in tithing to the authority established after the tenth plague in Egypt and the Ten Commandments given at Mount Sinai. Through tithing, believers are called to establish God's authority in every aspect of their lives.\n\nThe preacher concludes by addressing the attitude accompanying tithing, emphasizing that God loves a cheerful giver. The example of David's generous offerings is highlighted, showcasing a willingness to give sacrificially. The audience is encouraged to give their tithes and offerings with a joyful heart, following the example of David, who was considered a man after God's heart.",
      "pdfLink": "/sermons/THE_TITHE_OF_THE_LORD.pdf",
      "image": "/sermons/THE_TITHE_OF_THE_LORD.jpg",
      "imgRef": "https://unsplash.com/photos/L7kHt5x_Slc",
      "pages": "3"
    },
    {
      "title": "What Did Jesus Do for you?",
      "summary": "The sermon centers around the story of the blind man healed by Jesus in John 9. Suffering and difficulties are opportunities for God to demonstrate His power and be glorified in our lives. Jesus, as God, has the ability to perform miraculous acts, and through this healing, He reveals His identity as the one true God.\n\nAll humans are born spiritually blind due to sin, and it is only through Jesus that we can receive spiritual sight and salvation. The blind man's testimony of his healing serves as an example of how each individual must speak for themselves about what Jesus has done in their lives.\n\nThe ultimate miracle is the salvation of the soul, and should not be swayed by the opinions of others but to firmly believe in Jesus as the Son of God. The blind man's unwavering faith and worship of Jesus demonstrate his understanding of Jesus' divine nature.\n\nIn conclusion, the sermon encourages the audience to stand firm in their faith, knowing the identity, love, and compassion of Jesus. Each person should declare what Jesus has done for them, acknowledging Him as the one true God and Savior.",
      "pdfLink": "/sermons/WHAT_DID_JESUS_DO_FOR_YOU.pdf",
      "image": "/sermons/WHAT_DID_JESUS_DO_FOR_YOU.jpg",
      "imgRef": "https://stmichaellivermore.com/sites/livermore/files/styles/open_graph/public/uploads/images/man_born_blind.jpg?itok=gE69pPqy",
      "pages": "3"
    },
    {
      "title": "Riding with Christ the Conqueror",
      "summary": "The sermon focuses on Revelation 19:11-14, describing the glorious return of the Lord Jesus Christ riding on a white horse. The preacher emphasizes that the white horse signifies a war for peace and the speed of Jesus' return. The sermon highlights Jesus' faithfulness to His promises and His righteousness as He judges and makes war.\n\nThe sermon also discusses the significance of Jesus' eyes burning with zeal and the many crowns upon His head, signifying His kingship and power. The sermon emphasizes the importance of repentance and baptism in Jesus' name for salvation and being guiltless of His blood.\n\nThe sermon excites the listeners about the future prospect of riding white horses alongside the Lord Jesus during His ultimate conquest. The sermon encourages us to be part of the armies of the Lord and be more than conquerors through Him.\n\nThe sermon concludes with a message of hope and joy, knowing the true story of the end of the world and the glorious future that awaits believers. All praises to the Lord Jesus for His victorious return and calls for rejoicing in anticipation of that day.",
      "pdfLink": "/sermons/RIDING_WITH_CHRIST_THE_CONQUEROR.pdf",
      "image": "/sermons/RIDING_WITH_CHRIST_THE_CONQUEROR.jpg",
      "imgRef": "https://unsplash.com/photos/3CA_-xcpulY",
      "pages": "3"
    },
    {
      "title": "The Still, Small Voice",
      "summary": "The sermon is based on the story of Elijah in 1 Kings 19:11-13. Elijah's ministry was marked by spectacular demonstrations of God's power, such as calling fire from heaven and shutting up the heavens with his prayers. However, after a great victory on Mount Carmel, Elijah faced a crisis when Queen Jezebel threatened his life. He fled to Mount Horeb, seeking God's guidance and reassurance. God spoke to Elijah in a still, small voice, not in the wind, earthquake, or fire.\n\nThe sermon highlights that Elijah's ministry relied too heavily on the spectacular displays of power, and God used the crisis to teach him an important lesson. While God may at times perform miracles, He desires humans to be persuaded by His Spirit and Word. The sermon draws parallels with the multitudes who followed Jesus for His miracles and provision of food but abandoned Him when He spoke of deeper spiritual truths.\n\nGod was in His still, small voice, which brought restoration and edification to Elijah. The sermon emphasizes the importance of seeking God in His Word and listening to His still, small voice. The voice of God can heal, restore, and empower, and we should rely on His Word to persuade souls rather than relying on spectacular acts.\n\nThe sermon concludes by highlighting how God's voice asked probing questions about Elijah's own conduct and corrected and comforted him. It encourages listeners to separate themselves from the crowds, come to Jesus alone, and wait to hear His still, small voice. The sermon calls for a reliance on the voice of God and persuading others through His Word, rather than relying on the spectacular.",
      "pdfLink": "/sermons/THE_STILL_SMALL_VOICE.pdf",
      "image": "/sermons/THE_STILL_SMALL_VOICE.jpg",
      "imgRef": "https://unsplash.com/photos/3CA_-xcpulY",
      "pages": "3"
    },
    {
      "title": "The Mountains and Valleys of Life",
      "summary": "This sermon discusses the significance of mountains and valleys in the Christian journey and relates them to the life of Christ and biblical figures like Moses and Paul. It emphasizes the importance of experiencing both highs and lows in order to grow spiritually and trust in God. Living a comfortable and stable life leads to complacency and sin, while facing challenges and difficulties strengthens one's faith. The mountains represent moments of glory, vision, and spiritual growth, while the valleys symbolize the presence of Christ in the midst of struggles, sins, and hardships. God allows valleys in our lives to teach us, help us trust in Him, and grow in wisdom and reconciliation through the blood of Jesus. This sermon also highlights the need to stay connected to Christ and rely on Him in all circumstances. It encourages communication with God, keeping the focus on the heavenly promise, enduring with the power Christ provides, finding encouragement in the positive effects of valleys, and practicing patience. Ultimately, it emphasizes that Christ is the constant factor in our lives, the stable foundation on which we can rely. The passage concludes by expressing the belief that one day mountains and valleys will disappear, and all will be united in the new Jerusalem.",
      "pdfLink": "/sermons/THE_MOUNTAINS_AND_VALLEYS_OF_LIFE.pdf",
      "image": "/sermons/THE_MOUNTAINS_AND_VALLEYS_OF_LIFE.jpg",
      "imgRef": "https://unsplash.com/photos/bMOCvYdut7g",
      "pages": "14"
    },
    {
      "title": "The Divided Garments of Jesus",
      "subtitle": "The Outer and Inner Garments of the Lord",
      "summary": "In this sermon, the focus is on the Roman soldiers dividing the garments of Jesus after His crucifixion. The preacher interprets this event symbolically, highlighting several key points.\n\nFirstly, the sermon emphasizes that Jesus had no earthly possessions except for the clothes He wore. The Roman soldiers represent the Gentiles, indicating that the Gospel was of great interest to them, unlike the Jews who rejected Jesus. The division of the garments into four parts represents the universality of the Gospel, signifying its message reaching all corners of the world.\n\nThe sermon also draws a connection to prophecies about Jesus' garments being divided among the soldiers and the Psalm that foretells this event. This highlights the idea that the Gospel is for those who understand its value and are willing to fight for it. It encourages believers to demonstrate zeal and determination, like Elisha, who desired to inherit Elijah's mantle. By inheriting Jesus' garments, it refers to receiving His anointing and favor to evangelize the world.\n\nMoreover, the sermon compares the disciplined and determined Roman soldiers to the soldiers of Jesus' Kingdom. It stresses the importance of believers being disciplined, trained, and determined to spread the Gospel to the ends of the earth under the anointing of the Holy Spirit. The mention of Paul's handkerchiefs in Acts further emphasizes the power and impact that can come from items associated with anointed individuals.\n\nFinally, the sermon highlights the significance of the soldiers not tearing Jesus' seamless coat, representing the inner vesture. This garment symbolizes the need to enter the presence of Jesus, the High Priest, who cleanses and ministers to the needs of our souls. It emphasizes the Christian life as a continuous cycle between going out into the world to make disciples and returning to Jesus for spiritual nourishment.\n\nThe sermon concludes by urging believers, now in possession of Jesus' garments (anointing and priesthood), to march forward as Christian soldiers, conquering the world for Jesus. It encourages them to fulfill the Great Commission and utilize the power of Jesus to impact lives and bring others to Him.",
      "pdfLink": "/sermons/THE_DIVIDED_GARMENTS_OF_JESUS.pdf",
      "image": "/sermons/THE_DIVIDED_GARMENTS_OF_JESUS.jpg",
      "imgRef": "https://unsplash.com/photos/6gSyEKq4Pvg",
      "pages": "3"
    },
    {
      "title": "Cleaving to Naomi",
      "summary": "The sermon is centered around the story of Ruth and Naomi from the book of Ruth. Naomi is a symbol of the Great Commission given by Jesus in Matthew 28:19-20, where believers are commanded to go and teach all nations. It is important to recognize the value of the Gospel and cleave to it, just as Ruth recognized the worth of Naomi and refused to let go. Ruth was committed to Naomi, so much so that she made a declaration to stay with her and follow her wherever she goes, even to the extent of adopting Naomi's people and God as her own. There is a parallel between Ruth's commitment and the disciples' willingness to follow Jesus when He called them. As believers, we need to allow the Gospel to lead and guide them, rather than determining its course ourselves. We must love all people of Jesus, regardless of divisions caused by race, culture, class, politics, or other issues in the world. The sermon also addresses the concept of dying to self and communal/national identity, stating that believers should be willing to give up personal plans and embrace the global mission of spreading the Gospel. It references biblical prophecies about global migration and mingling of different people in the last days, seeing it as a sign of the impending return of Jesus. The core message of the Gospel is presented briefly, stating that there is one God who manifested in a body, died on the cross for the forgiveness of sins, rose again, and poured out the Holy Spirit. The response to this understanding is repentance, baptism in the name of Jesus Christ for the remission of sins, and receiving the gift of the Holy Spirit. The sermon concludes by highlighting Ruth's willingness to die to herself and her identity, which led to blessings for herself and future generations. It encourages listeners to cleave to the Gospel of Jesus Christ and become vessels through which all nations can be blessed.",
      "pdfLink": "/sermons/CLEAVING_TO_NAOMI.pdf",
      "image": "/sermons/CLEAVING_TO_NAOMI.png",
      "imgRef": "https://unsplash.com/photos/GPVHlxJakao",
      "pages": "2"
    },
    {
      "title": "Lessons from the Olive Tree",
      "summary": "The sermon is based on the parable of Jotham from Judges 9:8-15, focusing on the significance of the olive tree as a symbol of humility, faithfulness, and service to God and humanity. The olive tree was chosen by the other trees to be their king but declined because it recognized its purpose in honoring God and serving others through its fatness (abundance) and the oil it produced. The sermon highlights the biblical references and symbolism associated with the olive tree, including its role in the Ark of Noah, the Temple in Israel, and the Garden of Gethsemane. The sermon encourages believers to emulate the olive tree's characteristics of knowing the source of their blessings, remaining faithful, and prioritizing service to God and others over worldly ambitions.",
      "pdfLink": "/sermons/LESSONS_FROM_THE_OLIVE_TREE.pdf",
      "image": "/sermons/LESSONS_FROM_THE_OLIVE_TREE.jpg",
      "imgRef": "https://unsplash.com/photos/4k8OuBDNAW8",
      "pages": "3"
    },
    {
      "title": "Seeking the Lord Like Mary Magdalene",
      "summary": "This sermon focuses on Mary Magdalene's encounter with Jesus after His resurrection. Mary's deep love and devotion to Jesus set her apart from the other disciples. She refused to leave the sepulcher and wept, stooping down to look inside. The sermon suggests that Mary's love for Jesus was profound because she had been forgiven of many sins and delivered from seven evil spirits.\n\nMary's intense seeking led her to see two angels in the tomb. However, instead of being distracted or amazed by the angels, she remained focused on her mission to find Jesus. Mary's love cast out fear, and she was unafraid of the angelic presence. The sermon emphasizes that only Jesus can bring true comfort and wipe away all tears.\n\nInitially, Mary did not recognize Jesus when He appeared before her. She mistook Him for the gardener until Jesus called her by name. Mary's unwavering love and devotion to Jesus allowed her to respond when He called her. The sermon encourages us to remember that Jesus calls each person by name and desires a close relationship with us.\n\nThe sermon concludes by highlighting the significance of Jesus' voice in drawing people closer to Him. Just as He called Peter and Lazarus, Jesus calls individuals today to draw near to Him. The sermon reminds us of the promise of a new name given by the Lord and encourages us to listen to the voice of the Spirit speaking to the churches.",
      "pdfLink": "/sermons/SEEKING_THE_LORD_LIKE_MARY_MAGDALENE.pdf",
      "image": "/sermons/SEEKING_THE_LORD_LIKE_MARY_MAGDALENE.jpg",
      "imgRef": "https://mamabishop.blogspot.com/2019/04/an-empty-tomb.html",
      "pages": "3"
    },
    {
      "title": "If Jesus is the Only God, to Whom Did He Pray?",
      "summary": "This sermon addresses the question \"To whom did Jesus pray, if He is the only God?\". First, the sermon establishes that God is indivisibly and mathematically one, and Israel has always recognized and worshiped one God. In Mark 12:29, Jesus himself affirms that God is one.\n\nNext, the sermon affirms that Jesus is both the Holy Spirit and the Son. In John 14:18, Jesus promises to come back as the Holy Spirit to be with the apostles. 2 Corinthians 3:17 equates the Lord with the Spirit, and Galatians 4:6 calls the Holy Spirit the spirit of the Son. From these scriptures, it is clear that the Spirit received by believers is none other than the Spirit of Jesus Christ.\n\nThe sermon then delves into the need for intercession in prayer. In Romans 8:26-27, the apostle Paul writes how believers struggle to pray as they should and often fail to pray according to God's will. In God's mercy, He intercedes through believers. The sermon emphasizes that God requires sincere and fervent intercession for His will to be accomplished on Earth.\n\nThe sermon proceeds to illustrate the importance of intercession throughout the Bible, citing examples such as Abraham interceding for Sodom and Gomorrah and Ezra's prayerful response to Israel's sins. Only God Himself, who is Jesus, was found worthy to intercede effectively for humanity's salvation. This is supported by Isaiah 53:4-5, which speaks of Jesus bearing humanity's griefs and transgressions.\n\nRegarding Jesus' prayer in the Garden of Gethsemane, the sermon asserts that the cup, agony, and rebellious will being referenced were not Jesus' but humanity's. It emphasizes that Jesus, being sinless and incapable of sinning, couldn't be praying for Himself. The sermon refutes the idea that Jesus prayed to the Father or that His human nature prayed to His divine nature, stating that these explanations do not align with Scripture. Instead, it aligns with Romans 8:26, which states that the Spirit itself makes intercession.\n\nThe sermon concludes by urging Christians to reject confusing man-made doctrines and return to the doctrine of the Apostles. It asserts that the prayers of Jesus were addressed back to Himself, as He alone is God, and any belief otherwise leads to a plurality of Gods. The sermon affirms that God is one and declares that Jesus, as God manifested in the flesh, intercedes for believers. It encourages the listeners to allow Jesus to labor in prayer through them, bringing forth spiritual blessings.",
      "pdfLink": "/sermons/IF_JESUS_IS_THE_ONLY_GOD_TO_WHOM_DID_HE_PRAY.pdf",
      "image": "/sermons/IF_JESUS_IS_THE_ONLY_GOD_TO_WHOM_DID_HE_PRAY.jpg",
      "imgRef": "https://avemariaradio.net/wp-content/uploads/2018/03/agony-in-the-garden-1.jpg",
      "pages": "3"
    },
    {
      "title": "Jesus our Refuge",
      "summary": "The sermon compares the biblical characters of Noah and Lot, emphasizing how Noah's devotion extended to his family and his primary focus was on building the ark, symbolizing his commitment to heavenly duties. In contrast, Lot is portrayed as someone primarily concerned with worldly gains. Noah, despite living in a corrupt and wicked era, is seen as a symbol of righteousness, highlighting that with God, it is possible to maintain holiness even in ungodly places.\n\nThe sermon also draws parallels between Noah's Ark and Jesus Christ. Just as there was only one ark, one door, and one window to save Noah's family from the flood, the preacher asserts that there is only one savior, Jesus, who can protect us from the coming destruction. The ark, despite facing harsh conditions, stayed intact because it was built according to God's word, symbolizing the indestructible nature of faith in Jesus.\n\nMoreover, the preacher highlights the unity among different creatures in the ark, illustrating that entering into Christ creates a transformative effect. The ark's multiple rooms and floors are used metaphorically to emphasize the need for tolerance and love among church members, with God having the power to change our characters. The sermon ultimately emphasizes the importance of seeking refuge in Jesus, who serves as our spiritual ark.",
      "pdfLink": "/sermons/JESUS_OUR_REFUGE.pdf",
      "image": "/sermons/JESUS_OUR_REFUGE.jpg",
      "pages": "3"
    },
    {
      "title": "Good Friends Will Carry you to Jesus",
      "summary": "This sermon emphasizes the importance of good friends who guide us towards Jesus, as seen in Mark 2 when four friends take a paralytic man to Jesus for healing. Friends provide a sense of belonging and support, highlighting the scripture Proverbs 17:17, \"A friend loveth at all times, and a brother is born for adversity\". Friendship in Christianity comes with responsibility. The sermon argues the paralytic man was blessed with four faithful friends who took him to Jesus despite his deteriorating state. It encourages Christians to invest in such friendships. Using the example of Philip, Andrew, and Nathanael, it illustrates how friends can lead each other to Jesus. The friends' determination in overcoming obstacles to take the paralytic man to Jesus is also celebrated. Sin, described as the enemy of good friendship, is believed to be the cause of the man's condition. The sermon asserts that friendship can heal through Jesus. Lastly, it prompts reflection on the health of our own friendships and encourages us to bring them to Jesus for healing.",
      "pdfLink": "/sermons/GOOD_FRIENDS_WILL_CARRY_YOU_TO_JESUS.pdf",
      "image": "/sermons/GOOD_FRIENDS_WILL_CARRY_YOU_TO_JESUS.jpg",
      "pages": "2"
    },
    {
      "title": "David at Ziklag – The End of Fear",
      "summary": "This sermon explores the trials and tribulations of David, as described in the books of Samuel in the Bible, focusing on the theme of fear, faith, and personal redemption. It begins with David's despair and fear of Saul leading him to seek refuge with the Philistines, and the consequences of this decision. David, despite being a giant of faith, experiences a crisis of faith, driven by fear, and seeks refuge in the land of the Philistines. The sermon emphasizes that like David, believers too may experience such crisis and seek refuge in inappropriate places, although knowing it's not the right path. The sermon underscores the negative results of acting out of fear, as David is asked to battle against Israel and his granted city, Ziklag, is destroyed. The term 'Ziklag' is used as a metaphor for a turning point, symbolizing the end of fear. Despite adversity, David finds his faith again and leans on the Lord. The sermon encourages believers to trust in God during their 'Ziklag' moments and not to let fear lead them astray. This sermon advises believers to encourage themselves in the Lord Jesus Christ and not to compromise their faith out of fear.",
      "pdfLink": "/sermons/DAVID_AT_ZIKLAG__THE_END_OF_FEAR.pdf",
      "image": "/sermons/DAVID_AT_ZIKLAG__THE_END_OF_FEAR.jpg",
      "pages": "3"
    },
    {
      "title": "Doctrine of The Church",
      "summary": "“And I say also unto thee, That thou art Peter, and upon this rock I will build my church; and the gates of hell shall not prevail against it.” (Mat 16:18). The word church comes from the Greek ekklēsia and originally meant “a gathering of citizens called out from their homes into some public place, an assembly”, according to James Strong. The Church, in a Christian sense, refers to those whom the Lord calls out of the world and into his Kingdom through the agency of repentance, baptism in Jesus name and the infilling of the Holy Spirit (Acts 2:38). It is important to underscore the fact, as stated in Matthew 16:18, that it is the Lord Jesus who is building the Church – he is the chief architect of this most glorious of kingdoms. God uses humans in various capacities in building his church, but make no mistake, it is the Lord who builds his Church, humans can only be co-laborers with him. “For we are labourers together with God: ye are God's husbandry, ye are God's building” (I Cor 3:9). The Apostle Peter warned the elders of the Church, “Neither as being lords over God's heritage, but being ensamples to the flock” (I Peter 5:3).",
      "pdfLink": "/sermons/DOCTRINE_OF_THE_CHURCH.pdf",
      "image": "/sermons/DOCTRINE_OF_THE_CHURCH.png",
      "pages": "3"
    },
    {
      "title": "Doctrine of Holiness",
      "summary": "“Sanctify yourselves therefore, and be ye holy: for I am the LORD your God.” (Leviticus 20:7) “Because it is written, Be ye holy; for I am holy.” (1Peter 1:16). The Hebrew word for “holy” is qāḏôš. James Strong defines this quality in this manner: “to consecrate, sanctify, prepare, dedicate, be hallowed, be holy, be sanctified, be separate”. The German theologian, Rudolf Otto (1869-1937), used the Latin term mysterium tremendum et fascinans to explain the holy encounter with God. He described this as an overwhelming power which is wholly different and other to this world. When confronted with God’s holiness, a human cowers with a sense of holy awe and terror. Jacob is a case in point. On the way to Haran fearing for his life, he encountered God at Bethel. “And he was afraid, and said, How dreadful is this place! this is none other but the house of God, and this is the gate of heaven” (Gen 28:17). Rudolf Otto went on to state in his book Das Heilige (1917), “It is like nothing human or cosmic; confronted with it, man senses his profound nothingness, feels that he is only a creature, or, in the words in which Abraham addressed the Lord, is ‘but dust and ashes’” (Genesis, 18, 27). To summarize thus far, God is the source of all holiness.",
      "pdfLink": "/sermons/DOCTRINE_OF_HOLINESS.pdf",
      "image": "/sermons/DOCTRINE_OF_HOLINESS.png",
      "pages": "5"
    },
    {
      "title": "Christ our Intercessor",
      "summary": "“My little children, these things write I unto you, that ye sin not. And if any man sin, we have an advocate with the Father, Jesus Christ the righteous.” (1John 2:1). What is the role of an advocate? The Greek word, paraklētos , means “one who pleads another's cause before a judge, a pleader, counsel for defense, legal assistant, an advocate”, according to James Strong. One needs an advocate because an advocate is trained in the language and custom of the law. We have all been summoned before the heavenly court of Christ’s judgement seat. “For we must all appear before the judgment seat of Christ; that every one may receive the things done in his body, according to that he hath done, whether it be good or bad” (2 Cor 5:10). The Lord Jesus offers himself to us as our advocate. It would be downright foolish to reject this gracious offer. In his novel, The Trial, Franz Kafka (1883- 1924), wrote about a man who was accused of crimes he had no knowledge of and was summoned to a court were the charges were not read out to him. Be assured that everyone will have perfect knowledge of their sins when they appear before the righteous Judge of all the earth.",
      "pdfLink": "/sermons/CHRIST_OUR_INTERCESSOR.pdf",
      "image": "/sermons/CHRIST_OUR_INTERCESSOR.jpg",
      "pages": "3"
    },
    {
      "title": "Doctrine of the Holy Spirit",
      "summary": "“God is a Spirit: and they that worship him must worship him in spirit and in truth” (John 4:24). God is a Spirit, the Lord Jesus stated. This is how we should conceive of God in his original essence. The Spirit of God is everywhere – omnipresent. David famously declared, “Whither shall I go from thy spirit? or whither shall I flee from thy presence? If I ascend up into heaven, thou art there: if I make my bed in hell, behold, thou art there” (Psalm 139:7,8). Furthermore, the Spirit of God is also all-powerful, omnipotent. The Spirit of God moved on the face of the waters during the creation week (Gen 1:2). God’s Spirit also resurrected the long-dead army of Israel in the Valley of dry bones in the vision of Ezekiel. Not least, the Spirit of God inspired the prophets to prophesy. Ezekiel 11:5 And the Spirit of the LORD fell upon me, and said unto me, Speak; Thus saith the LORD; Thus have ye said, O house of Israel: for I know the things that come into your mind, every one of them.",
      "pdfLink": "/sermons/DOCTRINE_OF_THE_HOLY_SPIRIT.pdf",
      "image": "/sermons/DOCTRINE_OF_THE_HOLY_SPIRIT.png",
      "pages": "5"
    },
    {
      "title": "Doctrine of the Origin of the Body of the Lord Jesus",
      "summary": "“There are also celestial bodies, and bodies terrestrial: but the glory of the celestial is one, and the glory of the terrestrial is another.” (1 Corinthians 15:40). The word “celestial” is from the Greek epouranios which means “of heavenly origin or nature”. The Apostle Paul was building his argument to make a distinction between terrestrial or earthly (Greek epigeios) bodies and heavenly bodies. Finally, the argument climaxes with the revelation, “The first man is of the earth, earthy: the second man is the Lord from heaven” (I Corinthians 15:47). Adam’s body was of the earth, while the Lord Jesus’ body was from heaven. In fact, contrary to what many Christians believe, nowhere does the Lord claim to be of adamic descent. He plainly denied any relation to this world. “And he said unto them, Ye are from beneath; I am from above: ye are of this world; I am not of this world” (John 8:23). Christ is really the holy Son of God. This fact is clearly established when we read, “the word became flesh”. No man can prove the biological relationship of Christ with Mary’s flesh and blood (Teklemariam, 1999, p. 123).1",
      "pdfLink": "/sermons/DOCTRINE_OF_THE_ORIGIN_OF_THE_BODY_OF_THE_LORD_JESUS.pdf",
      "image": "/sermons/DOCTRINE_OF_THE_ORIGIN_OF_THE_BODY_OF_THE_LORD_JESUS.png",
      "pages": "4"
    },
    {
      "title": "Doctrine of Baptism in Jesus Name",
      "summary": "“And the LORD God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul” (Gen 2:7). Through sin, the human body and soul/spirit were cursed. Any message of salvation hence must account for the salvation of the body and the spirit. Baptism is about the first part: the body. Baptism means to “submerge”, or “bury”. What is being submerged or buried? The answer is the human body inherited from Adam. “For as in Adam all die, even so in Christ shall all be made alive” (I Cor 15:22). Just as the children of Israel could not enter the Land of Canaan with their foreskins intact (Joshua 5:2-9), no one can enter the Kingdom of heaven with the body of Adam intact. “Now this I say, brethren, that flesh and blood cannot inherit the kingdom of God; neither doth corruption inherit incorruption” (I Cor 15:50). The covenant of circumcision foreshadows the New Testament command to be baptized in Jesus name. ",
      "pdfLink": "/sermons/DOCTRINE_OF_BAPTISM_IN_JESUS_NAME.pdf",
      "image": "/sermons/DOCTRINE_OF_BAPTISM_IN_JESUS_NAME.png",
      "pages": "6"
    },
    {
      "title": "Doctrine of the One God",
      "summary": "God is one. This is the greatest doctrine of the entire Bible. “Hear, O Israel: The LORD our God is one LORD” (Deut 6:4). When the Lord Jesus Christ was asked about the greatest commandment, the Bible records, “And Jesus answered him, The first of all the commandments is, Hear, O Israel; The Lord our God is one Lord” (Mark 12:29). It is clear from the response of the scribe that the Jews understood “one” to mean one single person – “he”. “And the scribe said unto him, Well, Master, thou hast said the truth: for there is one God; and there is none other but he” (Mark 12:32). What the above means is that there is no room whatsoever for a so-called doctrine of the “Holy Trinity”. What is the doctrine of the Trinity? In its most basic form, it states that “(1) God is three persons (2) Each person is fully God (3) There is one God” (Grudem, 1994, p. 231). The Trinitarian scholar, Wayne Grudem, goes on to clarify what is meant by “God is three persons”. ",
      "pdfLink": "/sermons/DOCTRINE_OF_THE_ONE_GOD.pdf",
      "image": "/sermons/DOCTRINE_OF_THE_ONE_GOD.png",
      "pages": "7"
    },
    {
      "title": "God Chose Prophetesses",
      "summary": "“And Deborah, a prophetess, the wife of Lapidoth, she judged Israel at that time. And she dwelt under the palm tree of Deborah between Ramah and Bethel in mount Ephraim: and the children of Israel came up to her for judgment”(Judges 4:4-5). Today’s message is to encourage and edify sisters in their walk and ministries. Here was a woman called Deborah in the days of the Judges. All the Judges were men, except Deborah. Her name meant a “bee” and, indeed, she was busy as a bee for the Lord. Her husband’s name was Lapidoth, but she was the star of the story. We know many called Deborah in our days, but I haven’t come across a Lapidoth. She may have dwelt under a humble and obscure palm tree in mount Ephraim, but “the children of Israel came up to her for judgement” (Judges 4:5). She had many things going against her: she was a woman and she dwelt in an obscure place that was neither Ramah, where Samuel dwelt later nor Bethel the house of God, but God chose her to be a prophetess. In other words, the word of God was with her and all Israel came to her to know what the will of the Lord was and what course of action to take. This is tremendous power. I am sure many men were not happy about this. Before Israel demanded a King of God, the Lord chose whom he will judge Israel. Not only that, but Deborah also gained her fame during a famous battle which she initiated as the Lord moved her spirit.",
      "pdfLink": "/sermons/GOD_CHOSE_PROPHETESSES.pdf",
      "image": "/sermons/GOD_CHOSE_PROPHETESSES.png",
      "pages": "3"
    },
    {
      "title": "Washing Each Other",
      "summary": "“Peter saith unto him, Thou shalt never wash my feet. Jesus answered him, If I wash thee not, thou hast no part with me. If I then, your Lord and Master, have washed your feet; ye also ought to wash one another's feet. For I have given you an example, that ye should do as I have done to you” John 13:8, 14-15. Just think about your feet for a moment. Consider trying to move your body without the aid of your feet. Neither our head, hands, knees or back can substitute for our feet when it comes to moving the entire body effectively. The head, hands, thighs etc. don’t seem to do much of use for the feet, so to speak, as the feet do in carrying all of the other members. Think now about a day or time when you walked around for several hours. Do you remember the ache you felt in your feet? There is a perfectly good reason shopping malls have cafés, sitting areas and benches spread around – they are meant for our aching feet. Let us take a moment to appreciate the job our feet do now and then! No wonder there are some who treat their feet to a well-deserved foot massage or foot bath. They work very hard for the rest of the body. Once we highlight the role feet play in our everyday, it becomes easier to appreciate the biblical culture of washing the feet of honored guests and travelers.",
      "pdfLink": "/sermons/WASHING_EACH_OTHER.pdf",
      "image": "/sermons/WASHING_EACH_OTHER.png",
      "pages": "3"
    },
    {
      "title": "Watch and Pray",
      "summary": "“Nevertheless we made our prayer unto our God, and set a watch against them day and night, because of them” Neh 4:9. There is an enemy who does not want us to succeed in the work of the Lord. The Devil knew that seventy years were determined for the children of Israel to live in exile in Babylon after which the Lord would bring them back to the holy land. “In the first year of his reign I Daniel understood by books the number of the years, whereof the word of the LORD came to Jeremiah the prophet, that he would accomplish seventy years in the desolations of Jerusalem” (Daniel 9:2). We must expect the Devil to try to stir up many troubles and frustrations for the people of God when they embark on important spiritual missions. If the Temple and walls of Jerusalem would be rebuilt, people would repent, pray, and keep the commands of God. This was something the Devil was determined to stop although he knew the word of God cannot be stopped. Indeed, knowledge of the word of God and the futility of blocking its fulfillment has never deterred Satan from trying.",
      "pdfLink": "/sermons/WATCH_AND_PRAY.pdf",
      "image": "/sermons/WATCH_AND_PRAY.png",
      "pages": "3"
    },
    {
      "title": "The Greatest Pulpit, Preacher and Sermon",
      "summary": "“And lo a voice from heaven, saying, This is my beloved Son, in whom I am well pleased.”(Matthew 3:17). “While he yet spake, behold, a bright cloud overshadowed them: and behold a voice out of the cloud, which said, This is my beloved Son, in whom I am well pleased; hear ye him.”(Matthew 17:5) All God-fearing and God-seeking people had made their way to the river Jordan that day. A spirit of repentance and humility had seized them, and they knew that they had to go and hear the words of righteous John and be baptized in preparation for the coming of the Messiah. Only when people prepare to repent and make their way to the preacher (church) to make things right with God, will they hear a voice from heaven. What an amazing thing happened that day – humans heard a voice from heaven! This was the greatest pulpit in the history of preaching and the Father himself was the preacher. And this was the greatest sermon in the history of preaching – “This is my beloved Son, in whom I am well pleased”. Once again, on the Mount of Transfiguration, Peter spoke but was cut off by the voice from heaven. Why would God cut off the words of his leading Apostle? What message was greater than that of the man with the keys of heaven? What did it say? It said: “This is my beloved Son, in whom I am well pleased; hear ye him”. May God always cut us off when we stray away from this message! I would be very happy for this voice to cut me off right now in the middle of sermon and declare to everyone hearing, “This is my beloved Son, in whom I am well pleased; hear ye him”.",
      "pdfLink": "/sermons/THE_GREATEST_PULPIT_PREACHER_AND_SERMON.pdf",
      "image": "/sermons/THE_GREATEST_PULPIT_PREACHER_AND_SERMON.jpg",
      "pages": "4"
    },
    {
      "title": "Go to Joseph!",
      "summary": "“And when all the land of Egypt was famished, the people cried to Pharaoh for bread: and Pharaoh said unto all the Egyptians, Go unto Joseph; what he saith to you, do.” (Gen 41:55). We are the Josephs of the Lord Jesus Christ in the world today! Few righteous people have been so abused and mistreated as Joseph. Consider it through the lens of two of Joseph’s garments: the blood-stained coat of many colors, and the garment that Potiphar’s wife showed to her husband. The first was to lie about his death and the second to lie about his sexual conduct. “Many are the afflictions of the righteous: but the LORD delivereth him out of them all” (Psalm 34:19). Because Joseph had the favor of God and would deliver Egypt and the world from starvation, the Devil declared war on him. Let us learn from humble Joseph. He never carried a grudge or sought revenge throughout these terrible ordeals. Joseph points to us who are custodians and guardians of the knowledge of the salvation of God through Jesus Christ. Let us pray for the patience and forgiveness that characterized Joseph. One of these days, Pharaoh himself will command Egypt to “Got to Joseph!”",
      "pdfLink": "/sermons/GO_TO_JOSEPH.pdf",
      "image": "/sermons/GO_TO_JOSEPH.jpg",
      "pages": "3"
    },
    {
      "title": "The Two Marks on Jesus’ Palms",
      "summary": "There are two cuttings or marks on the palms of the hands of the Lord Jesus Christ. The first mark is the nail prints that we inflicted upon the Lord collectively on the Cross at Golgotha. “Then saith he to Thomas, Reach hither thy finger, and behold my hands; and reach hither thy hand, and thrust it into my side: and be not faithless, but believing” (John 20:27). All of us are invited to examine this cut or piercing we inflicted upon the Lord. “But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed” (Isaiah 53:5). The Lord has refused to erase these wounds or scars from his hands because they bear witness of his Godhead, the expiation of our sins, his resurrection, his return, and his immeasurable love for humanity. This is the wound or the marking we inflicted upon him, but there is another mark on the palms of his hands that he himself inscribed or cut into. Isaiah 49:16 Behold, I have graven thee upon the palms of my hands; thy walls are continually before me. The Hebrew word ḥāqaq is translated as “to cut in or on, cut upon, engrave, inscribe” according to James Strong. Look at the palms of your hands. They contain lines that do not communicate anything intelligible, but the palms of the Lord Jesus’ hands proudly display your name and mine.",
      "pdfLink": "/sermons/THE_TWO_MARKS_ON_JESUS_PALMS.pdf",
      "image": "/sermons/THE_TWO_MARKS_ON_JESUS_PALMS.jpg",
      "pages": "3"
    },
    {
      "title": "Let us Learn from Fallen Angels",
      "summary": "“For if God spared not the angels that sinned, but cast them down to hell, and delivered them into chains of darkness, to be reserved unto judgment;” (2Peter 2:4). This sermon is about repentance. The Apostolic doctrine of salvation begins with repentance. “Then Peter said unto them, Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost” (Acts 2:38). Fallen angels teach us a powerful lesson about repentance. Firstly, these mighty angels, who were immensely more superior than humans, were sitting in heavenly places. “And he said unto them, I beheld Satan as lightning fall from heaven” (Luke 10:18). The higher the climb, the greater and more painful the fall! It is when we feel that we are on top of the world, so to speak, that the sin of pride comes and sneaks up on us. Heaven is the ultimate dream for all God’s creatures. Imagine meeting someone who was secure in heaven but was been kicked out – these are the demons that wander in the wilderness of the earth now. There was a time before Lucifer fell that he also walked in righteousness in the Garden of Eden with Adam and Eve, until he became corrupt and corrupted Adam and Eve too.",
      "pdfLink": "/sermons/LET_US_LEARN_FROM_FALLEN_ANGELS.pdf",
      "image": "/sermons/LET_US_LEARN_FROM_FALLEN_ANGELS.jpg",
      "pages": "3"
    },
    {
      "title": "We are the Moshe of Jesus",
      "summary": "“And the child grew, and she brought him unto Pharaoh's daughter, and he became her son. And she called his name Moses: and she said, Because I drew him out of the water.” (Exodus 2:10).The water of the river Nile changed baby Moses’ destiny from that of a slave to a royal prince. Hallelujah! When Moses was put into the ark and lowered onto the waters of the river Nile, the hands that lowered the basked were those of a slave – Jochebed. The hands, however, which picked him out of the waters of the Nile were those of a royal princess – the daughter of Pharaoh (Heb 11:24). How did this incredible change in destiny happen? Between a life of slavery and the palace there was faith and water. “By faith Moses, when he was born, was hid three months of his parents, because they saw he was a proper child; and they were not afraid of the king's commandment” (Heb 11:23). When faith and water combine a miracle happens. I wish to talk to you today about the water that changes our destiny. There are some Jochebed here today: their children will be baptized in Jesus’ name. Like Jochebed you realized there is no future for your children no matter how much love you may shower upon them. “He that believeth and is baptized shall be saved; but he that believeth not shall be damned” (Mark 16:16). It is foolish to stay in the house of the damned; better to lower your child into the waters of baptism. Every good mother wants the best future for her child – then lower your child into the waters of baptism in Jesus’ name! The hands that will lift your child out of the waters on the other side in heaven are those of the Lord Jesus.",
      "pdfLink": "/sermons/WE_ARE_THE_MOSHE_OF_JESUS.pdf",
      "image": "/sermons/WE_ARE_THE_MOSHE_OF_JESUS.jpg",
      "pages": "3"
    },
    {
      "title": "The Cry of the Man of Macedonia",
      "summary": "“And a vision appeared to Paul in the night; There stood a man of Macedonia, and prayed him, saying, Come over into Macedonia, and help us” (Act 16:9). Let us remember that prior to this vision, the Apostle Paul appeared determined to travel to Asia but the Spirit of the Lord hindered him. “Now when they had gone throughout Phrygia and the region of Galatia, and were forbidden of the Holy Ghost to preach the word in Asia, After they were come to Mysia, they assayed to go into Bithynia: but the Spirit suffered them not” (Acts 16: 6,7). Why did Paul want to go to Asia and not Europe? Could it be that, as a devout Jew, he despised the polytheism and philosophical antagonism towards God that flourished in the West? Scripture does not tell us but let us read between the lines and draw some important spiritual lessons for our own exhortation today. Here was a great man of God, Paul, who was filled with the power of Jesus to save, heal and convert the entire world. No wonder the Lord carefully directed his every move “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life” (John 3:16).",
      "pdfLink": "/sermons/THE_CRY_OF_THE_MAN_OF_MACEDONIA.pdf",
      "image": "/sermons/THE_CRY_OF_THE_MAN_OF_MACEDONIA.jpg",
      "pages": "3"
    },
    {
      "title": "The Return of Jesus: Signs of the Times",
      "summary": "“And when these things begin to come to pass, then look up, and lift up your heads; for your redemption draweth nigh.” (Luke 21:28). In the Book of I Chronicles 12, we read about the various tribes that joined ranks with David to fight against King Saul. All of them are mentioned in their thousands along with their bravery, except one tribe – Issachar. “And of the children of Issachar, which were men that had understanding of the times, to know what Israel ought to do; the heads of them were two hundred; and all their brethren were at their commandment” (I Chron 12:32). They numbered just 200, but they had a unique gift which no other tribe seemed to have: they “had understanding of the times, to know what Israel ought to do”. They may have been very few compared to the other tribes, but their gift of knowing the times and what to do compensated for their numbers. May God give us a tribe of Issachar which can discern the times we live in and what we ought to do for the glory of the Lord Jesus!",
      "pdfLink": "/sermons/THE_RETURN_OF_JESUS_SIGNS_OF_THE_TIMES.pdf",
      "image": "/sermons/THE_RETURN_OF_JESUS_SIGNS_OF_THE_TIMES.jpg",
      "pages": "3"
    },
    {
      "title": "The Petition of the Daughters of Zelophehad",
      "summary": "“And Zelophehad the son of Hepher had no sons, but daughters: and the names of the daughters of Zelophehad were Mahlah, and Noah, Hoglah, Milcah, and Tirzah.” (Num 26:33). Zelophehad had five daughters who it appears were unmarried virgins. Let us call them the five wise virgins. Zelophehad means “firstborn”. Certainly, the name of their father may have influenced his daughters. Never underestimate the power of a name to shape one’s destiny. I always advise saints to choose the names of their children with prayer and wisdom. The best reminder parents can give their children, when the parents are long dead, is the name/s you choose; it will still guide and influence them from beyond the grave. “And they stood before Moses, and before Eleazar the priest, and before the princes and all the congregation, by the door of the tabernacle of the congregation, saying” (Numbers 27:2). These were clearly very brave virgins. Never before do we read of women seeking an official audience before Moses and leadership of Israel before the Tabernacle of the Lord with the entire congregation assembled. We can never hope to receive the great promises of God unless we are willing to risk our reputations and dream big dreams. “Be not afraid of their faces: for I am with thee to deliver thee, saith the LORD” (Jeremiah 1:8). Those who see the face of God have no fear of the face of a Moses, Aaron, Eleazer etc.",
      "pdfLink": "/sermons/THE_PETITION_OF_THE_DAUGHTERS_OF_ZELOPHEHAD.pdf",
      "image": "/sermons/THE_PETITION_OF_THE_DAUGHTERS_OF_ZELOPHEHAD.jpg",
      "pages": "4"
    },
    {
      "title": "Elders in Heaven Serving the Lord",
      "summary": "“And round about the throne were four and twenty seats: and upon the seats I saw four and twenty elders sitting, clothed in white raiment; and they had on their heads crowns of gold.” (Rev 4:4). The number 24 represents several things. For one, it points to the 12 representatives of the tribes of Israel along with the 12 Apostles. Hence a completion of the entire assembly of God from the new and old testaments. “And are built upon the foundation of the apostles and prophets, Jesus Christ himself being the chief corner stone” (Eph 2:20). In addition, the number 24 can also point to the Levitical order of service in the Temple structured by King David in I Chronicles 24:7-18. These priestly courses of service ensured there was service to the Lord 24/7. Incense, prayers, worship were offered to God on a continual basis. Hallelujah! The church has 24 elders who ensure continual service before the Lord Jesus in heaven. This is what the Apostle John found discovered and shared with us.",
      "pdfLink": "/sermons/ELDERS_IN_HEAVEN_SERVING_THE_LORD.pdf",
      "image": "/sermons/ELDERS_IN_HEAVEN_SERVING_THE_LORD.jpg",
      "pages": "3"
    },
    {
      "title": "Bible Prophecy Series",
      "subTitle": "King Jesus gathering Israel",
      "summary": "“When they therefore were come together, they asked of him, saying, Lord, wilt thou at this time restore again the kingdom to Israel?” (Acts 1:6). This was the wrong question to ask the Lord Jesus? There is no kingdom to restore again to Israel because the kingdom belongs to Jesus. The correct question should have been: “Lord, will thou at this time restore the kingdom to yourself?” All prophecies declared that the Lord Jesus would gather Israel from the four corners of the earth, bring them back to the Holy Land and reign as King over them. “Of the increase of his government and peace there shall be no end, upon the throne of David, and upon his kingdom, to order it, and to establish it with judgment and with justice from henceforth even forever. The zeal of the LORD of hosts will perform this” (Isaiah 9:7). Please keep in mind that the current government of Israel is not a kingdom, but a parliamentary democracy. In other words, we need to look for a son, who is the everlasting Father, who will return and establish an eternal kingdom in Israel today. This can only be the Lord Jesus Christ. Be assured of one thing, saints of God, God is not a man that he should lie – he will not rest until he is crowned King of Israel.",
      "pdfLink": "/sermons/BIBLE_PROPHECY_SERIES.pdf",
      "image": "/sermons/BIBLE_PROPHECY_SERIES.jpg",
      "pages": "3"
    },
    {
      "title": "Jesus Desperate to Reveal Himself to His Family",
      "summary": "“Then Joseph could not refrain himself before all them that stood by him; and he cried, Cause every man to go out from me. And there stood no man with him, while Joseph made himself known unto his brethren.” Genesis 45:1. We know the background to this incredible story. Joseph’s brothers had first tried to kill him and then settled on selling him to some Ishmaelite slave traders who took him to Egypt. Joseph, however, became the second most powerful ruler in Egypt because God was with him. Spiritually speaking, our sins are the brothers of Joseph. Every one of us is a Reuben, Simeon, Judah, Levi, Zebulon, etc. It was our sins that led our Lord to the Cross of Calvary. “But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed” (Isaiah 53: 5). Our sins were the reason the Lord Jesus ended up on earth just as the sins of Joseph’s brothers was the reason he ended up in a foreign country, Egypt. Jesus said he was not of this world, and Joseph’s heart was never comfortable in Egypt. ",
      "pdfLink": "/sermons/JESUS_DESPERATE_TO_REVEAL_HIMSELF_TO_HIS_FAMILY.pdf",
      "image": "/sermons/JESUS_DESPERATE_TO_REVEAL_HIMSELF_TO_HIS_FAMILY.jpg",
      "pages": "3"
    },
    {
      "title": "His Name Shall Be Called Wonderful",
      "summary": "“For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.” Isaiah 9:6 The Hebrew word for “wonderful” is pele' and means “a miracle, marvelous thing, a wonder. Indeed, the Lord Jesus Christ is a miracle. A miracle can be defined as a welcome, unexpected event that cannot be explained by natural laws but a divine act. In his birth, the Lord Jesus was wonderful; angels, shepherds and wise men from the east came to marvel at his miraculous birth of a virgin. “Therefore the Lord himself shall give you a sign; Behold, a virgin shall conceive, and bear a son, and shall call his name Immanuel” (Isaiah 7:14). As a 12-year-old, the doctors of the law marveled at the wisdom Jesus demonstrated in the seat of theological learning, the Temple in Jerusalem. The three-year ministry of the Lord was filled with non-stop gasps, shouts and screams of relief and joy on account of healings and deliverances wherever Jesus went. An eyewitness of the ministry of the Lord, John, wrote, “And there are also many other things which Jesus did, the which, if they should be written everyone, I suppose that even the world itself could not contain the books that should be written. Amen” (John 21:25). His death and resurrection were also equally wonderful.",
      "pdfLink": "/sermons/HIS_NAME_SHALL_BE_CALLED_WONDERFUL.pdf",
      "image": "/sermons/HIS_NAME_SHALL_BE_CALLED_WONDERFUL.jpg",
      "pages": "2"
    },
    {
      "title": "The Christian's Best Friend",
      "summary": "“When thou goest, it shall lead thee; when thou sleepest, it shall keep thee; and when thou awakest, it shall talk with thee.” Proverbs 6:22 Solomon was speaking about the commandments of the father and mother. It is clear that he was referring to the word of God. The Queen of Sheba travelled from the ends of the earth to hear the wisdom that God gave Solomon. All we need to do is open the pages of the Bible to enjoy this wisdom. So, what does Solomon say? He says there is a book that will lead you, keep you when you sleep, and talk with you when you awake. What an incredible book! Why don’t we all take out our Bibles, have a close look at it, and declare – “this is my best friend!” Is there a friend who can be so intimate as to keep us when we sleep? Yes, the word of God! “A man that hath friends must shew himself friendly: and there is a friend that sticketh closer than a brother” (Proverbs 18:24).",
      "pdfLink": "/sermons/THE_CHRISTIANS_BEST_FRIEND.pdf",
      "image": "/sermons/THE_CHRISTIANS_BEST_FRIEND.jpg",
      "pages": "4"
    },
    {
      "title": "The God of Two Blessings",
      "summary": "“And I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing” Genesis 12:2 Abraham was blessed twice: once by God and then he became a blessing for the world. We must now allow the curtain to fall on 2022 without first receiving the blessing from the Lord Jesus so that we can become a blessing to others in 2023. How precisely did God bless Abraham? First and foremost, Abraham knew the one God of heaven and earth. This is the greatest blessing of all! “And Jesus answered him, The first of all the commandments is, Hear, O Israel; The Lord our God is one Lord” (Mark 12:29). Kings bowed down to Abraham because of this blessing. The Canaanites were afraid to touch Abraham because his defense was his faith in the one God of heaven and earth. Often in the history of the nation of Israel, the children of Abraham compromised their faith in the one God, but it was as if the unshakeable faith of Abraham in the one God would pull them back to his God.",
      "pdfLink": "/sermons/THE_GOD_OF_TWO_BLESSINGS.pdf",
      "image": "/sermons/THE_GOD_OF_TWO_BLESSINGS.jpg",
      "pages": "4"
    },
    {
      "title": "Declaring This New Years’ Season Mahanaim",
      "summary": "“And Jacob went on his way, and the angels of God met him. And when Jacob saw them, he said, This is God's host: and he called the name of that place Mahanaim.” Genesis 32:1-2 At this point in Jacob’s life, he had suffered at the hands of two people for 20 years: Esau and Laban. It was because of Esau that he was a refugee in Haran separated from his family and the promise of God in the Land of Canaan. In Haran, he was tormented by his uncle Laban. This is perhaps why Jacob accepted his sufferings in Haran for so long – he was too afraid to return to Canaan because of Esau. When we do not have the strength to return to where we should be in the Lord, thank God that he himself intervenes and pushes us towards his will and promises. God told Jacob: “And the LORD said unto Jacob, Return unto the land of thy fathers, and to thy kindred; and I will be with thee” (Gen 31:3). When Jacob decided to return to the land of promise, the Bible says that he saw two companies of angels – for that is what Mahanaim means: two camps of angels. Hallelujah! One camp of angels went behind him to close the door to Laban and the past 20 years, and another camp of angels to face Esau and the future. I want to call this time of the year, as we head to 2023, Mahanaim – the Lord Jesus will send two camps of angels: one to close the door on the pain and sufferings of 2022 and another to lead us to confront 2023. Praise Jes",
      "pdfLink": "/sermons/DECLARING_THIS_NEW_YEARS_SEASON_MAHANAIM.pdf",
      "image": "/sermons/DECLARING_THIS_NEW_YEARS_SEASON_MAHANAIM.jpg",
      "pages": "3"
    },
    {
      "title": "Enoch Walked with God",
      "summary": "“And Enoch walked with God after he begat Methuselah three hundred years, and begat sons and daughters: And all the days of Enoch were three hundred sixty and five years: And Enoch walked with God: and he was not; for God took him.” Genesis 5:22-24 God will only walk with a person in whom he takes pleasure. “Can two walk together, except they be agreed?” (Amos 3:3). There is no greater blessing on earth than to be called the friend of God. Friendship is mutually beneficial – both parties derive great pleasure from talking together, sharing activities and just being in each other’s company. What a privilege it would have been to observe this relationship between Enoch and God! What intimacy, what love, what respect and every good blessing flowed to Enoch through this relationship with God! We should all desire a closer walk with Jesus! “But without faith it is impossible to please him: for he that cometh to God must believe that he is, and that he is a rewarder of them that diligently seek him” (Hebrews 11:6). Enoch believed passionately in this scripture. He demonstrated this for 365 years. Imagine that! ",
      "pdfLink": "/sermons/ENOCH_WALKED_WITH_GOD.pdf",
      "image": "/sermons/ENOCH_WALKED_WITH_GOD.jpg",
      "pages": "3"
    },
    {
      "title": "Who Touched Me",
      "summary": "“And when the woman saw that she was not hid, she came trembling, and falling down before him, she declared unto him before all the people for what cause she had touched him, and how she was healed immediately.” Luke 8:47 A woman who was menstruating or bled for any other reason was considered unclean, according to the Law of Moses. Leviticus 15 gives a detailed list of all that becomes unclean for the duration of the blood issue –beds,chairs, vessels, clothes etc. “And if a woman have an issue, and her issue in her flesh be blood, she shall be put apart seven days: and whosoever toucheth her shall be unclean until the even.And everything that she lieth upon in her separation shall be unclean: everything also that she sitteth upon shall be unclean”(Leviticus 15:19,20). Perhaps this woman was terrified of the consequences of the Law of Moses, as I said previously. But she forgot that the Law of Moses had no power against the grace and love of the Lord Jesus Christ. Let me share a spiritual insight about the relationship between the issue of blood from women and the blood of the Lord Jesus Christ.",
      "pdfLink": "/sermons/WHO_TOUCHED_ME.pdf",
      "image": "/sermons/WHO_TOUCHED_ME.png",
      "pages": "3"
    },
    {
      "title": "David's Place Was Empty",
      "summary": "“And the king sat upon his seat, as at other times, even upon a seat by the wall: and Jonathan arose, and Abner sat by Saul's side, and David's place was empty. And it came to pass on the morrow, which was the second day of the month, that David's place was empty: and Saul said unto Jonathan his son, Wherefore cometh not the son of Jesse to meat, neither yesterday, nor to day?” 1Sam 20:25, 27 “Noone loved the house of Godand the fellowship of the people of God more than David. “[[A Song of degrees of David.]] I was glad when they said unto me, Let us go into the house of the LORD”(Psalm 122:1). In the scripture passage above, the occasion was a festival of the new moon. This was a holy day, quite similar to the Sabbath, when all were expected to participate, be ceremoniallyclean, and offer up sacrifices.“And in the beginnings of your months ye shall offer a burnt offering unto the LORD; two young bullocks, and one ram, seven lambs of the first year without spot”(Num 28:11). For all these reasons, no one expected the seat of David to be empty. Anempty seat conveys a powerful message, especially when your name is David. Even the King, Saul, paid attention and was disturbed.May we serve the Lord Jesus so effectively that Kings and courtiers will take notice when our seats are empty. The tomb of Jesus was and is empty, and the entire worldpaid attention. It was the empty tomb that raised the question: who is Jesus and why did he die? The empty seat of David also raised many questions. Saints of God, my main aim in this message today is to ask you to humbly consider the meaning of your seat in the Kingdom of the Lord Jesus Christ.",
      "pdfLink": "/sermons/DAVIDS_PLACE_WAS_EMPTY.pdf",
      "image": "/sermons/DAVIDS_PLACE_WAS_EMPTY.jpg",
      "pages": "4"
    },
    {
      "title": "The Power of Creation and Naming",
      "summary": "“And God called the light Day, and the darkness he called Night. And the evening and the morning were the first day.” Genesis 1:5 “And God called the firmament Heaven. And the evening and the morning were the second day.” Genesis 1:8 “Male and female created he them; and blessed them, and called their name Adam, in the day when they were created.” Genesis 5:2  ",
      "pdfLink": "/sermons/THE_POWER_OF_CREATION_AND_NAMING.pdf",
      "image": "/sermons/THE_POWER_OF_CREATION_AND_NAMING.jpeg",
      "pages": "3"
    },
    {
      "title": "What Shall We Do with the King of the Jews?",
      "summary": "“And Pilate answered and said again unto them, What will ye then that I shall do unto him whom ye call the King of the Jews?” Mark 15:12 Pilate had certainly heard much about the Lord Jesus Christ. He was stationed in Judea somewhere between 26-36 AD. Pilate had spies and informants reporting to him and he must have received detailed reports about the character and miracles of the Lord. Pilate knew very well that the Lord’s mission was not political; in fact, he must have relished the Lord’s attacks on the Pharisees and Sadducees because Pilate could not stand these Jewish leaders himself. The historian Josephus wrote, among others, that Pilate entered Jerusalem with pagan images of the Roman Emperor Tiberius which enraged the Jewish leaders who demanded he remove these images. On another occasion, Pilate took money from the Temple to construct an aqueduct which also incensed the Jews against him. In other words, Pilate must have admired the courage of the Lord in standing up against his own enemies, alone. So, we can only imagine how unprepared Pilate was when he suddenly saw the Lord brought before him accused of blasphemy and the Jews demanding his crucifixion. Pilate had the distinction of being the only person before whom the Lord was brought on trial – the only man who could pass the deaths sentence on Jesus. Since Pilate, however, Jesus has appeared before the judgment seats of countless people because we must all pass a judgment on his identity. Pilate asked the wrong question to the Jews: What will ye then that I shall do unto him whom ye call the King of the Jews? The correct question is the title of this sermon, “What will we do with the King of the Jews?” Every single person on this earth must answer this question.",
      "pdfLink": "/sermons/WHAT_SHALL_WE_DO_WITH_THE_KING_OF_THE_JEWS.pdf",
      "image": "/sermons/WHAT_SHALL_WE_DO_WITH_THE_KING_OF_THE_JEWS.jpeg",
      "pages": "3"
    },
    {
      "title": "Jesus saw Matthew",
      "summary": "“And as Jesus passed forth from thence, he saw a man, named Matthew, sitting at the receipt of custom: and he saith unto him, Follow me. And he arose, and followed him.” Matthew 9:9 Years later, the apostle Matthew records the time he met the Lord Jesus. He was a tax collector, a publican. Not only Jews, but every nation under the yoke of Rome, hated tax collectors.  James Strong defines a publican in this manner: “a tax gatherer, collector of taxes or tolls, one employed by a publican or farmer general in the collection of taxes. The tax collectors were as a class, detested not only by the Jews, but by other nations also, both on account of their employment and of the harshness, greed, and deception, with which they did their job”. Matthew means “gift of Jehovah”, but clearly, he was more like the “curse of Jehovah” for everyone who met him. He was obviously used to receiving hate, threats and abuse from Jews which he normally dished out to them. The Devil wants some people to expect everyone to hate them so they can continue in their own hatred of others. No one ever invited Matthew to their homes or affairs. To choose a job where you work for the arch enemy of your people and extort taxes from the poor, is to permanently separate oneself from the nation of Israel. But one day, one merciful day, he saw a man coming towards him. This man did not have any hatred toward Matthew, only profound love. His name was Jesus.",
      "pdfLink": "/sermons/JESUS_SAW_MATTHEW.pdf",
      "image": "/sermons/JESUS_SAW_MATTHEW.jpg",
      "pages": "3"
    },
    {
      "title": "God our Habitation",
      "summary": "“Because thou hast made the LORD, which is my refuge, even the most High, thy habitation; There shall no evil befall thee, neither shall any plague come nigh thy dwelling.” Psalm 91:9-10 Happy are we if the Lord Jesus Christ is our address! If God is our address, we have the biggest house in the universe indeed. While Solomon’s Temple was a wonder to behold, Solomon acknowledged that no building can ever dream of serving as God’s house. “But who is able to build him an house, seeing the heaven and heaven of heavens cannot contain him? who am I then, that I should build him an house, save only to burn sacrifice before him?” (2Chron 2:6). The good news is this: while nothing humans can build will ever accommodate God, God invites one and all to dwell in him. Hallelujah! “Abide in me, and I in you. As the branch cannot bear fruit of itself, except it abide in the vine; no more can ye, except ye abide in me” (John 15:4). Moses, who wrote Psalm 91, did not seem to have any secure, permanent dwelling place made of mud and bricks once he killed the Egyptian man and fled to Midian. For forty years he wandered in the desert with the people of God. He became a nomad – the word comes from Latin “nomas” and means a wandering shepherd. When one gives up a secure, permanent dwelling place for the sake of the people of God, then God himself becomes your address. No wonder Moses declares confidently that no evil, nor plague shall come near those who make the most high their habitation. God was Moses’ address!",
      "pdfLink": "/sermons/GOD_OUR_HABITATION.pdf",
      "image": "/sermons/GOD_OUR_HABITATION.jpg",
      "pages": "3"
    },
    {
      "title": "Come and Dine, Says Jesus",
      "summary": "“Jesus saith unto them, Come and dine. And none of the disciples durst ask him, Who art thou? knowing that it was the Lord. Jesus then cometh, and taketh bread, and giveth them, and fish likewise.” John 21:53-54 We live in a difficult time. Even people in rich countries are suffering from the combined effects of a war in the Ukraine, such as inflation which affects food and fuel prices. Several people are afraid of the coming winter and how to stay warm. This message is intended to give you hope; Jesus Christ is still our Jehovah Jireh. “And Abraham said, My son, God will provide himself a lamb for a burnt offering: so they went both of them together” (Gen 22:8). The God who kept us through the difficult months of the Covid-19 virus will also see us through this trial. Amen!",
      "pdfLink": "/sermons/COME_AND_DINE_SAYS_JESUS.pdf",
      "image": "/sermons/COME_AND_DINE_SAYS_JESUS.jpg",
      "pages": "3"
    },
    {
      "title": "Accounting for the Little that God Gave us",
      "summary": "“He also that had received two talents came and said, Lord, thou deliveredst unto me two talents: behold, I have gained two other talents beside them. His lord said unto him, Well done, good and faithful servant; thou hast been faithful over a few things, I will make thee ruler over many things: enter thou into the joy of thy lord.”Mat 25:22-23 This message is for those who have been given very few talents by the Lord because there is the danger of thinking that the talents are so few and insignificant that the Lord will not require of them from you. This would be an egregious error. God does not accept that any of his blessings, however small, are chucked away or neglected. This is the very reason the Lord Jesus commanded the apostles to gather the fragments of bread after he miraculously fed the 5000. “When they were filled, he said unto his disciples, Gather up the fragments that remain, that nothing be lost. Therefore, they gathered them together, and filled twelve baskets with the fragments of the five barley loaves, which remained over and above unto them that had eaten” (John 6:12, 13). The fragments filled 12 baskets – the number of divine representation and authority. Even the fragments and crumbs of God have apostolic power. Hallelujah!",
      "pdfLink": "/sermons/ACCOUNTING_FOR_THE_LITTLE_THAT_GOD_GAVE_US.pdf",
      "image": "/sermons/ACCOUNTING_FOR_THE_LITTLE_THAT_GOD_GAVE_US.jpg",
      "pages": "3"
    },
    {
      "title": "The Prayer that Jesus Refused to Pray",
      "summary": "“Thinkest thou that I cannot now pray to my Father, and he shall presently give me more than twelve legions of angels? But how then shall the scriptures be fulfilled, that thus it must be?”Mat 26:53-54 When the Lord told the apostles to sell that they had and buy swords before he went to Jerusalem to be arrested and sentenced to death, the apostles misunderstood and procured two swords. “And they said, Lord, behold, here are two swords. And he said unto them, It is enough” (Luke 22:38). Galileans were known to be straightforward people who did not shy away from a confrontation, and they interpreted the words of the Lord literally. Once they came to Jerusalem, the Lord was arrested. They were 13 including the Lord. How can two swords between 13 men fight against the well-armed soldiers of the high priest who were also backed up by the Roman soldiers? Yet because Peter’s love for the Lord was so great, he ignored the odds against them and struck the high priest, Malchus’ head with his sword. Fortunately, Peter missed the head and cut off an ear.",
      "pdfLink": "/sermons/THE_PRAYER_THAT_JESUS_REFUSED_TO_PRAY.pdf",
      "image": "/sermons/THE_PRAYER_THAT_JESUS_REFUSED_TO_PRAY.jpg",
      "pages": "3"
    },
    {
      "title": "Spring up",
      "summary": "“And from thence they went to Beer: that is the well whereof the LORD spake unto Moses, Gather the people together, and I will give them water. Then Israel sang this song, Spring up, O well; sing ye unto it:”Num 21:16-17  We normally approach anything to do with the children of Israel in the desert with Moses with a very critical attitude. Much of this perception is justified – they appeared to be quite ungrateful waiting at every turn to question God and Moses and revert to worshipping and longing for the gods and oppression of Egypt. However, in this study today, the children of Israel have to commend their behaviour and there is a powerful lesson for us to learn.",
      "pdfLink": "/sermons/SPRING_UP.pdf",
      "image": "/sermons/SPRING_UP.jpg",
      "pages": "4"
    },
    {
      "title": "By His Stripes we are Healed",
      "summary": "“But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed.”Isaiah 53:5  “Who his own self bare our sins in his own body on the tree, that we, being dead to sins, should live unto righteousness: by whose stripes ye were healed.“ 1Peter 2:24  Healing of the physical body in Jesus’ name is a very important teaching in the scriptures. The human body has never been healthier and more robust than at the moment God breathed life unto Adam, looked at him and declared that it was very good. This was a body designed to live forever on earth. Just consider the earth from which our bodies have been made. The Spirit of God replenishes the earth so that it produces food in abundance. God heals nature every day; we can witness the principles of healing and reparation in nature. The God who heals and restores the soil of the earth is able to heal and restore our natural bodies which were created from the earth. When one looks at seeds of different kinds, it is not apparent what kind of plant, bush or tree it will turn out to be – God determines the physical proportions.",
      "pdfLink": "/sermons/BY_HIS_STRIPES_WE_ARE_HEALED.pdf",
      "image": "/sermons/BY_HIS_STRIPES_WE_ARE_HEALED.jpg",
      "pages": "3"
    },
    {
      "title": "We see Jesus",
      "summary": "“But we see Jesus, who was made a little lower than the angels for the suffering of death, crowned with glory and honour; that he by the grace of God should taste death for every man.”Heb 2:9  The greatest vision is the vision of faith, not sight. If the eyes of faith are closed, one is blind indeed. “And if thine eye offend thee, pluck it out, and cast it from thee: it is better for thee to enter into life with one eye, rather than having two eyes to be cast into hell fire” (Matthew 18:9). One way of interpreting the words of the Lord is to think of the carnal flesh as having two eyes, while the spiritual person sees with just one eye – the eye that see Jesus. Consider how many people saw the Lord Jesus during his ministry and yet despised and reviled him! The Pharisees, Sadducees, Herodians, Herod and Pilate, all saw the Lord Jesus, but did not benefit from what their eyes beheld. On the other hand, thank God for people like Anna and Simeon! These were prophets who already saw the Lord Jesus through the eyes of the Holy Spirit. “Lord, now lettest thou thy servant depart in peace, according to thy word:  For mine eyes have seen thy salvation” (Luke 2:29,30).",
      "pdfLink": "/sermons/WE_SEE_JESUS.pdf",
      "image": "/sermons/WE_SEE_JESUS.jpg",
      "pages": "4"
    },
    {
      "title": "The Doctrine of the National Ownership of Souls",
      "summary": "“To the general assembly and church of the firstborn, which are written in heaven, and to God the Judge of all, and to the spirits of just men made perfect.”Heb 12:23  There is a teaching floating around that declares a Christian belongs to the church that first baptized and anointed a person exclusively. This teaching further misuses the apostle Paul’s teaching and states that just as Sarah is the spiritual mother of Israel, the local church where one receives salvation becomes a “Sarah” with legitimate claims on the loyalty of the members. Finally, they misappropriate the type and shadow teaching in Genesis 2:21 to justify their “ownership” of their church members. For the sake of convenience, let us call this doctrine the “doctrine of national ownership of Apostolic souls”. None of the above stands up to scriptural scrutiny, and we need to address each one by one. The Lord Jesus will hold us responsible for what we say about souls; he alone gives birth to spiritual souls through the agency of his precious flesh and blood for souls.",
      "pdfLink": "/sermons/THE_DOCTRINE_OF_THE_NATIONAL_OWNERSHIP_OF_SOULS.pdf",
      "image": "/sermons/THE_DOCTRINE_OF_THE_NATIONAL_OWNERSHIP_OF_SOULS.jpg",
      "pages": "3"
    },
    {
      "title": "Women Bringing Incredible News from Heaven",
      "summary": "“And I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel.” Gen 3:15 “And the dragon was wroth with the woman, and went to make war with the remnant of her seed, which keep the commandments of God, and have the testimony of Jesus Christ.” Rev 12:17 In the Old Testament, the Devil targeted the woman and spoke directly to Eve away from her husband, Adam. Women have suffered much throughout history – abuse, violence and prejudice for just being women. Now, however, in the New Testament, women were the first to hear the Gospel and believe. The prophecy of the seed of the woman was now being fulfilled in Nazareth. Let us remember that the Devil knew that God had anyhow planned to deliver humanity from sin through his own flesh and blood. He was aware that humans made of the dust cannot be the image of God. The real image of God is Jesus Christ, and the Devil knew he had to be born of a woman, hence the reason he targeted Eve.",
      "pdfLink": "/sermons/WOMEN_BRINGING_INCREDIBLE_NEWS_FROM_HEAVEN.pdf",
      "image": "/sermons/WOMEN_BRINGING_INCREDIBLE_NEWS_FROM_HEAVEN.jpg",
      "pages": "3"
    },
    {
      "title": "Prophesy an Army into Existence",
      "summary": "“The hand of the LORD was upon me, and carried me out in the spirit of the LORD, and set me down in the midst of the valley which was full of bones, And caused me to pass by them round about: and, behold, there were very many in the open valley; and, lo, they were very dry.” Ezek 37:1-2  The first thing we ought to notice about Ezekiel’s vision of the dry bones is the fact that these bones were not buried, thankfully. They were dead and dry, but not buried. “And there is hope in thine end, saith the LORD, that thy children shall come again to their own border” (Jer 31:17). The believer does not go to the funeral of a soul – we go in the hope of resurrecting the soul in Jesus’ name! In his entire ministry, the Lord Jesus never attended funerals so the “souls could rest in peace”; he came to the tomb of Lazarus to raise him back from the dead. Every death that Jesus encountered, the soul was ordered back to the land of the living. No wonder he declared, “Jesus said unto her, I am the resurrection, and the life: he that believeth in me, though he were dead, yet shall he live” (John 11:25). We serve the God who goes to funerals and graveyards to raise the dead – let us be armed with this faith and understanding and go to meet the dead souls around us.",
      "pdfLink": "/sermons/PROPHESY_AN_ARMY_INTO_EXISTENCE.pdf",
      "image": "/sermons/PROPHESY_AN_ARMY_INTO_EXISTENCE.jpg",
      "pages": "4"
    },
    {
      "title": "Crippled yet Eating at the King’s Table",
      "summary": "“Thou therefore, and thy sons, and thy servants, shall till the land for him, and thou shalt bring in the fruits, that thy master's son may have food to eat: but Mephibosheth thy master's son shall eat bread alway at my table. Now Ziba had fifteen sons and twenty servants” 2 Samuel 9:10 Mephibosheth was the son of Jonathan, the son of King Saul. As a child, his nurse dropped him in the chaos that followed the death of Jonathan and Saul. “And Jonathan, Saul's son, had a son that was lame of his feet. He was five years old when the tidings came of Saul and Jonathan out of Jezreel, and his nurse took him up, and fled: and it came to pass, as she made haste to flee, that he fell, and became lame. And his name was Mephibosheth” (2Sam 4:4). Like Mephibosheth, we all have some scars, some pain or even trauma inflicted upon us. We have all been dropped, so to speak, in the chaos that is life. As I speak (or you read), perhaps the pain of some childhood incident may sadly be reignited. Firstly, be assured it is not your fault, just as it was not Mephibosheth’s fault that he was dropped by his nurse. Simultaneously, we cannot blame the nurse; she saved the life of Mephibosheth. Sometimes, as the Lord Jesus himself declared, disabilities have nothing to do with our actions.",
      "pdfLink": "/sermons/CRIPPLED_YET_EATING_AT_THE_KINGS_TABLE.pdf",
      "image": "/sermons/CRIPPLED_YET_EATING_AT_THE_KINGS_TABLE.jpg",
      "pages": "3"
    },
    {
      "title": "Open letter from Jesus",
      "summary": "This is a flyer that can be used when witnessing, by printing on both pages of an A5 paper. Remember to add your church address, timing and contact details. May the Lord Jesus make you fruitful!",
      "pdfLink": "/sermons/OPEN_LETTER_FROM_JESUS_ENGLISH.pdf",
      "image": "/sermons/OPEN_LETTER_FROM_JESUS_ENGLISH.png",
      "pages": "2"
    },
    {
      "title": "Singing in the Valley of Berachah",
      "summary": "“And on the fourth day they assembled themselves in the valley of Berachah; for there they blessed the LORD: therefore the name of the same place was called, The valley of Berachah, unto this day.” 2Chronicles 20:26  wish to call this place the valley of Berachah (blessing) today! Amen! Perhaps we should begin with praise like Judah did in Jehovah’s sight before the sermon (sing “As David did in Jehovah’s sight …). Let us first understand what happened in the original valley of Berachah and do the same here today. Jehoshaphat was a godly king in Judah. He served God sincerely and demonstrated his love in many ways. However, he had one weakness – he was a close friend of Ahab, the wicked king of Israel. In our text today, Jehoshaphat received the frightening news that his enemies had secretly assembled outside of Jerusalem and were ready to capture the city and Judah. “It came to pass after this also, that the children of Moab, and the children of Ammon, and with them other beside the Ammonites, came against Jehoshaphat to battle” (2Chronicles 20:1). Could it be that the king perhaps feared that this pending disaster was on account of his close friendship with Ahab? Whether this was the case or not, Jehoshaphat decided there was only one course of action: he and all of Judah would repent and fast and pray.",
      "pdfLink": "/sermons/SINGING_IN_THE_VALLEY_OF_BERACHAH.pdf",
      "image": "/sermons/SINGING_IN_THE_VALLEY_OF_BERACHAH.jpg",
      "pages": "4"
    },
    {
      "title": "How far Will you go?",
      "summary": "“And Terah took Abram his son, and Lot the son of Haran his son's son, and Sarai his daughter in law, his son Abram’s wife; and they went forth with them from Ur of the Chaldees, to go into the land of Canaan; and they came unto Haran, and dwelt there.” Genesis 11:31 For some reason, Terah, the father of Abraham, decided to go to the Land of Canaan. This was before the Lord gave the call to Abraham to go to the Land of Canaan. It is important that I rectify this misunderstanding. I have heard many Christians state that Abram heard the call of God in Ur of the Chaldees, but this is not true. Abram the call of God to go to the Land of Canaan in the Haran, Syria, where his father, Terah, had settled. It was actually Terha his father who left Ur for the Land of Canaan. “So Abram departed, as the LORD had spoken unto him; and Lot went with him: and Abram was seventy and five years old when he departed out of Haran” (Genesis 12:4). Could it be that Terah, like Abraham, was a God-fearing man who knew that his faith in the One God of Israel would not survive the idolatry of Ur of the Chaldees? We may never know the reason for his decision to up sticks and move towards the Land of Canaan, but we read that he did make the decision and took with him Abram, Sarai and Lot.",
      "pdfLink": "/sermons/HOW_FAR_WILL_YOU_GO.pdf",
      "image": "/sermons/HOW_FAR_WILL_YOU_GO.jpg",
      "pages": "3"
    },
    {
      "title": "The God who Keeps us Everyday",
      "summary": "“I the LORD do keep it; I will water it every moment: lest any hurt it, I will keep it night and day.” Isaiah 27:3 The holidays are soon over, and we will all begin a new season at school, work etc. Some of you may be excited at the prospect of a new challenge – new friends, teachers, places and colleagues, for example, while others may feel some tension at the thought of new changes. Thankfully, Jesus is the God of the everyday. Speaking about Israel, which also extends to the Church, God says in Isaiah 27:3, “I the LORD do keep it; I will water it every moment: lest any hurt it, I will keep it night and day”. I want to comfort you with this promise of God today: God will keep you first. To keep something is to support it and ensure it endures despite the challenges that may lie ahead. Children and adolescents, God will give you new friends and good, kind teachers. He will further keep you from bad habits and bless your academic skills and results. Young people please say Amen! To those who are employed in diverse activities or are full-time stay-at-home parents, may the Lord Jesus keep you in your job. May you find a deep satisfaction in your labor, may you find favor with your employer and your colleagues!",
      "pdfLink": "/sermons/THE_GOD_WHO_KEEPS_US_EVERYDAY.pdf",
      "image": "/sermons/THE_GOD_WHO_KEEPS_US_EVERYDAY.jpg",
      "pages": "3"
    },
    {
      "title": "I Saw Thee Under the Fig Tree?",
      "summary": "“Jesus answered and said unto him, Because I said unto thee, I saw thee under the fig tree, believest thou? thou shalt see greater things than these. And he saith unto him, Verily, verily, I say unto you, Hereafter ye shall see heaven open, and the angels of God ascending and descending upon the Son of man” John 1:50-51 The fig tree has two main connotations for Jews: it represents a reminder of the nation’s spiritual nakedness without salvation and, secondly, the promise of the coming Messiah who will usher in peace and salvation. Let us begin with the first one. “And the eyes of them both were opened, and they knew that they were naked; and they sewed fig leaves together, and made themselves aprons” (Genesis 3:7). We do not know the species of the tree of the knowledge of good and evil, but we know that the first humans sought to hide their shame with the leaves of the fig tree. Jews have a long tradition of praying under fig trees, and Nathaniel most probably was praying under a fig tree when Philip approached him. We are not told what he was praying for but Jesus said, “Before that Philip called thee, when thou wast under the fig tree, I saw thee” (John 1:48). Perhaps Nathanael prayed for the salvation of Israel and the world. It was no coincidence the Lord directed Philip to the fig tree. Saints of God in Europe, we must spend more time under the fig tree praying for the salvation of Europe. Jesus will see us – he will be moved by our tears and send a Philip to us.",
      "pdfLink": "/sermons/I_SAW_THEE_UNDER_THE_FIG_TREE.pdf",
      "image": "/sermons/I_SAW_THEE_UNDER_THE_FIG_TREE.jpg",
      "pages": "4"
    },
    {
      "title": "God Commands the Poor to Give",
      "summary": "“And the word of the LORD came unto him, saying. Arise, get thee to Zarephath, which belongeth to Zidon, and dwell there: behold, I have commanded a widow woman there to sustain thee” 1Kings 17:8-9 God owns the heavens and the earth. “The silver is mine, and the gold is mine, saith the LORD of hosts” (Haggai 2:8). Yet God commanded a widow to sustain his prophet. Could the Lord not have selected a few immensely rich Israelites to sustain Elijah? Yes, he could! God, in his infinite wisdom, desires to show us that his Gospel will never be dependent upon the pockets and generosity of the rich. The first great lesson of this story is the fact that the poor will always have a role to play in giving to the Kingdom of God. Amen! Notice, God commanded the poor widow; it was not a suggestion – the poor are commanded to give to the Gospel.",
      "pdfLink": "/sermons/GOD_COMMANDS_THE_POOR_TO_GIVE.pdf",
      "image": "/sermons/GOD_COMMANDS_THE_POOR_TO_GIVE.jpg",
      "pages": "3"
    },
    {
      "title": "Shoes on Holy Ground",
      "summary": "“And he said, Draw not nigh hither: put off thy shoes from off thy feet, for the place whereon thou standest is holy ground.” Exodus 3:5 For forty years Moses had put on his shoes and decided where he would go. He had killed the Egyptian soldier and fled to Midian. Now, for the first time in his life, he was commanded to remove his shoes because he stood on holy ground. I don’t know where you all have been before coming here to Paris, but would you kindly allow me to ask you to come forward to this pulpit, this mountain of God, and remove your shoes for the duration of this message in the spirit of Moses? In doing so we will send the Lord Jesus the message that we respect his holiness and are ready to submit to his will. The desert was hot, and one cannot walk around on bare feet. In addition, the desert floor was creeping with dangerous creatures such as snakes and scorpions. Furthermore, Moses would be unable to tend to the sheep of his father-in-law, Jethro, without shoes. One becomes very vulnerable without shoes in such an inhospitable environment. Nevertheless, God demands the removal of shoes. In repentance we show God that we have no other defense other than God. There is no plan B. We remove our shoes before the holy God so he can give us power to tread on serpents and scorpions. “Behold, I give unto you power to tread on serpents and scorpions, and over all the power of the enemy: and nothing shall by any means hurt you” (Luke 10:19).",
      "pdfLink": "/sermons/SHOES_ON_HOLY_GROUND.pdf",
      "image": "/sermons/SHOES_ON_HOLY_GROUND.jpg",
      "pages": "3"
    },
    {
      "title": "Is the Bible Reliable?",
      "summary": "This brief paper considers the issue of the reliability of the Bible. It begins by chronicling the trajectory that led to the compilation of the 66 books of the current canon of the Bible. While the original books are not extant (in existence), the discipline of textual criticism employs criteria such as the number of copies in existence, closeness to the original and internal/external evidence in determining the reliability of ancient documents. Furthermore, the paper offers a tentative definition of the phrase “historically reliable” and considers this in light of the history of the canon of the Bible",
      "pdfLink": "/sermons/IS_THE_BIBLE_RELIABLE.pdf",
      "image": "/sermons/IS_THE_BIBLE_RELIABLE.jpg",
      "pages": "4"
    },
    {
      "title": "The Blood Reconciles Heaven and Earth",
      "summary": "“And, having made peace through the blood of his cross, by him to reconcile all things unto himself; by him, I say, whether they be things in earth, or things in heaven.” (Colossians 1:20). The apostle Paul tells the Colossian church that the Lord Jesus reconciled heaven and earth through his blood. This is a profound statement that needs careful unpacking. How did the Lord reconcile heaven and earth through the agency of his blood? Put differently, how did the blood of the Lord both connect and heal the rift or gap between heaven and earth? Perhaps a good analogy to help us begin to understand this wonderful saving truth is the circulation of blood in our own bodies.",
      "pdfLink": "/sermons/THE_BLOOD_RECONCILES_HEAVEN_AND_EARTH.pdf",
      "image": "/sermons/THE_BLOOD_RECONCILES_HEAVEN_AND_EARTH.jpg",
      "pages": "3"
    },
    {
      "title": "The Firstborns of the Firstborn",
      "summary": "“To the general assembly and church of the firstborn, which are written in heaven, and to God the Judge of all, and to the spirits of just men made perfect.” (Hebrews 12:23). The purpose of this Bible study today is to ensure that he understand the infinite value of our birthright in the Lord Jesus Christ, so we will cherish and value it. Let us proudly declare today that we are children of the firstborn of God, Jesus Christ. By this is meant that the flesh and blood of the Lord is not of earthly or human origin but has its source in God himself. This is what the Bible means when it states repeatedly that Jesus is the Son of God. “And Simon Peter answered and said, Thou art the Christ, the Son of the living God” (Matthew 16:16). If we make this declaration with understanding, the Lord will pronounce a blessing upon us, as he did Peter. Now, the Bible declares we are the children of the firstborn.",
      "pdfLink": "/sermons/THE_FIRSTBORNS_OF_THE_FIRSTBORN.pdf",
      "image": "/sermons/THE_FIRSTBORNS_OF_THE_FIRSTBORN.jpg",
      "pages": "3"
    },
    {
      "title": "Keepers of the Ark vs. Keepers of the Truth",
      "summary": "“And the Philistines put themselves in array against Israel: and when they joined battle, Israel was smitten before the Philistines: and they slew of the army in the field about four thousand men. And when the people were come into the camp, the elders of Israel said, Wherefore hath the LORD smitten us to day before the Philistines? Let us fetch the ark of the covenant of the LORD out of Shiloh unto us, that, when it cometh among us, it may save us out of the hand of our enemies.” (1Samuel 4:2-3).     The Ark of the Covenant replaced faith in the God of Israel in the early days of Eli the High Priest. The Ark was worshipped rather than God. Keepers of the Ark are those who lose sight of the truth of God and focus on the ceremonial, traditional and ritualistic things associated with religion. With time, the children of Israel became keepers of the Ark but not Keepers of the Truth. In other words, they associated seeing the Ark of the Covenant with salvation and protection of God rather than the God who is omnipresent, omniscient and omnipotent; the God who cannot be reduced to a box made of acacia wood overlaid with gold. God hates this because it is no different from creating a new false religion.",
      "pdfLink": "/sermons/KEEPERS_OF_THE_ARK_VS_KEEPERS_OF_THE_TRUTH.pdf",
      "image": "/sermons/KEEPERS_OF_THE_ARK_VS_KEEPERS_OF_THE_TRUTH.png",
      "pages": "4"
    },
    {
      "title": "Loving Like Jesus",
      "summary": "“And he answering said, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy strength, and with all thy mind; and thy neighbour as thyself. And he said unto him, Thou hast answered right: this do, and thou shalt live. But he, willing to justify himself, said unto Jesus, And who is my neighbour?” (Luke 10:27-29). “A new commandment I give unto you, That ye love one another; as I have loved you, that ye also love one another.” (John 13:34). “This is my commandment, That ye love one another, as I have loved you.” (John 13:34) There are two categories of people Jesus commanded us to love unconditionally after God: our neighbors and the people of God. Sometimes the commandments that appear to be the easiest to understand turn out to be the hardest to implement. Let us go back to the basics of God: “And we have known and believed the love that God hath to us. God is love; and he that dwelleth in love dwelleth in God, and God in him” (I John 4:16). The question is: have we known and believed the love that God hath to us? In other words, we cannot love others if we have not experienced the love of the Lord Jesus Christ. What was the overpowering force that drew the apostles to leave everything and follow Jesus? What is the power that still attracts millions worldwide to follow Jesus? The answer is his love.",
      "pdfLink": "/sermons/LOVING_LIKE_JESUS.pdf",
      "image": "/sermons/LOVING_LIKE_JESUS.png",
      "pages": "3"
    },
    {
      "title": "They that Feared the Lord",
      "summary": "“Then they that feared the LORD spake often one to another: and the LORD hearkened, and heard it, and a book of remembrance was written before him for them that feared the LORD, and that thought upon his name.” (Malachi 3:16). Today, I feel like David with a burden for the young in particular, without neglecting the not so young. “Come, ye children, hearken unto me: I will teach you the fear of the LORD” (Psalm 34:11). Notice firstly that David desired to teach the fear of the Lord. This means that the fear of the Lord does not come on its own but must be taught. Who can teach the fear of the Lord, then? The answer is those who have been taught the fear of the Lord by others and continue to live in the fear of the Lord; individuals such as David. David in turn learned the fear of God through his own mighty experiences in the fields of Bethlehem and under holy men of God such as Samuel and Nathan. Malachi 3:16 states that “they that feared the Lord spake often one to another”. Fear of the Lord is developed through fellowship where the Lord Jesus Christ is the center and the subject of discussion. Why does the church gather together? Simply because by talking often about the Lord we will increase in the fear of the Lord. If you are a regular churchgoer, lift up your hands and thank the good Lord for this blessed habit. It is not a small matter to be called a God-fearer.",
      "pdfLink": "/sermons/THEY_THAT_FEARED_THE_LORD.pdf",
      "image": "/sermons/THEY_THAT_FEARED_THE_LORD.png",
      "pages": "4"
    },
    {
      "title": "The Challenge of Atheism",
      "summary": "“For the invisible things of him from the creation of the world are clearly seen, being understood by the things that are made, even his eternal power and Godhead; so that they are without excuse.” (Romans 1:20). A good study will always set the stage by defining the subject. The Encyclopedia Britannica has the following entry about atheism: “Atheism, in general, is the critique and denial of metaphysical beliefs in God or spiritual beings. As such, it is usually distinguished from theism, which affirms the reality of the divine and often seeks to demonstrate its existence. Atheism is also distinguished from agnosticism, which leaves open the question whether there is a god or not, professing to find the questions unanswered or unanswerable.“ In other words, atheism is also a belief: one which professes with certainty that God  does not exist. This is precisely where the problem of atheism lies – it is a belief with no evidence to support its claims. In other words, atheism is guilty of the same charge it levels against belief in God; it is also sustained by faith.",
      "pdfLink": "/sermons/THE_CHALLENGE_OF_ATHEISM.pdf",
      "image": "/sermons/THE_CHALLENGE_OF_ATHEISM.png",
      "pages": "5"
    },
    {
      "title": "Did Jesus Come with a Divine or Human Body",
      "summary": "“And the Word was made flesh, and dwelt among us, (and we beheld his glory, the glory as of the only begotten of the Father,) full of grace and truth.” (John 1:14 ). The origin of the body of the Lord Jesus Christ is a matter of salvation. Jesus came into this world with a flesh which had its source in the Word of God – heavenly flesh. To believe that the Lord Jesus’ body was of an earthly, human, dust origin diminishes his glory and distorts the Lord’s work of salvation. In what follows, I will address a few objections raised against what is generally referred to as “divine flesh” or “heavenly flesh” doctrine.",
      "pdfLink": "/sermons/DID_JESUS_COME_WITH_A_DIVINE_OR_HUMAN_BODY.pdf",
      "image": "/sermons/DID_JESUS_COME_WITH_A_DIVINE_OR_HUMAN_BODY.png",
      "pages": "4"
    },
    {
      "title": "A Bible Study on Jewelry",
      "summary": "“In like manner also, that women adorn themselves in modest apparel, with shamefacedness and sobriety; not with broided hair, or gold, or pearls, or costly array;” (1Timothy 2:9). “Whose adorning let it not be that outward adorning of plaiting the hair, and of wearing of gold, or of putting on of apparel; But let it be the hidden man of the heart, in that which is not corruptible, even the ornament of a meek and quiet spirit, which is in the sight of God of great price. For after this manner in the old time the holy women also, who trusted in God, adorned themselves, being in subjection unto their own husbands: For after this manner in the old time the holy women also, who trusted in God, adorned themselves, being in subjection unto their own husbands:” (1 Peter 3:3-5). The Apostles Peter and Paul appear to say the same thing about the wearing of gold, silver and other jewelry. Simply stated, they prohibit the wearing of jewelry for God-fearing Christians. There are two main arguments they employ – God is more concerned with the “inner or hidden man” and, secondly, the choice not to wear jewelry demonstrates submission to God’s order.",
      "pdfLink": "/sermons/A_BIBLE_STUDY_ON_JEWELRY.pdf",
      "image": "/sermons/A_BIBLE_STUDY_ON_JEWELRY.png",
      "pages": "4"
    },
    {
      "title": "Why we Need the Holy Spirit",
      "summary": "“I am not able to bear all this people alone, because it is too heavy for me. And if thou deal thus with me, kill me, I pray thee, out of hand, if I have found favour in thy sight; and let me not see my wretchedness. And I will come down and talk with thee there: and I will take of the spirit which is upon thee, and will put it upon them; and they shall bear the burden of the people with thee, that thou bear it not thyself alone.” (Numbers 11:14-15,17). What spirit was upon Moses? The answer is the Spirit of God! Who would not want to have the Spirit of God that guided Moses? Moses was overwhelmed by the constant complaints and grumbling from the children of Israel who numbered about 2 million souls in total. God’s solution was to take the same Spirit that was upon Moses and share it with 70 elders. God wants more people to be filled with his Spirit. We cannot be happy with a few souls filled with the Holy Spirit in the church – the more souls filled the easier the path to heaven! We need our children to be filled with the Holy Spirit also. Today’s youth are being burdened with sins which earlier generations of youth have been shielded from. Like Moses they too feel the wear and tear of the stress and sin of the world invading their private spaces.",
      "pdfLink": "/sermons/WHY_WE_NEED_THE_HOLY_SPIRIT.pdf",
      "image": "/sermons/WHY_WE_NEED_THE_HOLY_SPIRIT.png",
      "pages": "4"
    },
    {
      "title": "The Christian and Smoking",
      "summary": "“What? know ye not that your body is the temple of the Holy Ghost which is in you, which ye have of God, and ye are not your own? For ye are bought with a price: therefore glorify God in your body, and in your spirit, which are God's.” (1Cor 6:19-20). According to the Apostle Paul, our bodies are not our own; they belong to the Lord Jesus Christ. The price the Lord paid is his own blood. Since our bodies are borrowed from the Lord, we need to seek his counsel in all things regarding the Christian body. Our topic today is smoking. Fortunately, although it took several decades, even the secular world understands the dangers of smoking. Cigarette packets by law display the warning “Smoking kills”. Someone has said that smoking is slow suicide. Paul declared the body to be the temple of the Holy Ghost. “If any man defile the temple of God, him shall God destroy; for the temple of God is holy, which temple ye are” (I Cor 3:17). There is a tragic incident recorded in the Old Testament which underscores this truth. The sons of Aaron, the high priest, were drunk and offered “strange incense” or smoke which the Lord had not commanded. They were instantly killed for defiling the temple of God.(Lev 10:1). To smoke cigarettes, weed and other habit-forming intoxicants is no different than what Nadab and Abihu did.",
      "pdfLink": "/sermons/THE_CHRISTIAN_AND_SMOKING.pdf",
      "image": "/sermons/THE_CHRISTIAN_AND_SMOKING.png",
      "pages": "3"
    },
    {
      "title": "Church Planting and Building in Europe",
      "subTitle": "A Multicultural Approach: the importance of native languages",
      "summary": "“And this gospel of the kingdom shall be preached in all the world for a witness unto all nations; and then shall the end come.” (Matthew 24:14). Why was the Law of Moses not intended for one nation, Israel, alone? The reason is because the Law did not provide salvation, it was the shadow of the Gospel of the Lord Jesus Christ through whom salvation was extended. “But before faith came, we were kept under the law, shut up unto the faith which should afterwards be revealed. Wherefore the law was our schoolmaster to bring us unto Christ, that we might be justified by faith. But after that faith is come, we are no longer under a schoolmaster” (Galatians 3:23-25). Once the Sun rises, the shadow recedes and disappears. Similarly, salvation through the Lord Jesus Christ is universal; it is for the entire world. It was for this reason that the Lord himself spoke first on the Day of Pentecost in all the languages of the world. This was a declaration of intent: the Lord Jesus preached salvation in the tongues of the world to enunciate a new era – one in which there are no shadows anymore, but authentic salvation for all of humanity.",
      "pdfLink": "/sermons/CHURCH_PLANTING_AND_BUILDING_IN_EUROPE.pdf",
      "image": "/sermons/CHURCH_PLANTING_AND_BUILDING_IN_EUROPE.png",
      "pages": "3"
    },
    {
      "title": "The International Call of Abraham",
      "summary": "“Neither shall thy name any more be called Abram, but thy name shall be Abraham; for a father of many nations have I made thee.” (Genesis 17:5). “Seeing that Abraham shall surely become a great and mighty nation, and all the nations of the earth shall be blessed in him?” (Genesis 18:18). We mistakenly think that Abraham was a Jew and the father of Israel alone. It comes as a surprise to some that Abraham was a Syrian. “And thou shalt speak and say before the LORD thy God, A Syrian ready to perish was my father, and he went down into Egypt, and sojourned there with a few, and became there a nation, great, mighty, and populous.”(Deuteronomy 26:5). Abraham was a Syrian who abandoned his country and ethnic roots because God offered him an infinitely grander vision – to become the father of many nations. In this respect, Abraham was unique – he was the first to do this. Had he chosen to be a Syrian, the best he could hope to achieve was to be a father of perhaps one Syrian tribe. Thankfully, he chose the vision of God – an international vision.",
      "pdfLink": "/sermons/THE_INTERNATIONAL_CALL_OF_ABRAHAM.pdf",
      "image": "/sermons/THE_INTERNATIONAL_CALL_OF_ABRAHAM.png",
      "pages": "3"
    },
    {
      "title": "What the Bible Says About Hinduism - II",
      "summary": "In part one I introduced key Hindu concepts with much of the study revolving around familiarizing ourselves with various aspects of this religion. The study of the concept of God and amorality as an attribute comprised the fulcrum. I will delineate this present study to the topic of the three paths to salvation moksha in Hinduism and later compare this to the Christian Biblical perspective. Although there are three paths to salvation in Hinduism, many Gurus today, have advocated a fourth path which essentially is an amalgam or syncretisation of the first three.",
      "pdfLink": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_HINDUISM_PART_TWO.pdf",
      "image": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_HINDUISM_PART_TWO.png",
      "pages": "5"
    },
    {
      "title": "What the Bible Says About Hinduism - I",
      "summary": "“Hinduism has no single historical founder, no unified system of belief, no single doctrine of salvation and no centralized authority. In this sense it is different from other world religions.”(Warrier in Partridge 2005:134) The term Hinduism itself is a nineteenth century designation; however, archaeological excavations trace it back to the Indus Valley civilization (2500-1500 BC). The next 2000 years were dominated by the Aryans from whose writings, the Vedas – written in Sanskrit - much of Hinduism is based and evolved. Today there are over 900 million Hindus in the world making it the third largest religion in the world with the majority residing in India but due to migration patterns many have moved to the West. The origin of the caste-system, a highly controversial subject in India and much of the world, traces its origins to this period of the Vedas. The Vedas contained rituals prescribing various offerings to diverse gods. Those consecrated to perform them were the Brahmins or priests who assumed the highest position in the hierarchy. After them came the Kshatriyas (warriors or rulers), Vaishyas (merchants and commoners) and finally the Sudras (untouchables).",
      "pdfLink": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_HINDUISM_PART_ONE.pdf",
      "image": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_HINDUISM_PART_ONE.png",
      "pages": "8"
    },
    {
      "title": "What the Bible Says About Buddhism",
      "summary": "Around the 5th century BC, a child was born to a King in northern India. He was given the name Siddhartha Gautama and a prophecy accompanied his birth. The prophecy declared that the boy would become either a great King or a great religious figure. His father determined he would be a great King and gave strict orders for the boy to be shielded from experiencing anything that would lead him to seek answers in religion. The boy grew up living an artificial life – smiles, happiness and harmony met his gaze wherever he went within the confines of the palace and surrounding areas. One day, the story goes, the young prince, who was now twenty-five years old, asked his charioteer what lay beyond the walls that surrounded the palace. His charioteer tried to dissuade him but the young prince was determined and so they secretly rode out into the real world. He was shocked to see, for the first time in his life, an old person, a sick person, a corpse, and finally, someone attempting to follow a spiritual path. These events so overwhelmed his senses that he secretly decided to leave everything he had, including his wife and child. He was determined to find answers to the problem of suffering (Sanskrit: Dukkha). We will pick up the thread of Siddhartha’s spiritual quest later. Let us first grapple with the issues that led the young prince to abandon his privileged life.",
      "pdfLink": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_BUDDHISM.pdf",
      "image": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_BUDDHISM.png",
      "pages": "5"
    },
    {
      "title": "What the Bible Says About Islam - II",
      "summary": "The first part of this Bible study considered the name and identity of God in the Bible and Islam. This Bible study will concern itself with the topic of salvation in the Bible and Islam. What does it mean to be saved from a religious perspective? Both Christians and Muslims will agree that we are saved from something, and that something is sin, death and hell. Furthermore, this salvation also implies, on the most rudimentary level, that we will live in heaven with God Almighty forever. This is where the similarity between the two religions ends. From time immemorial, humans have realized the wretched condition of this world and looked to the throne of God in heaven for deliverance and salvation. “Now when they heard this, they were pricked in their heart, and said unto Peter and to the rest of the apostles, Men and brethren, what shall we do?” Act 2:37",
      "pdfLink": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_ISLAM_PART_TWO.pdf",
      "image": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_ISLAM_PART_TWO.png",
      "pages": "4"
    },
    {
      "title": "What the Bible Says About Islam - I",
      "summary": "“And I appeared unto Abraham, unto Isaac, and unto Jacob, by the name of God Almighty, but by my name JEHOVAH was I not known to them.”(Exodus 6:3) ”That men may know that thou, whose name alone is JEHOVAH, art the most high over all the earth.”(Psalm 83:18). The first and main difference between the Bible and Islam is the name of God. In the verses above, the God of Abraham, Isaac and Jacob declares that his name is Jehovah. Jehovah has several shades of meaning, among which are the self-sufficient one and the eternal one. We do not find this name in the Quran. The deity of Islam is exclusively called Allah. The Quran states, “Allah! There is no Allah save Him. His are the most beautiful names” (Surah 20:8). Allah comes from the definite article al- “the” and ilāh “deity, god” combined to al-lāh meaning “the deity”, or “the God” in Arabic. Since the God of the Bible never used the name Allah, Bible believers conclude that this name describes and belongs to a foreign deity that Moses and the children of Israel never knew. Generally, knowing a person’s name is the first act in human relationships. God first mentioned the name of Moses twice at the burning bush (Exodus 3:4), and Moses asked God his name: “And Moses said unto God, Behold, when I come unto the children of Israel, and shall say unto them, The God of your fathers hath sent me unto you; and they shall say to me, What is his name? what shall I say unto them?” (Exodus 3:13). God graciously revealed his exclusive personal name to Moses in Exodus 6:3 – Jehovah. Why is the name of God important? The answer has to do with deliverance.",
      "pdfLink": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_ISLAM_PART_ONE.pdf",
      "image": "/sermons/WHAT_THE_BIBLE_SAYS_ABOUT_ISLAM_PART_ONE.png",
      "pages": "5"
    },
    {
      "title": "What do you Think of Jesus?",
      "summary": "“When Jesus came into the coasts of Caesarea Philippi, he asked his disciples, saying, Whom do men say that I the Son of man am? And they said, Some say that thou art John the Baptist: some, Elias; and others, Jeremias, or one of the prophets. He saith unto them, But whom say ye that I am? ”(Matt 16:13-15) ”That men may know that thou, whose name alone is JEHOVAH, art the most high over all the earth.”(Psalm 83:18). The first and main difference between the Bible and Islam is the name of God. In the verses above, the God of Abraham, Isaac and Jacob declares that his name is Jehovah. Jehovah has several shades of meaning, among which are the self-sufficient one and the eternal one. We do not find this name in the Quran. The deity of Islam is exclusively called Allah. The Quran states, “Allah! There is no Allah save Him. His are the most beautiful names” (Surah 20:8). Allah comes from the definite article al- “the” and ilāh “deity, god” combined to al-lāh meaning “the deity”, or “the God” in Arabic. Since the God of the Bible never used the name Allah, Bible believers conclude that this name describes and belongs to a foreign deity that Moses and the children of Israel never knew. Generally, knowing a person’s name is the first act in human relationships. God first mentioned the name of Moses twice at the burning bush (Exodus 3:4), and Moses asked God his name: “And Moses said unto God, Behold, when I come unto the children of Israel, and shall say unto them, The God of your fathers hath sent me unto you; and they shall say to me, What is his name? what shall I say unto them?” (Exodus 3:13). God graciously revealed his exclusive personal name to Moses in Exodus 6:3 – Jehovah. Why is the name of God important? The answer has to do with deliverance.",
      "pdfLink": "/sermons/WHAT_DO_YOU_THINK_OF_JESUS.pdf",
      "image": "/sermons/WHAT_DO_YOU_THINK_OF_JESUS.png",
      "pages": "3"
    },
    {
      "title": "Hold on to the Scarlet Thread",
      "summary": "“Behold, when we come into the land, thou shalt bind this line of scarlet thread in the window which thou didst let us down by: and thou shalt bring thy father, and thy mother, and thy brethren, and all thy father's household, home unto thee.”(Joshua 2:18) Rahab was called a harlot. In ancient times, harlots were also innkeepers engaged in the business of lodging and not prostitution necessarily. This information is important because the Israeli spies were not in the land for lust and physical pleasures, but on a holy mission. An inn (modern day motels/hotels) were public spaces where the spies could gather important information, hence a strategic location. However, these spies clearly were not professional or discrete enough because their cover was blown. “And it was told the king of Jericho, saying, Behold, there came men in hither to night of the children of Israel to search out the country” (Joshua 2:2). Here is where the great faith of Rahab is triggered.",
      "pdfLink": "/sermons/HOLD_ON_TO_THE_SCARLET_THREAD.pdf",
      "image": "/sermons/HOLD_ON_TO_THE_SCARLET_THREAD.png",
      "pages": "3"
    },
    {
      "title": "Here I am, Send me!",
      "summary": "“In the year that king Uzziah died I saw also the Lord sitting upon a throne, high and lifted up, and his train filled the temple.”(Isaiah 6:1). The ministry of Isaiah was put on hold until Uzziah the king died. Could it be that some of us cannot give ourselves fully to the Lord because some Uzziah in our lives is still living? Uzziah was the same king who did well in the eyes of God initially, but soon became lifted up in his heart and offered incense in the Temple which was the priests’ duty alone. God struck him with leprosy until he died. “And Uzziah the king was a leper unto the day of his death, and dwelt in a several house, being a leper; for he was cut off from the house of the LORD: and Jotham his son was over the king's house, judging the people of the land” (2Chron 26:21). Uzziah was king although he was a leper and Isaiah was a prophet although he was a man of unclean lips. This was a time in Israel when the king and prophet were paralyzed by their sins. Could it be that while we call ourselves Christians, pastors etc. in the church, we are actually paralyzed by our sins to be effective for the Lord Jesus Christ? If so, let us not be ashamed today to say to the Lord like Isaiah, “Here am I; send me” (Isaiah 6:8).",
      "pdfLink": "/sermons/HERE_I_AM_SEND_ME.pdf",
      "image": "/sermons/HERE_I_AM_SEND_ME.png",
      "pages": "4"
    },
    {
      "title": "Serving God, Saving the King",
      "summary": "“Now when Daniel knew that the writing was signed, he went into his house; and his windows being open in his chamber toward Jerusalem, he kneeled upon his knees three times a day, and prayed, and gave thanks before his God, as he did aforetime.”(Daniel 6:10). Daniel had been promoted. No one was more powerful than him in the Kingdom of Babylon except King Darius. Promotion and blessing brings envy also. The other Babylonian princes were not just happy to bring dishonor to Daniel, they wanted to destroy him completely. The reason is twofold: Daniel was appointed over them not just in position, but to ensure everyone paid their taxes and dispensed of their responsibilities. “And over these three presidents; of whom Daniel was first: that the princes might give accounts unto them, and the king should have no damage” (Daniel 6:2). Despite his exalted stature, and old age (he was over 80 years old), he would kneel down three times a day to pray to the God. Kneeling down is the posture of a beggar. It was begging God that always blessed and delivered Daniel from the capricious heathen Kings of Babylon. The scripture states that the “writing was signed”. In other words, praying to the God of Israel was now a state crime punishable by death. What can give a person the courage to accept the death sentence? Why will a man who was President of Babylon throw away everything to become lion food?",
      "pdfLink": "/sermons/SERVING_GOD_SAVING_THE_KING.pdf",
      "image": "/sermons/SERVING_GOD_SAVING_THE_KING.png",
      "pages": "3"
    },
    {
      "title": "The Plague Stopped at Calvary",
      "summary": "“When thou takest the sum of the children of Israel after their number, then shall they give every man a ransom for his soul unto the LORD, when thou numberest them; that there be no plague among them, when thou numberest them. This they shall give, every one that passeth among them that are numbered, half a shekel after the shekel of the sanctuary: (a shekel is twenty gerahs:) an half shekel shall be the offering of the LORD.”(Exodus 30:12-13). God is the source of every living soul. “And the LORD God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul” (Genesis 2:7). As such, anyone who wishes to count the souls of the people of God must acknowledge God’s ownership and Lordship over the souls of his people. Only God can give the order to number his people. In fact, an entire book, the fourth Book of Moses, is called the Book of Numbers because God ordered Moses to take a census of Israel twice in the desert. “Take ye the sum of all the congregation of the children of Israel, after their families, by the house of their fathers, with the number of their names, every male by their polls” (Numbers 1:2). Let us rejoice and take comfort in the fact that we are numbered among the people of God! Not only does the Lord Jesus know the precise number of his people, but the precise number of hairs on our heads. “But even the very hairs of your head are all numbered. Fear not therefore: ye are of more value than many sparrows” (Luke 12:7). If the people of God are counted, an offering of half a shekel per head must be given to the Temple as an acknowledgement of God’s ownership of the soul",
      "pdfLink": "/sermons/THE_PLAGUE_STOPPED_AT_CALVARY.pdf",
      "image": "/sermons/THE_PLAGUE_STOPPED_AT_CALVARY.png",
      "pages": "3"
    },
    {
      "title": "God’s Word – Our Daily Bread from Heaven",
      "summary": "“Give us day by day our daily bread.” (Luke 11:3). “Then said the LORD unto Moses, Behold, I will rain bread from heaven for you; and the people shall go out and gather a certain rate every day, that I may prove them, whether they will walk in my law, or no.” (Exodus 16:4). When the Lord Jesus told us to pray, “Give us day by day our daily bread”, the Jews who heard him no doubt thought about the miracle of the manna in the wilderness. The Lord Jesus was not just talking about earthly food, but the Word of God which is more important than our physical sustenance. One reason the prophet Job is mentioned as one of three righteous men on the earth is because he esteemed the Word of God more than physical nourishment. “Neither have I gone back from the commandment of his lips; I have esteemed the words of his mouth more than my necessary food” (Job 23:12). Let us meditate on the importance of the Word of God to motivate us to be like Job. Humans look below to the earth for food, but God thought the children of Israel to look heavenward every day for their physical food. “And when the children of Israel saw it, they said one to another, It is manna: for they wist not what it was. And Moses said unto them, This is the bread which the LORD hath given you to eat.” (Exodus 16:15) “For the bread of God is he which cometh down from heaven, and giveth life unto the world. Then said they unto him, Lord, evermore give us this bread. And Jesus said unto them, I am the bread of life: he that cometh to me shall never hunger; and he that believeth on me shall never thirst.” (John 6:33-35) Let us say with those Jews, “Lord, evermore give us this bread”.",
      "pdfLink": "/sermons/GODS_WORD__OUR_DAILY_BREAD_FROM_HEAVEN.pdf",
      "image": "/sermons/GODS_WORD__OUR_DAILY_BREAD_FROM_HEAVEN.png",
      "pages": "3"
    },
    {
      "title": "Six Reasons why the Mystery of Godliness is Great",
      "summary": "“And without controversy great is the mystery of godliness: God was manifest in the flesh, justified in the Spirit, seen of angels, preached unto the Gentiles, believed on in the world, received up into glory.”(1Timothy 3:16). The first reason is because God was manifest in flesh. This is astonishing because God did not take on the form of any other creature except ours. “For verily he took not on him the nature of angels; but he took on him the seed of Abraham” (Hebrews 2:16). This is why humans must behold the God who was manifest in flesh. Shepherds in Bethlehem, wise men from the East, religious scribes, and even an evil King, such as Herod, all had one common interest in the greatest news flash in the history of the world: God was manifest in the flesh. Go and see him! John the Baptist shouted “Behold the Lamb of God!” We must all see him spiritually speaking and acknowledge that he is God manifest in the flesh. Why? Because he came in our form – the Almighty God who fills the universe, whom heaven and earth cannot contain, put on flesh and blood for our sakes. He conferred this honor upon us, hence we must behold him. In other words, because God was manifest in flesh, everyone who is in the form of flesh, must leave everything – as the shepherds and wise men were commanded – and run to Bethlehem to behold him and give him gifts to thank him and bless him because he came to save us.",
      "pdfLink": "/sermons/SIX_REASONS_WHY_THE_MYSTERY_OF_GODLINESS_IS_GREAT.pdf",
      "image": "/sermons/SIX_REASONS_WHY_THE_MYSTERY_OF_GODLINESS_IS_GREAT.png",
      "pages": "3"
    },
    {
      "title": "Encouraging Manoah",
      "summary": "“And Manoah said unto his wife, We shall surely die, because we have seen God. But his wife said unto him, If the LORD were pleased to kill us, he would not have received a burnt offering and a meat offering at our hands, neither would he have shewed us all these things, nor would as at this time have told us such things as these.”(Judges 13:22-23). The marriage of Job and the marriage of Manoah were both founded on faith and righteousness. They loved God and were faithful in every way until both houses received supernatural visitation. It is a paradox that Christian marriages can be strong and stable until the supernatural intervenes. In the case of Job, it was Satan who intervened violently, while an angel of God visited the house of Manoah. In the case of Job’s house, his wife crumbled under the pressure. “Then said his wife unto him, Dost thou still retain thine integrity? curse God, and die” (Job 2:9). The roles were reversed in Manoah’s household – the angel’s visitation brought a mortal fear upon him and he was certain the two of them would die, but his wife countered with 3 powerful arguments. She was certain that God sent the angel to bless them, which we will consider more carefully later. May I ask us all to reflect on the above for a moment! We look to heaven and mention heaven often in our walk with the Lord Jesus Christ, but what will a visitation from heaven reveal about our faith and love of God? The Bible is full of mixed responses when angels appeared to the people of God: Jacob recognized the angel at Peniel as an opportunity and an invitation to change his character forever while Zachariah, the father of John the Baptist, was struck with muteness because of his unbelief. What will heaven reveal about your faith whether you are married or single?",
      "pdfLink": "/sermons/ENCOURAGING_MANOAH.pdf",
      "image": "/sermons/ENCOURAGING_MANOAH.png",
      "pages": "3"
    },
    {
      "title": "The Unsaved in Bible Prophecy",
      "summary": "“And Cush begat Nimrod: he began to be a mighty one in the earth. He was a mighty hunter before the LORD: wherefore it is said, Even as Nimrod the mighty hunter before the LORD. Gen 10:10 And the beginning of his kingdom was Babel, and Erech, and Accad, and Calneh, in the land of Shinar.”(Gen 10:8-10). We have looked at Bible end time prophecy in relation to Israel and the church. This Bible study will consider the events prophesied concerning the world alone. By the world, I mean those who rebel against the Gospel of Jesus Christ, the unsaved. They too have a covenant with God – sadly a terrible one. Our hope and prayer is that unsaved individuals will read this message and make peace with the Creator and Savior of their souls, the Lord Jesus Christ.",
      "pdfLink": "/sermons/THE_UNSAVED_IN_BIBLE_PROPHECY.pdf",
      "image": "/sermons/THE_UNSAVED_IN_BIBLE_PROPHECY.png",
      "pages": "4"
    },
    {
      "title": "The Church in God’s Prophetic Plan",
      "summary": "The church is God’s body on earth. God had planned from eternity to create a people who would be made in his image and have his moral character. “So God created man in his own image, in the image of God created he him; male and female created he them” (Genesis 1:27). However, the image this scripture speaks about is not one of dust. God was looking ahead into the time he would put on flesh and blood made of his own word and Spirit. “Nevertheless death reigned from Adam to Moses, even over them that had not sinned after the similitude of Adam's transgression, who is the figure of him that was to come” (Romans 5:14). Our focus today is not the nature of God’s church, but its destiny, so let us explore scriptures that broach this subject. Nevertheless, let every Christian know that his or her main assignment in this world, besides bringing people to salvation, is to testify to the prophetic events that point to the return of the Lord. We are the children of Issachar whose job it was to interpret the signs of the times for the children of Israel.",
      "pdfLink": "/sermons/THE_CHURCH_IN_GOD_S_PROPHETIC_PLAN.pdf",
      "image": "/sermons/THE_CHURCH_IN_GOD_S_PROPHETIC_PLAN.png",
      "pages": "3"
    },
    {
      "title": "Israel: A Sign for the Nations",
      "summary": "“Now learn a parable of the fig tree; When his branch is yet tender, and putteth forth leaves, ye know that summer is nigh: So likewise ye, when ye shall see all these things, know that it is near, even at the doors.”(Mat 24:32-33). King Frederick the Great of Prussia (1712-1786) once asked his physician for proof of the existence of God. The physician is famously reported to have said, “Your Majesty, the continued existence of the Jews”. Against all odds, the Jewish nation has persevered despite persecution that at times reached genocidal proportions in various countries. Antisemitism is considered to be the world’s most successful hatred. It is unique in the annals of history because the Jews appear to be the only people whom sworn enemies in different eras had vowed to eliminate collectively as a people. Pharaoh, Haman, Hitler and Nasser of Egypt are some of the most prominent, but there were countless others with similar ambitions. Why has Satan so hated this people? The answer is simple, and provided by the Lord Jesus Christ himself. “Ye worship ye know not what: we know what we worship: for salvation is of the Jews” (John 4:22). The Law, the prophets, Psalms and the New Testament emanated from Israel. When the fullness of time came (Galatians 4:4), God sent forth his Son from Israel to save the nations. The 12 apostles were Jews and Jesus will return to Israel from where he will rule the nations with a rod of iron (Revelation 12:5). Let us follow the spiritual history of this nation and its message for us who look for the return of Christ.",
      "pdfLink": "/sermons/ISRAEL_A_SIGN_FOR_THE_NATIONS.pdf",
      "image": "/sermons/ISRAEL_A_SIGN_FOR_THE_NATIONS.png",
      "pages": "5"
    },
    {
      "title": "Come, Examine the Pierced Heart of Jesus!",
      "summary": "“Then came the soldiers, and brake the legs of the first, and of the other which was crucified with him. But when they came to Jesus, and saw that he was dead already, they brake not his legs.”(John 19:32-33). God was manifested in flesh to die for our sins. God commissioned Roman soldiers to ensure that his body indeed was dead. Few were better trained to kill than Roman soldiers. Therefore, if anyone was competent in confirming an individual’s death, it was Roman soldiers. The Sabbath began at 6 p.m. on Friday and was only 3 hours away, so the Pharisees and their accomplices requested the death of the crucified, and their bodies buried before the Sabbath rest commenced. According to one report about ancient crucifixion methods: “The feet were nailed to the upright part of the crucifix, so that the knees were bent at around 45 degrees. To speed death, executioners would often break the legs of their victims to give no chance of using their thigh muscles as support. It was probably unnecessary, as their strength would not have lasted more than a few minutes even if they were unharmed.1“ John records that Jesus was already dead, so the soldiers did not break his legs. While the others clung to this world and earthly life, the Lord Jesus happily embraced death for our sakes.",
      "pdfLink": "/sermons/COME_PIERCE_THE_HEART_OF_JESUS.pdf",
      "image": "/sermons/COME_PIERCE_THE_HEART_OF_JESUS.png",
      "pages": "4"
    },
    {
      "title": "Work Out Your Own Salvation",
      "summary": "“Wherefore, my beloved, as ye have always obeyed, not as in my presence only, but now much more in my absence, work out your own salvation with fear and trembling. For it is God which worketh in you both to will and to do of his good pleasure.”(Philippians 2:12-13). James Strong defines “work out” in the following manner: κατεργάζομαι katergázomai, kat-er-gad'-zom-ahee; from G2596 and G2038; to work fully, i.e. accomplish; by implication, to finish, fashion:—cause, to (deed), perform, work (out). One can liken salvation to a package that contains instructions to navigate and negotiate the challenges in this world with the aim of making it to heaven. There is only one salvation accomplished by the Lord Jesus Christ through his divine identity and atonement for our sins at Golgotha. “And being made perfect, he became the author of eternal salvation unto all them that obey him” (Hebrews 5:9). The Lord Jesus accomplished his work of collective salvation when he died on the Cross, gave up the ghost, and said, “It is finished” (John 19:30). However, each one of us will find that the package of salvation leads us on unique paths that sometimes overlap, but often diverge. Hence, the words of the Apostle Paul, “work out your own salvation with fear and trembling”. In fact, much of the Bible is a compilation of individuals who worked out their own salvation, and, according to Hebrews 11:2 “obtained a good report”. Let us consider some of these individuals and the way they worked out their own salvation and be inspired.",
      "pdfLink": "/sermons/WORK_OUT_YOUR_OWN_SALVATION.pdf",
      "image": "/sermons/WORK_OUT_YOUR_OWN_SALVATION.png",
      "pages": "4"
    },
    {
      "title": "The Power That Draws and Keeps in Church",
      "summary": "“And I, if I be lifted up from the earth, will draw all men unto me. This he said, signifying what death he should die”(John 12:32-33). There is a power, an infinite and unstoppable power, which draws and keeps us in the church. This power is the same power that raised up the body of the Lord Jesus Christ from the dead. This power is the power of the Holy Spirit of Jesus. Are you struggling to go to church? Are you struggling to stay in church on a regular basis? Then this message is for you – look to the resurrected Lord Jesus Christ who draws by his Holy Spirit and will sustain your church life until he returns.",
      "pdfLink": "/sermons/THE_POWER_THAT_DRAWS_AND_KEEPS_IN_CHURCH.pdf",
      "image": "/sermons/THE_POWER_THAT_DRAWS_AND_KEEPS_IN_CHURCH.png",
      "pages": "4"
    },
    {
      "title": "Chosen by God and Responding to His Choosing",
      "summary": "“Ye have not chosen me, but I have chosen you, and ordained you, that ye should go and bring forth fruit, and that your fruit should remain: that whatsoever ye shall ask of the Father in my name, he may give it you.” (John15:16). Let these words sink into our souls:God has chosen us. What an amazing statement!If we had chosen the Lord Jesus, there is always the danger we may reject him in favor of other gods. However, the good news is that because he has chosen us, he will cleave to us and cause us to cleave to him. “But I have prayed for thee, that thy faith fail not: and when thou art converted, strengthen thy brethren”(Luke 22:32). Is there anything in the entire universe more powerful than the prayers of Jesus?Let us say together, “nothing”! Fear not! We have the power of the prayers of Jesus guiding us towards heaven. My intention in this message is to analyze the various reasons that people respond to the call of God, and let this reflection help us to appreciate God’s call on our lives.",
      "pdfLink": "/sermons/CHOSEN_BY_GOD_AND_RESPONDING_TO_HIS_CHOOSING.pdf",
      "image": "/sermons/CHOSEN_BY_GOD_AND_RESPONDING_TO_HIS_CHOOSING.png",
      "pages": "4"
    },
    {
      "title": "Preaching Until the Seventh Day",
      "summary": "“Of every clean beast thou shalt take to thee by sevens, the male and his female: and of beasts that are not clean by two, the male and his female. Of fowls also of the air by sevens, the male and the female; to keep seed alive upon the face of all the earth.” (Genesis 7:2-3). It took 120 years to build the ark. This means that Noah had to explain and preach about the purpose of the ark for 120 years. The closer Noah’s generation approached the day of the flood, the higher the height of the ark.We can be sure that some were irritated by the sight of this massive and strange object that obscured their view,while others decided it was time to approach the architect and inquire about its purpose.In a similar vein, as our generation gets closer to the day of the Lord’s return, they must not fail to hear the Word of God – like the burgeoning ark, the word of God must confront their field of view. “And this gospel of the kingdom shall be preached in all the world for a witness unto all nations; and then shall the end come”(Matthew 24:14). May we share the word of God in such a way that, like Noah’s ark, it will demand a response–some will quarrel with us while others may politely come to gaze at us–but let us pray the word of God will demand a response, Amen!",
      "pdfLink": "/sermons/PREACHING_UNTIL_THE_SEVENTH_DAY.pdf",
      "image": "/sermons/PREACHING_UNTIL_THE_SEVENTH_DAY.png",
      "pages": "4"
    },
    {
      "title": "Modesty in Dress",
      "summary": "“The woman shall not wear that which pertaineth unto a man, neither shall a man put on a woman's garment: for all that do so are abomination unto the LORD thy God.” (Deuteronomy22:5). The Hebrew word for “pertaineth” is kᵊlî. According to James Strong, this word is not limited to clothes alone, but includes anything made or prepared by humans, such as implements, vessels, weapons, bags, carriages, furniture, instruments,jewels, pots, sacks and even other wares/goods. Bible readers have traditionally linked this verse to clothes alone, but God had a much broader list in mind. It is difficult to deny that the further from God society deviates, the more comfortable they become with that which formerly “pertaineth” to the opposite sex. Remember that this “pertaineth” is about that which is made with hands. When God made Adam and Eve he made them distinctly male and female, and he does not look kindly upon anyone who seeks to confuse or obfuscate this distinction.",
      "pdfLink": "/sermons/MODESTY_IN_DRESS.pdf",
      "image": "/sermons/MODESTY_IN_DRESS.png",
      "pages": "4"
    },
    {
      "title": "Many Gifts, One Church",
      "summary": "“And those members of the body, which we think to be less honourable, upon these we bestow more abundant honour; and our uncomely parts have more abundant comeliness.” (1 Corinthians 12:23). We all know that Jacob had 12 sons that they form the 12 tribes of Israel. When God spoke to Pharaoh, he said, “And thou shalt say unto Pharaoh, Thus saith the LORD, Israel is my son, even my firstborn. And I say unto thee, Let my son go, that he may serve me: and if thou refuse to let him go, behold, I will slay thy son, even thy firstborn. (Exodus 4:22, 23). God spoke, not of 12 sons, but one son, Israel. Just as 6000 demons spoke with one voice and one name, “Legion”, God spoke of 2 million souls as one, and with one name, Israel. Can we say together that we are the Apostolic Church of Jesus Christ!",
      "pdfLink": "/sermons/MANY_GIFTS_ONE_CHURCH.pdf",
      "image": "/sermons/MANY_GIFTS_ONE_CHURCH.png",
      "pages": "3"
    },
    {
      "title": "The Last Great Catch of Fish",
      "summary": "“After these things Jesus shewed himself again to the disciples at the sea of Tiberias; and on this wise shewed he himself. There were together Simon Peter, and Thomas called Didymus, and Nathanael of Cana in Galilee, and the sons of Zebedee, and two other of his disciples.” (John 21:1-2).After the resurrection, the Lord came to the Galilee to meet his apostles by the shores of the Galilee. They were six in total. Six represents the day before the Sabbath, a time when the people of God enter into their rest. I believe we are in the sixth day in this time. John does not name two of the apostles. We don’t know why, but this shows we ought not to be disappointed when our names are not mentioned –Jesus knew who they were and they were part of this miracle. “But when the morning was now come, Jesus stood on the shore: but the disciples knew not that it was Jesus.Then Jesus saith unto them, Children, have ye any meat? They answered him, No (John 21:4, 5). We must be very careful; in these last days we may be fishing for souls and fruit for the Lord without his help –in our own strength. Since they did not solicit the help of the Lord, they could not even recognize him.",
      "pdfLink": "/sermons/THE_LAST_GREAT_CATCH_OF_FISH.pdf",
      "image": "/sermons/THE_LAST_GREAT_CATCH_OF_FISH.png",
      "pages": "3"
    },
    {
      "title": "The Mediation Of Christ",
      "summary": "“For there is one God, and one mediator between God and men, the man Christ Jesus” (1 Timothy 2:5). James Strong defines the Greek word mesitēs (mediator) as “one who intervenes between two, either in order to make or restore peace and friendship, or form a compact, or for ratifying a covenant.” Ever since the Fall of Adam and Eve, God has repeatedly tried to reconcile humanity with himself. Let us consider some of the ways he has done this.",
      "pdfLink": "/sermons/THE_MEDIATION_OF_CHRIST.pdf",
      "image": "/sermons/THE_MEDIATION_OF_CHRIST.png",
      "pages": "4"
    },
    {
      "title": "The Urgency of Baptism in Jesus Name",
      "summary": "The Apostle Peter has declared that this earth will be destroyed by unquenchable fire. “But the day of the Lord will come as a thief in the night; in the which the heavens shall pass away with a great noise, and the elements shall melt with fervent heat, the earth also and the works that are therein shall be burned up” (2 Peter 3:10). It is the same Peter who stood up on the Day of Pentecost and commanded, “Then Peter said unto them, Repent, and be baptized every one of you in the name of Jesus Christ for the remission of sins, and ye shall receive the gift of the Holy Ghost” (Acts 2:38). According to Peter, this is how we shall save ourselves from the impending destruction. “And with many other words did he testify and exhort, saying, Save yourselves from this untoward generation” (Acts 2:40). As such, we need to examine the connection between baptism in the name of Jesus and the destruction of which the Apostle Peter warns.",
      "pdfLink": "/sermons/THE_URGENCY_OF_BAPTISM_IN_JESUS_NAME.pdf",
      "image": "/sermons/THE_URGENCY_OF_BAPTISM_IN_JESUS_NAME.png",
      "pages": "3"
    },
    {
      "title": "The Glory of God Revealed to Captives",
      "summary": "[Ezekiel 1:1 Now it came to pass in the thirtieth year, in the fourth month, in the fifth day of the month, as I was among the captives by the river of Chebar, that the heavens were opened, and I saw visions of God.] The children of Israel were captives in exile in Babylon. The glory of God had left the Temple in Jerusalem which was destroyed because of the sins of the people. They sat by the rivers of Babylon, remembered the beautiful Temple of God in Zion, and wept. They even sang of this profound loss in the Book of Psalms( Psa 137:1-5). But now, suddenly, this majestic glory of God comes to Babylon, to the captives who thought God had abandoned them.",
      "pdfLink": "/sermons/THE_GLORY_OF_GOD_REVEALED_TO_CAPTIVES.pdf",
      "image": "/sermons/THE_GLORY_OF_GOD_REVEALED_TO_CAPTIVES.png",
      "pages": "4"
    },
    {
      "title": "Through Faith In The Name Of Jesus",
      "summary": "[Act 3:4-6 And Peter, fastening his eyes upon him with John, said, Look on us. And he gave heed unto them, expecting to receive something of them. Then Peter said, Silver and gold have I none; but such as I have give I thee: In the name of Jesus Christ of Nazareth rise up and walk.] Peter fastened his eyes on the man. Normally, this beggar was used to focusing on the hands of potential givers. The man was lame but he could see. God wanted him to look into the eyes of a man who had seen Jesus for three years. To look into the eyes of Peter is to look into the eyes of Jesus. “Such as I have give I thee.” What does Peter have – let us together declare: “the name of Jesus.” What is it we have today? Have we begun to rely on other things other than Jesus? I pray we still have only Jesus to give to the world today.",
      "pdfLink": "/sermons/THROUGH_FAITH_IN_THE_NAME_OF_JESUS.pdf",
      "image": "/sermons/THROUGH_FAITH_IN_THE_NAME_OF_JESUS.png",
      "pages": "3"
    },
    {
      "title": "The Power Of The One God Doctrine",
      "summary": "[Genesis 3:8 And they heard the voice of the LORD God walking in the garden in the cool of the day: and Adam and his wife hid themselves from the presence of the LORD God amongst the trees of the garden.] As long as Adam and Eve believed that God is one and walked with the word of God (voice of God), they enjoyed paradise and knew no shame, although they were naked. Only those who believe that God is one alone and love the voice of God can stay in God’s paradise. They will not know shame because the power of the one God doctrine will declare us innocent and cover our shame. The first time Adam and Eve heard anyone declare that God is not alone, was from the lying lips of Satan. Our first parents obviously knew that God is one – they met him on a regular basis; his voice and presence was one. Apostolic Christian, please beware, all Satan needs to do to cast us out of paradise is to help us believe in the existence of more than one God. What was the result? When we no longer believe in one God, it is not possible for us to respond to his call. Adam and Eve hid themselves; they could not answer the one God. Thank God we can respond to the call of God today because we believe he is one and alone. Remember that Adam and Eve did not know what fear was before this time. A new emotion, which they had never experienced before, entered their universe – they were filled with fear and trembling.",
      "pdfLink": "/sermons/THE_POWER_OF_THE_ONE_GOD_DOCTRINE.pdf",
      "image": "/sermons/THE_POWER_OF_THE_ONE_GOD_DOCTRINE.png",
      "pages": "4"
    },
    {
      "title": "The Christian and Work",
      "summary": "[1Thessalonians 4:11 And that ye study to be quiet, and to do your own business, and to work with your own hands, as we commanded you.] During the conference in Stockholm last year, I touched on the topic of the Christian and work. The fact is that we all spend most of our working hours, for much of our adult lives, working. Hence, surely, the Bible has something to say about this all-pervasive and encompassing aspect of our lives. Indeed, the Bible has much to say about the subject because the Lord Jesus Christ is also Lord of our jobs. God gave us our first jobs, regulated the number of days we should work and even adopted the trade of a carpenter for perhaps 20 years of his earthly life. The scripture above tells us that the Lord gave commandments about the Christian and work to the apostles. This would mean that the command to work is also an apostolic command, not just Acts 2:38. Let us unpack these and other scriptures that govern the working lives of Christians.",
      "pdfLink": "/sermons/THE_CHRISTIAN_AND_WORK.pdf",
      "image": "/sermons/THE_CHRISTIAN_AND_WORK.png",
      "pages": "3"
    },
    {
      "title": "Loving Others as Christ Loved Us",
      "summary": "[John 13:34 A new commandment I give unto you, That ye love one another; as I have loved you, that ye also love one another.] The world had never experienced the love of Jesus before. Such a love could never exist until the word was made flesh and dwelt among us. This was a new manifestation of God which demonstrated a new love that left all those who received it speechless. This is why the Lord Jesus gives us a new commandment – love one another as he loved us. Christians must give account to Jesus on the Day of Judgment about this new commandment; hence, we will do well to explore it in light of the life of the Lord as recorded by the apostles.",
      "pdfLink": "/sermons/LOVING_OTHERS_AS_CHRIST_LOVED_US.pdf",
      "image": "/sermons/LOVING_OTHERS_AS_CHRIST_LOVED_US.png",
      "pages": "4"
    },
    {
      "title": "The Covid Vaccine  - A Christian Response",
      "summary": "To be effective as Christians, we must provide a Biblical answer to the challenge of  Covid-19.  In  this  case,  specifically  to  the  taking  of  the  vaccine.  Should  a Christian trust in the medical consensus that vaccination is the right thing to do? Or should we avoid the vaccine and simply trust God’s providence? On the internet one can find a multitude of voices on the topic, also from sources that  purport  to  be  Christian.  Some  of  these  are  pro  vaccine,  some  express (justified) doubts, and a small but vocal segment is outright anti-vaccine. The last group is a fertile ground for the wildest opinions. Some of these fall squarely in the camp of what can be called conspiracy theory. Unfortunately for the Christian seeking  honest  information,  many  groups  advocating  these  extreme  positions claim to have the Bible as their inspiration. This familiarity naturally predisposes us to give them the benefit of the doubt, which can lead to negative consequences for the uncritical mind. It is therefore the goal of the Bible study to separate the wheat from the chaff. We  will look at  the  matter as objectively  as  possible, and  apply  our God  given intellect, critical thinking, as well as our faith in the Word of God. It is my hope that with this article, seeking minds will be led in the right direction.",
      "pdfLink": "/sermons/THE_COVID_VACCINE_A_CHRISTIAN_RESPONSE.pdf",
      "image": "/sermons/THE_COVID_VACCINE_A_CHRISTIAN_RESPONSE.png",
      "pages": "28"
    },
    {
      "title": "Returning to the Physical Church After Covid-19",
      "summary": "[Hebrews 10:25 Not forsaking the assembling of ourselves together, as the manner of some is; but exhorting one another: and so much the more, as ye see the day approaching]. The children of Israel never got the opportunity to assemble themselves together in the name of the God of Abraham, Isaac and Jacob in Egypt for 400 years. Imagine being in a lockdown for 400 years and the name of the virus is Pharaoh! Thank God we have digital communication applications such as Zoom which gave us a semblance of church – at least we heard the word of God, prayed and worshipped. Sadly, there was no preaching, exhortation, singing and worship to God for 400 years in Egypt. Pharaoh made sure they never got time to assemble in the name of Jehovah. On the contrary, Pharaoh managed the lives of the Hebrews slaves in such a way that they their energy and waking hours were consumed in building idols and monuments for Pharaoh, such as the city of Ramses (Exodus 1:11). Apostolics must understand the enemy will do everything in his power to stop us from assembling together in the name of Jesus.",
      "pdfLink": "/sermons/RETURNING_TO_THE_PHYSICAL_CHURCH_AFTER_COVID-19.pdf",
      "image": "/sermons/RETURNING_TO_THE_PHYSICAL_CHURCH_AFTER_COVID-19.png",
      "pages": "4"
    },
    {
      "title": "The Covenant of Tithing",
      "subTitle": "The seal of God’s perfect authority over our lives",
      "summary": "[Malachi 3:10 Bring ye all the tithes into the storehouse, that there may be meat in mine house, and prove me now herewith, saith the LORD of hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall not be room enough to receive it.]  The only time God invites his people to test, examine or prove him (bāḥan) is in the scripture above which relates to tithing. Tithing is a covenant between God and the Christian who is born again, according to the command in Acts 2:38. The covenant of tithing was only for the children of Abraham, not the unsaved. “And if ye be Christ's, then are ye Abraham's seed, and heirs according to the promise” (Galatians 3:29). Tithing is a test: God tests the Christian’s ability to trust him with his or her material wealth. The foundation of tithing is the belief that God is the creator of everything, hence the owner of all things.",
      "pdfLink": "/sermons/THE_COVENANT_OF_TITHING.pdf",
      "image": "/sermons/THE_COVENANT_OF_TITHING.png",
      "pages": "5"
    },
    {
      "title": "The Appearing of the Lord Jesus Christ",
      "summary": "When God appeared to Adam and Eve in the Garden of Eden when they sinned, his appearance was a source of terror to them – they hid themselves. “And he said, I heard thy voice in the garden, and I was afraid, because I was naked; and I hid myself” (Genesis 3:10). The Lord Jesus Christ is going to appear soon; do you hear his voice? I hear the voice of Jesus everywhere these days – in the wars and rumors of wars (Matt 24:6); in the pestilences (Matt 24:7 e.g. Covid-19); in the buying and selling (Luke 17:28); in knowledge being increased (Dan 12:4); in the selfishness of people (2Tim 3:2); in the ungodliness and lack of fear of God (2Tim 3:4,5) and in the world’s prejudice against the nation of Israel (Zech 12:3), to name a few. I trust all of you here today love the Lord and have determined to prepare yourselves for his coming. Jesus’ return will not be a source of terror for us, but the fulfillment of a lifetime of loving him and preparing for this very event. Hallelujah!",
      "pdfLink": "/sermons/THE_APPEARING_OF_THE_LORD_JESUS_CHRIST.pdf",
      "image": "/sermons/THE_APPEARING_OF_THE_LORD_JESUS_CHRIST.png",
      "pages": "4"
    },
    {
      "title": "See the Individual, Not a Tribe!",
      "summary": "Tribalism is an aggressive, adversarial stance towards those who belong to a tribe or ethnic group other than one’s own. Thoughts, attitudes and actions are evaluated through the overriding interpretive lens of tribalism. Tribalism can never lead to peace because it thrives and is sustained by mistrust of the intentions of other tribes, whether real or imagined. Satan understands the capacity of tribalism to engender evil throughout the generations so he stokes the flames of tribalism ever so often. For tribalists, the sins of other tribes against them is “sacred”. This is recorded in the collective memory and repeated dutifully to the next generation. Tribalism is a sin in the sight of God because it rebels against the command to love your neighbor as yourself; it refuses to see others as individuals made in the image of God – rather, it prefers to see entire communities as suspicious groups worthy of contempt.",
      "pdfLink": "/sermons/SEE_THE_INDIVIDUAL_NOT_A_TRIBE.pdf",
      "image": "/sermons/SEE_THE_INDIVIDUAL_NOT_A_TRIBE.png",
      "pages": "5"
    },
    {
      "title": "PPTX for Beware the Curiosity of the King of Babylon",
      "summary": "Here is the power point presentation that was used for the sermon - Beware the Curiosity of the King of Babylon.",
      "pdfLink": "/sermons/BEWARE_THE_CURIOSITY_OF_THE_KING_OF_BABYLON_pptx.pdf",
      "image": "/sermons/BEWARE_THE_CURIOSITY_OF_THE_KING_OF_BABYLON.png",
      "pages": "13"
    },
    {
      "title": "Beware the Curiosity of the King of Babylon",
      "subTitle": "The Internet and the Christian",
      "summary": "The King of Babylon sent ambassadors to Jerusalem with the secret mission of assessing the strength and secrets of the Kingdom of Judah. We must understand the King of Babylon as a metaphor for a world in the service of Satan. It is significant that Babylon is prominent in the first and the last book of the Bible. The first time was when the children of Noah decided to congregate and build a tower that reached into heaven. God scattered them, confused the languages, and the place was called Babel, which means confusion",
      "pdfLink": "/sermons/BEWARE_THE_CURIOSITY_OF_THE_KING_OF_BABYLON.pdf",
      "image": "/sermons/BEWARE_THE_CURIOSITY_OF_THE_KING_OF_BABYLON.png",
      "pages": "4"
    },
    {
      "title": "Music, the King of Babylon and Worship",
      "summary": "The King of Babylon, Nebuchadnezzar, clearly understood music to be a vital accompaniment to worship. The Cambridge Dictionary defines music as, ‘A pattern of sounds made by musical instruments, voices, or computers, or a combination of these, intended to give pleasure to people listening to it.’ I believe that God made all things for his pleasure. The same Dictionary defines pleasure as, ‘Enjoyment, happiness, or satisfaction, or something that gives this.’ The sounds of nature – the wind, rivers, birds, animals and man – were intended to produce sounds for God’s pleasure. This is why Satan is so desirous of controlling and monitoring the gift of music.",
      "pdfLink": "/sermons/MUSIC_THE_KING_OF_BABYLON_AND_WORSHIP.pdf",
      "image": "/sermons/MUSIC_THE_KING_OF_BABYLON_AND_WORSHIP.png",
      "pages": "13"
    },
    {
      "title": "Parenting Girls For Christ",
      "summary": "Parenting Girls For Christ. Here is the power point presentation that was used for the Bible study that aimed to give biblical guide on how to bring up girls for Chirst.",
      "pdfLink": "/sermons/PARENTING_GIRLS_FOR_CHRIST.pdf",
      "image": "/sermons/PARENTING_GIRLS_FOR_CHRIST.png",
      "pages": "11"
    },
    {
      "title": "Jesus Loves the Single Parent Also",
      "summary": "Jesus Loves the Single Parent Also. Here is the power point presentation that was used for the Bible study that aimed to give biblical advice for single parents. Examples like Hagar, Hanna and Mary were studied.",
      "pdfLink": "/sermons/JESUS_LOVES_THE_SINGLE_PARENT_ALSO.pdf",
      "image": "/sermons/JESUS_LOVES_THE_SINGLE_PARENT_ALSO.png",
      "pages": "10"
    },
    {
      "title": "Making It To The Seventh Day",
      "summary": "[Genesis 2:2 And on the seventh day God ended his work which he had made; and he rested on the seventh day from all his work which he had made. 3And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made.] There is something special about the seventh day. God made man on the sixth day, but this was not the day he rested and blessed – that honor was reserved for the seventh day alone. In this sermon, with the help of the Lord, I will attempt to show you that the creation week portrays the struggle of our lives.",
      "pdfLink": "/sermons/MAKING_IT_TO_THE_SEVENTH_DAY.pdf",
      "image": "/sermons/MAKING_IT_TO_THE_SEVENTH_DAY.png",
      "pages": "4"
    },
    {
      "title": "Salvation From Beyond The Grave",
      "summary": "[Hosea 6:1-2 Come, and let us return unto the LORD: for he hath torn, and he will heal us; he hath smitten, and he will bind us up. 2 After two days will he revive us: in the third day he will raise us up, and we shall live in his sight.] Today we commemorate the resurrection of the Lord Jesus Christ this Easter Sunday. People could not understand how the crucified Lord, who seemed so helpless and defeated, could save them. However, this is precisely what happened: salvation came from beyond the grave. Indeed, this has been a recurring pattern in the Bible from the beginning. What seemed utterly feeble and hopeless, turned out to be the power of God in disguise.",
      "pdfLink": "/sermons/SALVATION_FROM_BEYOND_THE_GRAVE.pdf",
      "image": "/sermons/SALVATION_FROM_BEYOND_THE_GRAVE.png",
      "pages": "4"
    },
    {
      "title": "Jesus: The Scapegoat For Our Sins",
      "summary": "[Leviticus 16:8 And Aaron shall cast lots upon the two goats; one lot for the LORD, and the other lot for the scapegoat.] There were two goats of enormous significance for Israel during the Day of Atonement, Yom Kippur. The commandments concerning these goats pointed to the events surrounding the trial, judgement and death of our Lord Jesus during Passover. Hence, it is fitting that we study this prayerfully to commemorate the Lord’s sacrifice for us all. Now, the two goats had two purposes: the one was to be sacrificed for the Lord and the other was the scapegoat.",
      "pdfLink": "/sermons/JESUS_THE_SCAPEGOAT_FOR_OUR_SINS.pdf",
      "image": "/sermons/JESUS_THE_SCAPEGOAT_FOR_OUR_SINS.png",
      "pages": "4"
    },
    {
      "title": "Joshua – The Man Who Stopped Time To Finish God’s Work",
      "summary": "Joshua, the son of Nun, is a unique character in the Bible. From his youth he distinguished himself as a boy who loved God deeply and followed Moses, the servant of God, wholeheartedly. I pray today that the life of young Joshua will inspire my listeners, the young in particular, to dedicate themselves to a life of service and bold faith for the glory of the Lord Jesus Christ! Now, where did Joshua learn to appreciate and value the importance of time? We will need to go back to his youth in Egypt and join the timeless story of the Exodus, beginning with the most fearful night in the history of Israel.",
      "pdfLink": "/sermons/JOSHUA_THE_MAN_WHO_STOPPED_TIME_TO_FINISH_GOD_S_WORK.pdf",
      "image": "/sermons/JOSHUA_THE_MAN_WHO_STOPPED_TIME_TO_FINISH_GOD_S_WORK.png",
      "pages": "4"
    },
    {
      "title": "Women’s Long Hair - The Glory Of The Church",
      "summary": "1 Corinthians 11:15 “But if a woman have long hair, it is a glory to her: for her hair is given her for a covering”. In biblical language and imagery, a woman represents the church of the Lord Jesus Christ. Note carefully that the apostle Paul qualifies his statement with “if a woman have long hair…” Paul is aware that not all women will receive this invitation to holiness, especially in our modern world where self-will and rebellion are falsely labelled freedom and self-expression. Paul states, quite remarkably, that a woman who voluntarily chooses to grow her hair long will find that it is a “glory to her: for her hair is given her for a covering”. We must unpack this tantalizing statement full of promise. Let us first begin with the “glory to her”.  ",
      "pdfLink": "/sermons/WOMENS_LONG_HAIR_-_THE_GLORY_OF_THE_CHURCH.pdf",
      "image": "/sermons/WOMENS_LONG_HAIR_-_THE_GLORY_OF_THE_CHURCH.png",
      "pages": "4"
    },
    {
      "title": "In Judah (praise) Is God Known",
      "summary": "Psalm 76:1 [[To the chief Musician on Neginoth, A Psalm or Song of Asaph.]] In Judah is God known: his name is great in Israel. Praising God makes the unknown person known. Jacob loved Rachel, not Leah. When Leah bore children, she named them after her affliction and bitterness. She was the unknown and unwanted woman and wife(Gen 29:31-34). Notice that all her children served to remind and console her. It was about her, not the children. With each birth, she was still left in bitterness and anguish. However, interestingly, we seem to detect a final sense of peace and contentment in her life when she finally stopped focusing on her own pain, and began to look up to heaven and praise the almighty God. “And she conceived again, and bare a son: and she said, Now will I praise the LORD: therefore she called his name Judah; and left bearing” (Gen 29:35). There is something about praising God which will release us from our pain, anguish and frustration in this life.",
      "pdfLink": "/sermons/IN_JUDAH_IS_GOD_KNOWN.pdf",
      "image": "/sermons/IN_JUDAH_IS_GOD_KNOWN.png",
      "pages": "4"
    },
    {
      "title": "The Church at the Well",
      "summary": "God, who made the heavens and the earth, asked a woman “Give me to drink!” Can you imagine God who made the earth with over 70% of water asks a Samaritan woman for water from a well? What God is actually asking us is, “is the water you have satisfying your thirst?” By the time the conversation was over, the woman asked Jesus, “Sir, give me this water” (John 4:15). Thank God for thirst! God always finds his church by the water/well because he knows she will be thirsty and must come to the water to survive. May Jesus find his bride by the well – always thirsty! Thirst brought this woman to the well, and the identity of the Lord Jesus Christ was revealed to her. Only thirst will reveal the identity of Jesus to us. The journey to heaven begins with and is sustained by spiritual thirst. Are you still thirsty for Jesus Brothers and Sisters?",
      "pdfLink": "/sermons/THE_CHURCH_AT_THE_WELL.pdf",
      "image": "/sermons/THE_CHURCH_AT_THE_WELL.png",
      "pages": "4"
    },
    {
      "title": "The Ear Nailed To The Doorpost",
      "summary": "God commanded masters to grant freedom to their slaves or bondservants after six years. However, if a slave loved his or her master and refused freedom, God prescribed a significant ceremony which evoked memories of a powerful event going back to that fateful night when the Hebrews first tasted freedom after four hundred years of slavery in Egypt. “And they shall take of the blood, and strike it on the two side posts and on the upper door post of the houses, wherein they shall eat it” (Exodus 12:7).",
      "pdfLink": "/sermons/THE_EAR_NAILED_TO_THE_DOORPOST.pdf",
      "image": "/sermons/THE_EAR_NAILED_TO_THE_DOORPOST.png",
      "pages": "3"
    },
    {
      "title": "Truth Alone Unites And Keeps The Church Together",
      "summary": "Last week we considered the importance of holiness, and how God forgave the idolatry of Aaron, and made him a holy high priest. This week we will consider the role that truth plays in the unity of the church. The church can only have true unity in the true revelation of the Lord Jesus Christ – if this truth is changed or abandoned, the church will be dissolved. So the church must grow in the revelation of Jesus Christ and cleave tenaciously to it in order to enjoy a God-ordained unity. A good place to begin is the cause of the division of Israel into two nations.",
      "pdfLink": "/sermons/TRUTH_ALONE_UNITES_AND_KEEPS_THE_CHURCH_TOGETHER.pdf",
      "image": "/sermons/TRUTH_ALONE_UNITES_AND_KEEPS_THE_CHURCH_TOGETHER.png",
      "pages": "4"
    },
    {
      "title": "The Raven And The Dove",
      "summary": "How can we attract the Holy Spirit? Firstly, our salvation must be built carefully and correctly according to the word of God. During the forty days and nights of the Flood of Noah, the only structure left floating on the surface of the entire water-covered earth, was the ark built according to the dimensions of the word of God.",
      "pdfLink": "/sermons/THE_RAVEN_AND_THE_DOVE.pdf",
      "image": "/sermons/THE_RAVEN_AND_THE_DOVE.png",
      "pages": "4"
    },
    {
      "title": "Be Ye Holy; For I Am Holy",
      "summary": "Holiness is to be or stay in the Lord Jesus Christ constantly. While it begins with separation, the final destination is God himself. The main problem the nation of Israel faced was not to leave Egypt, that was something God alone could accomplish, but for Israel to stay in the Land of Canaan. The act of spiritual rebirth occurs relatively quickly. “Who hath heard such a thing? who hath seen such things? Shall the earth be made to bring forth in one day? or shall a nation be born at once? for as soon as Zion travailed, she brought forth her children” (Isaiah 66:8). However, the challenge is to grow and live in God – dwelling and lingering permanently in God’s presence is the only way to become holy, and this takes a lifetime. How long did it take for Moses’ face to shine brilliantly? Forty days and nights alone with God on Mount Sinai!",
      "pdfLink": "/sermons/BE_YE_HOLY.pdf",
      "image": "/sermons/BE_YE_HOLY.png",
      "pages": "3"
    },
    {
      "title": "Dividing The Jordan (2021) With A Double Portion Of The Spirit",
      "summary": "The River Jordan will be divided tonight. The River Jordan represents this night of 31st December 2021 – the division between 2020 and 2021; on the one side is the waters of 2020 and on the other, the waters of 2021. We are right now walking in the midst of the River Jordan. The fire of God in Elijah has divided the River Jordan in 2020 in one direction. It was not Elisha, but Elijah, who divided the River Jordan by the power of the fire of God in him. But, let us say that 2021 is the way back. You and I will become Elisha. We will receive a double portion of the Spirit of Jesus and divide the River Jordan ourselves with this new anointing for 2021.",
      "pdfLink": "/sermons/DIVIDING_THE_JORDAN.pdf",
      "image": "/sermons/DIVIDING_THE_JORDAN.png",
      "pages": "3"
    },
    {
      "title": "Yehovah Tsidqenuw",
      "summary": "Imagine not only borrowing, but forever owning, the righteousness of God almighty himself! This is precisely what God offers us in baptism in Jesus name – a permanent donning of his body, his righteousness. It is common to the human condition to seek to model and mimic someone else’s behavior; those we consider to be worthy of emulation. Sadly, we try to imitate the speech, acts and even dress of so-called “trendsetters” or the contemporary “influencers”. This is perhaps why some wish to rebel against the universalization of culture today and desperately seek to be “original” or “authentic”. In so doing, humans can only reclaim their sinful and depraved identity in our first parents, Adam and Eve",
      "pdfLink": "/sermons/YEHOVAH_TSIDQENUW.pdf",
      "image": "/sermons/YEHOVAH_TSIDQENUW.png",
      "pages": "3"
    },
    {
      "title": "Power Of The Name Of Jesus In Baptism",
      "summary": "Six times God mentions his great name in the Book of Malachi which precedes the Gospel of Matthew. God was preparing Israel and the world for the revelation of his great name. He clearly prophesied that his name would be great among the gentiles and the heathen. From the time of Adam, to the time of Caiaphas, the blood of nameless animals was shed for sins. I say nameless animals because without a name there is no power to deliver from sin. Each animal that was slain pointed to the coming Lord who would be slain for the sins of the world. But what is his name? What name was revealed to the whole world for salvation?",
      "pdfLink": "/sermons/POWER_OF_THE_NAME_OF_JESUS_IN_BAPTISM.pdf",
      "image": "/sermons/POWER_OF_THE_NAME_OF_JESUS_IN_BAPTISM.png",
      "pages": "4"
    },
    {
      "title": "The Fruit Of Baptism",
      "summary": "This statement of Jesus was for the Greeks who wanted to see him. \"And there were certain Greeks among them that came up to worship at the feast. The same came therefore to Philip, which was of Bethsaida of Galilee, and desired him, saying, Sir, we would see Jesus\" (John 12:20, 21). Europeans generally have travelled the world – some out of curiosity and others to conquer and own. Europeans love to be tourists, see places and bring back photos of distant lands and people. But the first Europeans who came to see Jesus were given a strange, ominous message – fall into the ground die.",
      "pdfLink": "/sermons/THE_FRUIT_OF_BAPTISM.pdf",
      "image": "/sermons/THE_FRUIT_OF_BAPTISM.png",
      "pages": "3"
    },
    {
      "title": "Genesis 1:26 And The Creation",
      "summary": "\"Let us\" and \"our image\" are believed by many Christians to reveal the Trinity collaboratively active in the creation of man. Is there a plurality in Genesis 1:26? If this is the case, we should expect the following Scriptures to be consistent and make explicit that there are indeed three beings involved in the creation of man. What does the next verse say?",
      "pdfLink": "/sermons/GENESIS _1_26_AND_THE_CREATION.pdf",
      "image": "/sermons/GENESIS _1_26_AND_THE_CREATION.png",
      "pages": "12"
    },
    {
      "title": "Ministers Of The Golden Lampstand",
      "summary": "The churches are branches that emerge from the body of our Lord Jesus Christ. There are six branches – the number of man – but, thankfully, Jesus perfects the church as the seventh branch in the middle (the shaft). Jesus declared, ‘I am the vine, ye are the branches: He that abideth in me, and I in him, the same bringeth forth much fruit: for without me ye can do nothing’ (John 15:5). It is this spiritual image, the menorah, which is the national symbol of Israel, and one of logos of the Apostolic church, which should serve as a powerful object lesson for all leaders and ministers in the body of Jesus Christ, the holy church. Let us begin with the first aspect of the candlestick – pure gold.",
      "pdfLink": "/sermons/MINISTERS_OF_THE_GOLDEN_LAMPSTAND.pdf",
      "image": "/sermons/MINISTERS_OF_THE_GOLDEN_LAMPSTAND.png",
      "pages": "3"
    },
    {
      "title": "The Death Of Death",
      "summary": "As we contemplate the death of our Lord Jesus Christ at this time of the year, I wish to focus on the sign of Jonah, which Jesus said pointed to his own death. So, in what way does Jonah’s story point to the Lord’s death? Let us begin with Jonah asleep in the ship. The sea raged and threatened to kill the mariners and passengers aboard if Jonah was not cast overboard. ‘Then said they unto him, What shall we do unto thee, that the sea may be calm unto us?",
      "pdfLink": "/sermons/THE_DEATH_OF_DEATH.pdf",
      "image": "/sermons/THE_DEATH_OF_DEATH.png",
      "pages": "2"
    },
    {
      "title": "The Fine Linen Of The Bride",
      "summary": "Every wedding since the beginning of the world pointed to the ultimate marriage ceremony of the Lamb. The apostle John reveals to us that the bride of Christ wears a garment made of fine line, clean and white, which represents the righteousness of the saints. I feel the best way to understand the meaning of marriage is to consider the mystery of the linen granted to the bride of Christ for that wonderful day which is coming. The best gift the Lord Jesus Christ could give to his wife, the church, is a garment made of linen to show his love for her. We need to unlock the mystery of the linen garment in order to better appreciate the meaning of marriage, including this marriage between Bro. Abel and Sis. Abineth.",
      "pdfLink": "/sermons/THE_FINE_LINEN_OF_THE_BRIDE.pdf",
      "image": "/sermons/THE_FINE_LINEN_OF_THE_BRIDE.png",
      "pages": "3"
    },
    {
      "title": "The Meaning Of Our Baptism In Jesus Name",
      "summary": "It was water that cut off Noah from the sinful world - permanently. The will of our God Jesus Christ is to cut his people off permanently from this world of sin, and he has ordained the waters of baptism in his name to accomplish this purpose. This first chapter is a call to Christians who have been baptized in Jesus name to remember the great significance of their baptism. As long as we are in this world, we will need to go back to the beginning and understand the foundations of our faith in order to continue on the path to heaven more determinedly. While baptized Christians are the intended audience, our prayer is for those who have not been baptized in Jesus name to join us in this journey to understand one of the great pillars of salvation and make an enlightened decision to be baptized in the saving name of our Lord Jesus Christ.",
      "pdfLink": "/sermons/THE_MEANING_OF_OUR_BAPTISM_IN_JESUS_NAME.pdf",
      "image": "/sermons/THE_MEANING_OF_OUR_BAPTISM_IN_JESUS_NAME.png",
      "pages": "5"
    },
    {
      "title": "The Miracle Of Marriage",
      "summary": "Marriage was first conceived in the mind of God. It was his idea! Everything else God created, he created out of nothing with his word: the stars and moon, the land and animals, to name a few. In regard to all living creatures, God made males and females separately, except for humans. This is the first unique miracle that God performed.",
      "pdfLink": "/sermons/THE_MIRACLE_OF_MARRIAGE.pdf",
      "image": "/sermons/THE_MIRACLE_OF_MARRIAGE.png",
      "pages": "3"
    },
    {
      "title": "The Origin Of The Body Of Our Lord Jesus Christ",
      "summary": "In the first part of the study, I will seek to show from the scriptures that our Lord Jesus Christ was in possession of a body that was not of human/dust origin, but heavenly, of the Holy Spirit. This was and still is unprecedented in the history of the world. Having established this, the second part will focus on the spiritual significance of this fact for our salvation. It stands to reason that since only God alone can save, the flesh and blood through which he redeemed us must be of incorruptible material.",
      "pdfLink": "/sermons/THE_ORIGIN_OF_THE_BODY_OF_OUR_LORD_JESUS_CHRIST.pdf",
      "image": "/sermons/THE_ORIGIN_OF_THE_BODY_OF_OUR_LORD_JESUS_CHRIST.png",
      "pages": "3"
    },
    {
      "title": "The Great Revival Of The Last Days",
      "summary": "The church must believe that people will rush to salvation in Jesus in the last days because God said it. Just as salmon find their way back from the vast ocean to their place of birth in a fresh stream, sinners will find they cannot resist the Spirit and love of Jesus Christ. Brothers and sisters, take courage from the prophecy of Joel! Today we strive with the lost, but one of these days, they will fly like doves back to where they belong.",
      "pdfLink": "/sermons/THE_GREAT_REVIVAL_OF_THE_LAST_DAYS.pdf",
      "image": "/sermons/THE_GREAT_REVIVAL_OF_THE_LAST_DAYS.png",
      "pages": "3"
    },
    {
      "title": "Holding The Word And Being Upheld By The Word",
      "summary": "What should a Christian do if the entire church forsakes the work of God and you find yourself alone? This was the unenviable situation that Eleazar the son of Dodo found himself in – he was deserted by all and left to confront the Philistines by himself. That is the time to firmly grip the sword that is in your hand and trust in God.",
      "pdfLink": "/sermons/HOLDING_THE_WORD_AND_BEING_UPHELD_BY_THE_WORD.pdf",
      "image": "/sermons/HOLDING_THE_WORD_AND_BEING_UPHELD_BY_THE_WORD.png",
      "pages": "3"
    },
    {
      "title": "The Seal Of Jesus –the Holy Spirit",
      "summary": "In ancient times, kings set their seals only on that which was valuable – the king’s treasure. When King Jesus fills you with his Holy Spirit, it is proof that you are his treasure. We are redeemed not with corruptible things like silver and gold, but with the blood of God himself (Acts 20:28). Therefore, given the priceless cost of our souls, God seals his purchased possession with his own Holy Spirit. To be filled with the Holy Spirit is proof that God has chosen you and that you are royal property",
      "pdfLink": "/sermons/THE_SEAL_OF_JESUS_THE_HOLY_SPIRIT.pdf",
      "image": "/sermons/THE_SEAL_OF_JESUS_THE_HOLY_SPIRIT.png",
      "pages": "3"
    },
    {
      "title": "Jesus, The King Of Kings",
      "summary": "In Genesis 24:2-9, we read that Eleazer put his hand under the thigh of Abraham and swear to never bring a wife from among the Canaanites for Isaac. The thigh represents one’s seed and, by extension, one’s strength and future. Today, we are the Eleazers of Jesus – we must put our hands under his thigh and promise to bring children that are born again of the King of Kings, and Lord of Lords. We must bring royal seed that are worthy of the title that is on the thigh of the Lord Jesus Christ. May our blood test read, “Child of the king of kings and Lord of Lords",
      "pdfLink": "/sermons/JESUS_the_king_of_kings.pdf",
      "image": "/sermons/JESUS_the_king_of_kings.png",
      "pages": "3"
    },
    {
      "title": "Born Of God",
      "summary": "The Lord Jesus Christ gave birth to us and is our Father. Many children can have one father, but one child cannot have many fathers. Right here we see the necessity of believing in one God alone, and not a Trinity. God supernaturally revealed to Isaiah the fatherhood of Jesus Christ 700 years prior to the word being made flesh in Israel: Isaiah 9:6 For unto us a child is born, unto us a son is given: and the government shall be upon his shoulder: and his name shall be called Wonderful, Counsellor, The mighty God, The everlasting Father, The Prince of Peace.",
      "pdfLink": "/sermons/BORN_OF_GOD.pdf",
      "image": "/sermons/BORN_OF_GOD.png",
      "pages": "3"
    },
    {
      "title": "Praying for the eyes of the young",
      "summary": "From the beginning of time, there has been a battle for the attention of youth. God wants to open their eyes to spiritual matters, but the enemy is equally determined to overwhelm their eyes with earthly, material things. When the army of Syria came to capture Elisha in the city of Dothan, the young servant of Elisha was overwhelmed with what his eyes saw. \"Therefore sent he thither horses, and chariots, and a great host: and they came by night, and compassed the city about\" (2 Kings 6:14). Thank God for the man of God! As long as there is an Elisha to pray for the eyes of the young to be spiritually opened, there is hope.",
      "pdfLink": "/sermons/PRAYING_FOR_THE_EYES_OF_THE_YOUNG.pdf",
      "image": "/sermons/PRAYING_FOR_THE_EYES_OF_THE_YOUNG.png",
      "pages": "4"
    },
    {
      "title": "The Young Man and His Linen Garment",
      "summary": "One reason many believe the young man in this vignette(Mark 14:51-42) is Mark himself is the fact that only he included this story in his Gospel. This was his own, unique experience with the Lord, as we all have our unique experiences with the Lord Jesus. He wanted the world to know about his experience with the Lord. “And there followed him a certain young man” demonstrates this young man’s deep love for Jesus.",
      "pdfLink": "/sermons/The_Young_Man_and_His_Linen_Garment.pdf",
      "image": "/sermons/The_Young_Man_and_His_Linen_Garment.png",
      "pages": "4"
    }
  ]
}
